[
  {
    "username": "CapitaineIb226",
    "tweet_id": "1816460280458600874",
    "url": "https://x.com/CapitaineIb226/status/1816460280458600874",
    "created_at": "Thu Jul 25 13:07:33 +0000 2024",
    "text": "J’ai remis ce matin, 15 unités mobiles de soins équipées (cliniques mobiles) et des équipements de la chaîne de froid au ministère de la Santé et de l’Hygiène publique. \n\nMa vision est de permettre aux braves populations du Burkina Faso d’avoir accès aux soins de santé spécialisés, et aux structures sanitaires de garantir la qualité des vaccins à tous les niveaux de notre système de santé, à travers une bonne conservation. \n\nJe me réjouis de toutes ces acquisitions dont l’objectif est d’améliorer l’offre de soin de santé dans notre pays. J’invite les bénéficiaires à en faire un très bon usage.",
    "likes": 5218,
    "retweets": 787,
    "replies": 503,
    "author": "Capitaine Ibrahim TRAORÉ"
  },
  {
    "username": "CapitaineIb226",
    "tweet_id": "1801603359620678072",
    "url": "https://x.com/CapitaineIb226/status/1801603359620678072",
    "created_at": "Fri Jun 14 13:11:27 +0000 2024",
    "text": "En cette Journée mondiale du donneur de sang, je salue les efforts du Centre national de transfusion sanguine (CNTS), des associations de promotion du don de sang et des donneurs bénévoles qui œuvrent à garantir la disponibilité du sang et des produits sanguins dans les hôpitaux publics et privés.\nJe félicite tous les acteurs de notre système de santé qui, chaque jour, s’investissent pour assurer des soins et services de santé de qualité à nos vaillantes populations.\nMalgré les efforts consentis par le CNTS et ses partenaires, les banques de sang éprouvent toujours des difficultés à répondre à la demande sans cesse croissante de sang, surtout en cette période palustre.\nC’est pourquoi, j’invite les Burkinabè particulièrement les jeunes, les élèves et les étudiants, dans les villes et les campagnes, à manifester leur solidarité, en donnant régulièrement leur sang pour sauver la vie de nos compatriotes.\nEnsemble, engageons-nous pour l’assainissement de notre cadre de vie en luttant contre l’insalubrité, les flaques d’eau usée, les nids de moustiques et les gîtes larvaires de toute sorte.\nChaque Burkinabè doit être responsable de sa santé et de celle des autres !",
    "likes": 8757,
    "retweets": 1108,
    "replies": 485,
    "author": "Capitaine Ibrahim TRAORÉ"
  },
  {
    "username": "CapitaineIb226",
    "tweet_id": "1730195256396730822",
    "url": "https://x.com/CapitaineIb226/status/1730195256396730822",
    "created_at": "Thu Nov 30 12:01:09 +0000 2023",
    "text": "C'est avec une légitime satisfaction que j'ai procédé, ce jeudi à la pose de la première pierre du Centre hospitalier régional universitaire de Gaoua. \nCette infrastructure sanitaire moderne de plus de trois cent lits contribuera à offrir des  services de santé et des soins de qualité à la vaillante population de la région du Sud-Ouest. Elle sera également un pôle d’excellence pour la formation académique et la recherche- développement en santé.\nTout en poursuivant la lutte farouche contre le terrorisme, nous nous investirons toujours avec détermination pour satisfaire les besoins essentiels de nos concitoyens.",
    "likes": 4342,
    "retweets": 515,
    "replies": 283,
    "author": "Capitaine Ibrahim TRAORÉ"
  },
  {
    "username": "CapitaineIb226",
    "tweet_id": "1713833812252152141",
    "url": "https://x.com/CapitaineIb226/status/1713833812252152141",
    "created_at": "Mon Oct 16 08:26:36 +0000 2023",
    "text": "C'est avec une immense tristesse que j'ai appris le décès du Docteur Zéphyrin DAKUYO. \nJe rends hommage à cet éminent pharmacien phytothérapeute qui a grandement contribué, par son engagement et ses recherches, à l'amélioration de la santé des Burkinabè. \nNotre pays et l'Afrique viennent de perdre un de ses dignes fils. J'exprime toute ma compassion à sa famille biologique et à l'ensemble des acteurs de la santé et de la recherche. Repose en paix, Dr. DAKUYO!",
    "likes": 2047,
    "retweets": 142,
    "replies": 179,
    "author": "Capitaine Ibrahim TRAORÉ"
  }
]