[
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1970902834502574209",
    "url": "https://x.com/CyrilRamaphosa/status/1970902834502574209",
    "created_at": "Wed Sep 24 17:27:08 +0000 2025",
    "text": "High-Level Meeting on Recommitting to Women's, Children's, and Adolescents' Health and Rights \n\n#UNGA80 🇺🇳 https://t.co/lxWCc1OujA",
    "likes": 133,
    "retweets": 40,
    "replies": 70,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1968321274591035405",
    "url": "https://x.com/CyrilRamaphosa/status/1968321274591035405",
    "created_at": "Wed Sep 17 14:28:56 +0000 2025",
    "text": "Allow me to extend my warmest wishes to Your Excellency PM @narendramodi on the occasion of your 75th birthday. \n \nMay this year be prosperous in both your personal and professional endeavours. It is my firm hope that the strong bond of solidarity and friendship between South Africa and India will continue to flourish under your inspirational leadership.\n \nI express hope for Your Excellency’s continued good health and wish you continued success in your esteemed role as the leader of the Republic of India.",
    "likes": 10687,
    "retweets": 1048,
    "replies": 176,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1965428248247972185",
    "url": "https://x.com/CyrilRamaphosa/status/1965428248247972185",
    "created_at": "Tue Sep 09 14:53:04 +0000 2025",
    "text": "Honourable Members,\n \nIt is vital that the National Council on Gender-Based Violence and Femicide is established with the authority and resources outlined in the Act. \n \nThe interim allocation of R5 million for the secretariat is a transitional measure, enabling the coordination of the implementation of the National Strategic Plan against GBVF.\n \nTo ensure that the National Council is able to fulfil its critical functions, National Treasury has approved the Council as a separate sub programme with ring-fenced funds from 1 April 2026.\n \nThe Council is planned for establishment from 1 April 2026, following due processes.\n \nMinisters have nominated government representatives to the Council and the relevant Portfolio Committee in the National Assembly will call for civil society and private sector nominations. \n \nThe Board will appoint the CEO and secretariat staff.\n \nDraft Regulations to coordinate provincial and local GBVF structures are being developed.\n \nThe strength of the National Strategic Plan lies in mobilising multiple stakeholders and mainstreaming this work across government. \n \nEvery government department and entity is expected to contribute to the implementation of the National Strategic Plan within its mandate, while the National Council provides leadership and oversight.\n \nAll relevent government departments have dedicated funds towards the implementation of those pillars of the National Strategic Plan that fall within their respective areas of responsibility.\n \nWhile the work to establish the National Council is underway, the implementation of the NSP is proceeding. \n \nFor example, the GBVF Natjoints established in April has strengthened government-wide coordination.\n \nAwareness campaigns, school and university interventions are ongoing.\n \nSexual Offences Courts, Thuthuzela Care Centres and GBV desks are operational nationwide.\n \nPsychosocial support and integrated services are provided through the Department of Social Development, Khuseleka One-Stop Centres and the GBV Command Centre.\n \nThere is also progress with economic empowerment initiatives, mainly through improving the access of women-owned businesses to procurement opportunities in both government and the private sector.\n \nThese initiatives show that the National Strategic Plan is a living framework. \n \nThe National Council is expected, once operational, toaccelerate this progress through stronger oversight, coordination and accountability.\n \nGender-based violence and femicide is a stain on the conscience of our nation. \n \nThe National Council is an important instrument in strengthening our response to this epidemic, ensuring that all South Africans are mobilised to ensure that is brought to an end.\n\n#RamaphosaQandA",
    "likes": 48,
    "retweets": 9,
    "replies": 80,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958419227871707561",
    "url": "https://x.com/CyrilRamaphosa/status/1958419227871707561",
    "created_at": "Thu Aug 21 06:41:44 +0000 2025",
    "text": "We believe that every woman has autonomy over her sexuality and reproductive choices. Every adolescent should get comprehensive sexual education. Every person should be free from sexually transmitted diseases.\n https://t.co/NONKp4iTCc",
    "likes": 62,
    "retweets": 13,
    "replies": 38,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958419163891859558",
    "url": "https://x.com/CyrilRamaphosa/status/1958419163891859558",
    "created_at": "Thu Aug 21 06:41:28 +0000 2025",
    "text": "We must stand firm against the reversals we are witnessing in sexual and reproductive health and rights. \n \nhttps://t.co/NONKp4iTCc",
    "likes": 37,
    "retweets": 14,
    "replies": 11,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958419105872019902",
    "url": "https://x.com/CyrilRamaphosa/status/1958419105872019902",
    "created_at": "Thu Aug 21 06:41:15 +0000 2025",
    "text": "The moral imperative is clear: no woman, child or adolescent should die of preventable causes.\n https://t.co/NONKp4iTCc",
    "likes": 36,
    "retweets": 11,
    "replies": 60,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958418804595179988",
    "url": "https://x.com/CyrilRamaphosa/status/1958418804595179988",
    "created_at": "Thu Aug 21 06:40:03 +0000 2025",
    "text": "The reality that we must confront is that too many women still die in childbirth of preventable causes. \n \nToo many children and adolescents still suffer and die from illnesses we know how to prevent or treat. \n \n https://t.co/NONKp4iTCc",
    "likes": 38,
    "retweets": 12,
    "replies": 16,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958418708692398376",
    "url": "https://x.com/CyrilRamaphosa/status/1958418708692398376",
    "created_at": "Thu Aug 21 06:39:40 +0000 2025",
    "text": "The Global Leaders Network is a coalition of heads of state and government united by the conviction that the health, dignity and potential of women, children and adolescents are the cornerstones of a fair, prosperous and peaceful world.\n https://t.co/NONKp4iTCc",
    "likes": 53,
    "retweets": 14,
    "replies": 24,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958418689935417360",
    "url": "https://x.com/CyrilRamaphosa/status/1958418689935417360",
    "created_at": "Thu Aug 21 06:39:35 +0000 2025",
    "text": "It is an honour to stand before you as the chair of the Global Leaders Network for Women’s, Children’s and Adolescents’ Health, alongside fellow members Ethiopia and Nigeria.\n https://t.co/NONKp4iTCc",
    "likes": 32,
    "retweets": 9,
    "replies": 9,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1958417239574544727",
    "url": "https://x.com/CyrilRamaphosa/status/1958417239574544727",
    "created_at": "Thu Aug 21 06:33:50 +0000 2025",
    "text": "Investing in Peace: Digital Transformation in Health for Adolescent Youth and Women https://t.co/DzDR7ujjp8",
    "likes": 48,
    "retweets": 12,
    "replies": 20,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1954125717072978178",
    "url": "https://x.com/CyrilRamaphosa/status/1954125717072978178",
    "created_at": "Sat Aug 09 10:20:51 +0000 2025",
    "text": "The greatest challenge we face in this country is the pandemic of violence against women and children. \n \nWe condemn the many high cases of gender-based violence and femicide recorded in our nation.\n https://t.co/GDeNelRDr0",
    "likes": 17,
    "retweets": 5,
    "replies": 16,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1953786256694944183",
    "url": "https://x.com/CyrilRamaphosa/status/1953786256694944183",
    "created_at": "Fri Aug 08 11:51:57 +0000 2025",
    "text": "Clean water is not a luxury. It is a right.\n \nPoor water quality leads to public health crises, economic hardship and a breakdown of confidence in our institutions.\n \n https://t.co/KApSvzJCCK",
    "likes": 30,
    "retweets": 8,
    "replies": 22,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1953786182845751479",
    "url": "https://x.com/CyrilRamaphosa/status/1953786182845751479",
    "created_at": "Fri Aug 08 11:51:40 +0000 2025",
    "text": "Our people expect clean water when they turn on the tap.\n \nThey deserve water that is free from contaminants and that meets the highest global standards.\n \n https://t.co/KApSvzJCCK",
    "likes": 72,
    "retweets": 21,
    "replies": 103,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1949420390029181350",
    "url": "https://x.com/CyrilRamaphosa/status/1949420390029181350",
    "created_at": "Sun Jul 27 10:43:34 +0000 2025",
    "text": "We are particularly horrified by the deliberate starvation of the people of Gaza.\n \nWe call on the state of Israel to allow food and essential aid to be distributed. \n \nhttps://t.co/nJRI8j1gdv",
    "likes": 284,
    "retweets": 86,
    "replies": 253,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1947930925901189433",
    "url": "https://x.com/CyrilRamaphosa/status/1947930925901189433",
    "created_at": "Wed Jul 23 08:04:58 +0000 2025",
    "text": "Today, our thoughts are with Banyana Banyana’s @G_Salgado9 as we wish Gabriela a comfortable and speedy recovery from her traumatic injury in last night’s WAFCON semi-final against a victorious Nigeria.\n\nI know you’re a woman of deep and public faith, Gabriela, and you’re a woman of bravery and skill on the pitch.\n\nThe nation wishes you well.\n\nCasablanca was always going to be a tough ask for our national team as Africa’s defending champions and Nigeria’s breakthrough in extra time proved this.\n\nWe are confident Banyana Banyana will regroup and return to WAFCON as future champs.\n\nWe wish Nigeria’s Super Falcons and Morocco’s Atlas Lionesses well for Saturday’s dream home final for the host nation.",
    "likes": 1080,
    "retweets": 132,
    "replies": 136,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1943596069851406492",
    "url": "https://x.com/CyrilRamaphosa/status/1943596069851406492",
    "created_at": "Fri Jul 11 08:59:47 +0000 2025",
    "text": "We have made significant advances in expanding opportunities and access to housing, land, basic services, education and health care.\n https://t.co/34pPQHBUfB",
    "likes": 28,
    "retweets": 6,
    "replies": 70,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1942446104777273567",
    "url": "https://x.com/CyrilRamaphosa/status/1942446104777273567",
    "created_at": "Tue Jul 08 04:50:14 +0000 2025",
    "text": "Brazil’s leadership of #BRICS and #COP30 together with South Africa’s Presidency of the #G20 provides an opportunity to send a strong signal of unity and solidarity in support of the rights and interests of developing economy countries.\n\n~ My remarks at the BRICS Leaders’ Summit session on Environment, COP30 & Global Health",
    "likes": 575,
    "retweets": 134,
    "replies": 195,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1937462876413059353",
    "url": "https://x.com/CyrilRamaphosa/status/1937462876413059353",
    "created_at": "Tue Jun 24 10:48:40 +0000 2025",
    "text": "Oversight Visit - Steve Biko Hospital in Gauteng https://t.co/gsyuMVdf4l",
    "likes": 115,
    "retweets": 19,
    "replies": 64,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1931784292558102688",
    "url": "https://x.com/CyrilRamaphosa/status/1931784292558102688",
    "created_at": "Sun Jun 08 18:44:00 +0000 2025",
    "text": "Congratulations to Gerda Steyn and Tete Dijana on racing to the top of the podium in the 98th Comrades Marathon.\n\nFor both of you and the millions watching this international showcase of endurance of body and mind, the Down Run was a captivating achievement that made our nation proud.\n\nWe congratulate your podium companions as well as the more than 22 000 runners for whom the Comrades is a way of life and an annual surge of inspiration not only across the Valley of a Thousand Hills but in every corner of the world.",
    "likes": 1940,
    "retweets": 198,
    "replies": 112,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1931078312765370416",
    "url": "https://x.com/CyrilRamaphosa/status/1931078312765370416",
    "created_at": "Fri Jun 06 19:58:42 +0000 2025",
    "text": "From nutrition to health care, from early childhood development to the quality of basic education, we must ensure that the black child receives the same developmental foundation that all children need to succeed in life.\nhttps://t.co/mESvggsrNA",
    "likes": 50,
    "retweets": 13,
    "replies": 106,
    "author": "Cyril Ramaphosa 🇿🇦"
  },
  {
    "username": "CyrilRamaphosa",
    "tweet_id": "1928748072986677480",
    "url": "https://x.com/CyrilRamaphosa/status/1928748072986677480",
    "created_at": "Sat May 31 09:39:09 +0000 2025",
    "text": "We have made significant progress in advancing women’s rights in education, health, social protection, political representation and economic participation. \n \nThis progress was not achieved by chance.\n \n https://t.co/OytOuX00DR",
    "likes": 55,
    "retweets": 15,
    "replies": 47,
    "author": "Cyril Ramaphosa 🇿🇦"
  }
]