[
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1982133451206635887",
    "url": "https://x.com/DrTunjiAlausa/status/1982133451206635887",
    "created_at": "Sat Oct 25 17:13:35 +0000 2025",
    "text": "It was my honour to join the Nigerian Academy of Medical Sciences for this year’s Induction Ceremony — a gathering of some of our nation’s finest minds dedicated to advancing medical science, research, and national well-being.\n\nI am deeply grateful to the Academy and the Board of Trustees for my own induction as an Honorary Fellow. This recognition is a profound honour, and I accept it with humility and a renewed sense of responsibility. It strengthens my resolve to continue working — through education — to build the kind of strong, knowledge-driven health system our nation deserves.\n\nAs Honourable Minister of Education, I am proud of the synergy between the Academy’s mission and our ongoing reforms under the Renewed Hope Agenda of President Bola Ahmed Tinubu, GCFR. By expanding medical training capacity, strengthening research institutions, upgrading teaching hospitals, and widening STEMM pathways for young Nigerians, we are laying a sustainable foundation for world-class medical education and healthcare delivery.\n\nI look forward to deepening our partnership with the Academy as we continue to invest in knowledge, nurture talent, and build a healthier, more secure and more prosperous Nigeria.\n\nTo all newly inducted Fellows, I salute your service and dedication to humanity. \n\nCongratulations once again to the Academy and all its new Fellows — and thank you for this great honour.",
    "likes": 128,
    "retweets": 37,
    "replies": 21,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1980533940004770059",
    "url": "https://x.com/DrTunjiAlausa/status/1980533940004770059",
    "created_at": "Tue Oct 21 07:17:42 +0000 2025",
    "text": "It was an honour to commission the Kensington Adebukola Adebutu Research Centre (KAARC) alongside His Excellency, Governor Babajide Sanwo-Olu, CON, yesterday at my alma mater, the College of Medicine, University of Lagos.\n\nResearch is the backbone of every thriving economy. No nation can grow faster than its capacity to generate knowledge, develop solutions, and convert innovation into industry. For Nigeria, investing in research is not optional — it is the bridge between our challenges and the breakthroughs that will power our future.\n\nThe KAARC seamlessly aligns with Mr. President’s Renewed Hope Agenda for Education, where we are committed to building world-class learning and research environments for our students, teachers, and institutions.\n\nMr. President has also reaffirmed his commitment to establishing a National Research Agency, backed by a dedicated National Research Fund, to support homegrown innovation, strengthen local capacity, and ensure Nigerian researchers have the tools, resources, and grants needed to compete globally and solve local problems.\n\nI extend my profound gratitude to Sir (Dr.) Kensington Adebukola Adebutu, OON, CON, CFR, KJW, FISM, FNIJ, FAMedS, a distinguished Nigerian philanthropist and visionary for gifting MEDILAG with this remarkable facility — one that will advance research, push boundaries, and heal lives.\n\nGreat Akokites, this research centre is for you. To our students, lecturers, and researchers: use the KAARC judiciously, meticulously, and meaningfully. Be innovative, be curious, be courageous. Let your work redefine what is possible.\n\nThe future is yours.",
    "likes": 250,
    "retweets": 53,
    "replies": 10,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1974183564569718818",
    "url": "https://x.com/DrTunjiAlausa/status/1974183564569718818",
    "created_at": "Fri Oct 03 18:43:35 +0000 2025",
    "text": "Whilst in Gombe, I also had the privilege of joining Her Excellency, the First Lady of Nigeria, @SenRemiTinubu , CON, at the launch of the “Flow with Confidence” menstrual health awareness campaign—a bold and transformative initiative of the Renewed Hope Initiative.\n\nThis campaign is designed to break the stigma surrounding menstruation, restore dignity, and ensure that no girl misses school because of her period.\n\nThrough Flow with Confidence:\n•370,000 schoolgirls in rural and underserved areas will each receive a full one-year supply of disposable sanitary pads, helping them stay in school without fear or shame.\n•Menstrual hygiene education and awareness will be delivered in schools, communities, and families to demystify menstruation and end harmful taboos.\n•Teachers, health educators, and school counselors will be trained to provide accurate information and emotional support to girls.\n\nAs Minister of Education, I am proud to affirm that the Federal Ministry of Education, through UBEC, along with our partners will be integrating menstrual health education into the school curriculum, strengthening WASH facilities, and supporting the establishment of safe spaces and girls’ clubs in schools.\n\nI am equally pleased that my brother, the Honourable Minister of Health and Social Welfare, Professor @muhammadpate , has pledged that the FMOH&SW will further support this campaign through a special grant.\n\nTogether, under the visionary leadership of the First Lady, we are building a Nigeria where every girl can sit in a classroom with pride and possibility, unhindered by stigma or lack of access.\n\n#RenewedHope #menstrualcare",
    "likes": 132,
    "retweets": 31,
    "replies": 14,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1974113984493080934",
    "url": "https://x.com/DrTunjiAlausa/status/1974113984493080934",
    "created_at": "Fri Oct 03 14:07:05 +0000 2025",
    "text": "I had the honour of accompanying Her Excellency, the First Lady of Nigeria, Senator Oluremi Tinubu, CON, on her first official visit to Gombe State, marked by a series of engagements that reflect the state’s commitment to progress and transformation.\n\nWhilst there, we attended Gombe’s first-ever Health Summit, where, together with the First Lady @SenRemiTinubu , and His Excellency, Governor Muhammadu Inuwa Yahaya, CON, Governor of Gombe State, I joined my brother, the Coordinating Minister of Health and Social Welfare, Prof. @muhammadpate , to launch the Healthcare Workforce Policy and Sustainable Development Plan — a milestone that will strengthen the state’s health system.\n\nWe also paid homage to His Royal Highness, the Emir of Akko, where Her Excellency was conferred the revered title “Sarauniya Yakin Kumo” (Queen Warrior of Akko Emirate)—a recognition of her tireless advocacy for women and girls across Nigeria.\n\nThe visit further featured the commissioning of FMC Kubo, Gombe, and a meeting with traditional leaders at the Governor’s House to deepen collaboration for the state’s growth and development.\n\nI extend my deepest gratitude to Her Excellency, the First Lady, for her unwavering commitment to the wellbeing of Nigerians, especially students and young girls, and to Governor Muhammadu Inuwa Yahaya for his warm hospitality and steadfast dedication to his people.\n\nTogether, these steps reflect our shared vision of a healthier, stronger, and more prosperous Nigeria.",
    "likes": 47,
    "retweets": 12,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1956258174547202436",
    "url": "https://x.com/DrTunjiAlausa/status/1956258174547202436",
    "created_at": "Fri Aug 15 07:34:28 +0000 2025",
    "text": "It gives me great pleasure to officially launch a landmark initiative that speaks directly to the heart of our commitment to the welfare and professional growth of our nation’s tertiary institution workforce — the Tertiary Institutions Staff Support Fund (TISSF).\n\nTISSF is not just a welfare package; it is a strategic empowerment platform designed to give our academic and non-academic staff the financial stability they need to serve our students with renewed dedication, and to live with dignity and pride.\n\nIt is an integral part of President @officialABAT, GCFR’s Renewed Hope Reform Agenda for Education, which places our people — our greatest asset — at the centre of transforming our education sector and growing our economy.\n\nTISSF is a joint initiative of the Federal Ministry of Education and the Tertiary Education Trust Fund (TETFund), implemented in partnership with the @BOINigeria. It is a free, 0% interest loan scheme aimed at enhancing welfare, supporting career development, and promoting financial independence for staff in Nigerian tertiary institutions.\n\nWhat do staff get?\n•Up to ₦10 million (capped at 33.3% of gross annual salary) — repayable after 5 years, with a 12-month moratorium before repayment begins.\n\nWhat does TISSF cover?\nI. Medical Support: Surgeries, emergency care, medication.\nII. Family & Accommodation Support: Rent, home ownership, renovation.\nIII. Transportation: Vehicle purchase (including EVs), bikes, tricycles, CNG conversions.\nIV. Small-Scale Enterprise & Agriculture: Poultry, fishing, crop farming, agro-processing.\nV. Academic Advancement: Professional certifications, degrees, capacity-building programmes.\n\nWho’s eligible?\n• Confirmed full-time academic and non-academic staff of any federal university, polytechnic, or college of education.\n• One state university, polytechnic, and college of education in each state.\n• Applicants with at least five (5) years remaining until retirement.\n• Membership of relevant staff associations such as ASUU, SSANU, NASU, etc.\n\nTo all eligible staff across our universities, polytechnics, and colleges of education: begin your application today. It’s time to seize the moment!\n\nApply now: https://t.co/V6aGmfdVDV",
    "likes": 266,
    "retweets": 91,
    "replies": 127,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1947558269582553468",
    "url": "https://x.com/DrTunjiAlausa/status/1947558269582553468",
    "created_at": "Tue Jul 22 07:24:10 +0000 2025",
    "text": "On Monday, we held the inaugural meeting of the National Steering Committee for the Human Capital Opportunities for Prosperity and Equity (#HOPE) project, which includes HOPE-Education, HOPE-Health, and HOPE-Gov.\n\nThe Steering Committee comprises the Minister of Budget, Senator @atikuabagudu; the Minister of Finance and Coordinating Minister of the Economy, Mr. Wale Edun, @FinMinNigeria; the Coordinating Minister of Health and Social Welfare (CMHSW), Prof. @muhammadpate; myself @NigEducation; and the three National Programme Coordinators. The HOPE series of programmes will be catalytic to broader federal government initiatives. In this regard, the Honourable Minister of Women Affairs, Hajiya Imaan Sulaiman-Ibrahim, @hm_womenaffairs, was also in attendance to ensure inclusive participation and synergy from the outset.\n\nThis HOPE initiative further exemplifies President Bola Ahmed Tinubu, GCFR’s, unwavering belief in human capital development—particularly in education, health, and social protection. The President remains deeply committed to advancing these investments to unlock significant demographic dividends for the Nigerian people.\n\nWe are building a nation where young Nigerians are well-educated, have access to quality healthcare, and are empowered to become a strong and productive workforce.\n\nHOPE-Education is a $552 million programme co-financed by the World Bank and the Global Partnership for Education (GPE). It focuses on three key pillars:\n1. Improving the quality of education,\n\n2. Expanding access to quality education, and\n\n3. Strengthening education systems across all states.\n\nThe programme places special emphasis on foundational learning, teacher professional development, data and digitalization, and reducing the number of out-of-school children.\nBy the end of the project, we aim to reach:\n• 29 million children,\n• 500,000 public school teachers,\n• 65,000 public schools, and\n• 10,000 non-formal learning centres.\n\n@officialABAT is delivering on his promises. Thank you, Mr. President, for your visionary leadership.",
    "likes": 93,
    "retweets": 35,
    "replies": 19,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1937938577943351800",
    "url": "https://x.com/DrTunjiAlausa/status/1937938577943351800",
    "created_at": "Wed Jun 25 18:18:56 +0000 2025",
    "text": "Join me, on behalf of the Federal Ministry of Education, in extending heartfelt congratulations to my dear brother, His Excellency Governor @jidesanwoolu , on the occasion of his 60th birthday.  \n\nThis remarkable milestone is a testament to a life dedicated to purposeful leadership, public service, and the advancement of our society. \n\nYour unwavering commitment to the people of Lagos continues to inspire many across the nation.  \n\nAs you celebrate this special day, I pray for continued wisdom, strength, and impactful years ahead. Wishing you many more fruitful and fulfilling years in good health and grace.",
    "likes": 75,
    "retweets": 13,
    "replies": 14,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1920070511624638537",
    "url": "https://x.com/DrTunjiAlausa/status/1920070511624638537",
    "created_at": "Wed May 07 10:57:37 +0000 2025",
    "text": "Following conversations with the Director-General of the @officialnyscng, Brigadier General Olakunle Oluseye Nafiu, the Minister of Youth, and the Special Adviser to the President on Policy Coordination, @hadizabalausman , I’m pleased to announce a major step forward in the reform of the National Youth Service Corps (NYSC).\n\nYesterday, alongside Minister of Youth and Development Ayodele Olawande, @ayowisdom_, and SAP Hadiza Bala Usman, we inaugurated the NYSC Reform Committee, marking a critical move toward reviewing and revising the NYSC Act to better serve the needs of today’s youth and align with national development priorities.\n\nWe are collectively committed to ensuring that NYSC evolves into a more dynamic, responsive, and impactful institution—one that is aligned not just with national development goals but also with the current realities and aspirations of Nigeria’s young people. Thus becoming a more relevant, skill-building institution that empowers young Nigerians.\n\nThe committee will review proposals such as: an optional two-year Medical Corps and Teacher Corps under the NYSC, which will deploy doctors, nurses, pharmacists, dentists, and educators to underserved rural areas—addressing critical gaps in healthcare and education.\n\nOur belief is that these reforms will elevate the NYSC into a strategic institution that not only fosters unity but also delivers tangible value to both the nation and the individuals who serve. \n\nI look forward to working closely with my colleagues to implement these changes and support a future where every young Nigerian is equipped and empowered to contribute meaningfully to our country’s progress.",
    "likes": 283,
    "retweets": 113,
    "replies": 29,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1919816029066133716",
    "url": "https://x.com/DrTunjiAlausa/status/1919816029066133716",
    "created_at": "Tue May 06 18:06:24 +0000 2025",
    "text": "Under my leadership — alongside the Honourable Minister of State for Education, Permanent Secretary and our FME Directors — I am proud to announce the launch of Nigeria’s first-ever National Anti-Bullying Policy — a comprehensive step forward in ensuring our schools are safe, inclusive, and supportive environments for every child.\n\nThis marks a historic moment for education in Nigeria.\n\nBullying has no place in our classrooms or communities. This policy is not just about punishment — it is about prevention, education, accountability, and protection. It reflects our deep commitment to the emotional and psychological well-being of every learner across the country.\n\nWe are working closely with educators, parents, and students to implement clear guidelines, empower school leadership, and provide the tools needed to identify and stop bullying in all its forms.\n\nI extend my heartfelt gratitude to the Technical Working Committee for their dedication and expertise in developing these comprehensive policy guidelines. Your work will positively impact generations of Nigerian children and students.\n\nTogether, we can build a future where every Nigerian child feels seen, safe, and supported.\n\n#EndBullying #EducationForAll #SafeSchools",
    "likes": 257,
    "retweets": 99,
    "replies": 24,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1919424216408932849",
    "url": "https://x.com/DrTunjiAlausa/status/1919424216408932849",
    "created_at": "Mon May 05 16:09:29 +0000 2025",
    "text": "I was honoured to inaugurate the Technical Working Group (TWG), tasked with engaging a private facility manager for the State House Medical Centre.\n\nOriginally purpose-built for the First and Second Family, the Centre’s scope of work has been expanded to deliver world-class healthcare services to members of the House of Assembly, the Judiciary, Ministers and all those who work within the State House.\n\nThe TWG, composed of technocrats and skilled professionals from relevant sectors —including the Special Adviser to the President on Health, representatives from the Chief of Staff’s Office, Federal Civil Service Commission, Federal Ministry of Justice, Bureau of Public Procurement, and NELFUND—was carefully selected to undertake this important initiative.\n\nThis assignment is not solely about facility management it is about setting a precedent for how public assets, particularly healthcare assets can be suitably managed  for optimal service delivery to the benefit of our great nation.\n\nI extend my gratitude to our formidable leader, President Bola Ahmed Tinubu, for selecting us to carry out this critical initiative, and thanks to the TWG members for their willingness to serve and fulfil this mandate with the outmost seriousness, focus and integrity it deserves.",
    "likes": 135,
    "retweets": 44,
    "replies": 16,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1917580284314226714",
    "url": "https://x.com/DrTunjiAlausa/status/1917580284314226714",
    "created_at": "Wed Apr 30 14:02:21 +0000 2025",
    "text": "I am pleased to announce the Federal Ministry of Education’s  (FME), in collaboration with TETFund, High Impact Intervention Project, which is set to rehabilitate 18 medical schools across Nigeria’s six (6) geopolitical zones.\n\nA key objective of our Nigerian Education Sector-Wide Renewal Initiative (NESRI) is to enhance STEMM education—Science, Technology, Engineering, Mathematics, and Medical Sciences.\n\nCurrently, Nigeria faces a deficit of over 300,000 doctors. This shortage extends to other health professions, including nursing, pharmacy, dentistry, and more.\n\nThis N110 billion project is a strategic response to the urgent need to expand our medical training capacity. It involves rehabilitating and modernizing essential infrastructure—lecture theatres, laboratories, hostels, and clinical learning environments—to significantly increase enrolment in Medicine, Dentistry, Pharmacy, and Nursing programs across selected universities.\n\nBy doing so, we are not only expanding access but also laying a solid foundation for producing a new generation of highly trained health professionals who will serve Nigeria today and lead globally tomorrow.\n\nWe recognize that building physical structures alone is not enough. Through the development of simulation labs across the geopolitical zones, we will strengthen the quality of training and education provided to our health and allied health students.\n\nThis is the Mandate for Education set by Mr. President. With the support of the Technical Working Committee inaugurated to bring this vision to life, we WILL deliver on Mr. President’s Renewed Hope Agenda.\n\nBelow is the list of tertiary institutions included in the project:\n\n1. Abubakar Tafawa Balewa University, Bauchi  \n2. Ahmadu Bello University, Zaria  \n3. Bayelsa State Medical University  \n4. Benue State University, Makurdi  \n5. Imo State University, Owerri  \n6. Gombe State University  \n7. Nnamdi Azikiwe University, Awka  \n8. Ondo State Medical University  \n9. University of Benin  \n10. University of Calabar  \n11. University of Ibadan  \n12. University of Ilorin  \n13. University of Jos  \n14. University of Lagos  \n15. University of Maiduguri  \n16. University of Nigeria, Nsukka  \n17. Umar Musa Yar'Adua University, Katsina  \n18. Usmanu Dan Fodio University, Sokoto",
    "likes": 341,
    "retweets": 129,
    "replies": 43,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1916732447565246882",
    "url": "https://x.com/DrTunjiAlausa/status/1916732447565246882",
    "created_at": "Mon Apr 28 05:53:21 +0000 2025",
    "text": "PROMISE KEPT: NIGERIA'S NURSING EDUCATION ANNUAL ENROLLMENT GETS BOOST IN HISTORICAL SURGE FROM 28,000 TO 115,000 https://t.co/Pp4sG6vX3h",
    "likes": 373,
    "retweets": 178,
    "replies": 28,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1910750238610251858",
    "url": "https://x.com/DrTunjiAlausa/status/1910750238610251858",
    "created_at": "Fri Apr 11 17:42:11 +0000 2025",
    "text": "In line with our NESRI six-point agenda, and in keeping with Mr President’s @officialABAT commitment to providing quality education for all, the Federal Ministry of Education @NigEducation, in collaboration with @TETFundNg, has been developing a platform to enhance diaspora engagement in our education, research, and medical institutions. \n\nBRIDGE—Diaspora Bridging Research, Innovation, Development, and Global Engagement—is the Federal Ministry of Education’s (FME) initiative designed to ensure Nigerian academia and medical institutions benefit from global expertise, funding opportunities, industry linkages, and knowledge transfer.\n\nThe portal, set to launch in May 2025, creates structured pathways for Nigerian scholars and professionals abroad to engage meaningfully with institutions back home—bridging gaps in teaching, medical service provision, research capacity, teaching methodologies, and industry relevance.\n\nAs a fellow returnee, once eager to contribute to the transformation of our great nation, I felt it was only fitting—now as Minister of Education—to simplify the process through which Nigerians in the diaspora can give back and support national development.\n\n#BRIDGE is a game-changer in how the country engages with diaspora Nigerian professionals in academia, medical sciences, the arts, industry, and other sectors. Such engagement is essential for unlocking Nigeria’s untapped potential and driving transformative change across our society.\n\nAs part of BRIDGE’s rollout, today we are demonstrating the platform’s capabilities at ANPA Lagos. Next week, we will engage Vice-Chancellors, Rectors, and Provosts of our tertiary institutions on onboarding their institutions onto the platform and connecting with the diaspora community.\n\nWe are incredibly proud of this initiative and look forward to the positive impact it will deliver.\n\n**Together, we are bridging the gap for a brighter tomorrow.**",
    "likes": 112,
    "retweets": 60,
    "replies": 13,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1909295875450347744",
    "url": "https://x.com/DrTunjiAlausa/status/1909295875450347744",
    "created_at": "Mon Apr 07 17:23:04 +0000 2025",
    "text": "To conclude Big Win’s visit to Abuja, the Big Win Philanthropy team and I were privileged to have an audience with His Excellency Senator Kashim Shettima, Vice President of the Federal Republic of Nigeria.\n\nOur discussion centered on the Vice President’s strategic vision and leadership in improving food security and reducing malnutrition in Nigeria; Big Win’s experience in supporting multisectoral nutrition programs in other countries; and the potential for Big Win to complement His Excellency’s strategic leadership of the Nutrition-774 Initiative.\n\nWe also discussed how to leverage private sector investment to catalyze urban development across the country.\n\nI extend my thanks to His Excellency for his warm reception and his dedication to building a vibrant and improved Nigeria.",
    "likes": 92,
    "retweets": 33,
    "replies": 5,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1903027020600160520",
    "url": "https://x.com/DrTunjiAlausa/status/1903027020600160520",
    "created_at": "Fri Mar 21 10:12:52 +0000 2025",
    "text": "I was honored to attend the launch of the Nigeria Customs Service’s (NCS) Customs Cared initiative, which aims to foster inclusive growth and sustain impact across Nigerian communities.\n\nThrough this initiative, the NCS reinforces its role as a champion of national and human capital development by addressing critical areas such as healthcare, education, social investments, food security, environmental sustainability, and the creative economy.\n\nThe Federal Ministry of Education particularly welcomes the NCS’ strong emphasis on education, which includes plans to rehabilitate schools to provide conducive learning environments, supply learning materials, and offer scholarships to ensure access to education for all.\n\nI commend the Comptroller General of the NCS for his leadership and resilience in propelling the NCS to greater heights with such a noteworthy initiative. Together, we can bring President Bola Ahmed Tinubu’s vision for Nigeria to fruition.",
    "likes": 61,
    "retweets": 15,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1902431756424249523",
    "url": "https://x.com/DrTunjiAlausa/status/1902431756424249523",
    "created_at": "Wed Mar 19 18:47:30 +0000 2025",
    "text": "I was pleased to inaugurate the newly appointed Registrar/CEO of NABTEB, Deputy Executive Secretary (Services) and the Deputy Executive Secretary (Technical) of @ubecnigeria , and the Vice Chancellor and Principal Officers of Federal University of Medicine and Medical Sciences, Abeokuta, Ogun State.\n\nThe President is deeply committed to the growth of education, healthcare, and social protection. Each Principal Officer was carefully selected based on their experience to lead these agencies and institutions to greater heights.\n\nThe Federal Ministry of Education has taken its time to develop our NESRI Plan and its six high-priority areas, which these Principal Officers must adhere to in order to create effective and lasting change in our sector.\n\nI extend my congratulations to all the Principal Officers once again for taking up this critical task. The journey to greatness is never simple, but every step taken, every challenge faced, makes the destination truly worth it.",
    "likes": 80,
    "retweets": 26,
    "replies": 8,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1899103388916167158",
    "url": "https://x.com/DrTunjiAlausa/status/1899103388916167158",
    "created_at": "Mon Mar 10 14:21:46 +0000 2025",
    "text": "PRESS RELEASE\n\nENSURING STUDENT WELFARE: FEDERAL MINISTRY OF EDUCATION INVESTIGATES FOOD QUALITY IN FEDERAL UNITY COLLEGES \n\nThe Federal Ministry of Education has reaffirmed its commitment to the well-being of students in Federal Unity Colleges following a recent inspection of some the Colleges.\n\nDuring the visit by Ministry officials, it was discovered that two Colleges provided meals that did not meet the required standards for students. In response, the Principals of the affected schools have been recalled to the Ministry’s headquarters to allow for investigation.\n\nTo ensure strict compliance with standard feeding and students welfare, the Ministry has deployed senior officers to monitor the operations of the affected Colleges while the investigation is going on. Additionally, the Ministry has initiated a nationwide assessment of all Federal Unity Colleges to evaluate the quality of food and pastoral care provided to students.\n\nThe Federal Ministry of Education remains steadfast in its duty to uphold high standards in its Colleges , ensuring that students receive the proper nourishment and care necessary for their academic and personal development.\n\nBoriowo Folasade\nDirector, Press & Public Relations\nFederal Ministry of Education",
    "likes": 31,
    "retweets": 9,
    "replies": 9,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1899102958098276477",
    "url": "https://x.com/DrTunjiAlausa/status/1899102958098276477",
    "created_at": "Mon Mar 10 14:20:03 +0000 2025",
    "text": "PRESS RELEASE\n\nENSURING STUDENT WELFARE: FEDERAL MINISTRY OF EDUCATION INVESTIGATES FOOD QUALITY IN FEDERAL UNITY COLLEGES \n\nThe Federal Ministry of Education has reaffirmed its commitment to the well-being of students in Federal Unity Colleges following a recent inspection of some the Colleges.\n\nDuring the visit by Ministry officials, it was discovered that two Colleges provided meals that did not meet the required standards for students. In response, the Principals of the affected schools have been recalled to the Ministry’s headquarters to allow for investigation.\n\nTo ensure strict compliance with standard feeding and students welfare, the Ministry has deployed senior officers to monitor the operations of the affected Colleges while the investigation is going on. Additionally, the Ministry has initiated a nationwide assessment of all Federal Unity Colleges to evaluate the quality of food and pastoral care provided to students.\n\nThe Federal Ministry of Education remains steadfast in its duty to uphold high standards in its Colleges , ensuring that students receive the proper nourishment and care necessary for their academic and personal development.\n\nBoriowo Folasade\nDirector, Press & Public Relations\nFederal Ministry of Education",
    "likes": 59,
    "retweets": 21,
    "replies": 12,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1868294666749157826",
    "url": "https://x.com/DrTunjiAlausa/status/1868294666749157826",
    "created_at": "Sun Dec 15 13:58:54 +0000 2024",
    "text": "In addition to FMC Ebute Metta, the Federal Government has also subsidised renal dialysis treatment at the following hospitals for a specific period of time:\n\n- UCH, Ibadan\n- FMC OWERRI\n- UMTH Maiduguri\n- FMC Abeokuta\n- LUTH\n- FMC AZARE\n- FMC ABEOKUTA\n- UBTH BENIN\n- UCTH Calabar\n\nNigerians you can now go to these hospitals and receive subsidised care for renal dialysis treatment! \n\nMany thanks to @officialABAT for keeping his promise to provide Nigerians with increased access comprehensive healthcare.",
    "likes": 352,
    "retweets": 261,
    "replies": 33,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1862821549167755517",
    "url": "https://x.com/DrTunjiAlausa/status/1862821549167755517",
    "created_at": "Sat Nov 30 11:30:41 +0000 2024",
    "text": "I’m honored to be part of the inauguration of Cerba Lancet Nigeria’s new Laboratory in Surulere – a world-class, ISO accredited, 24-hour private pathology lab in Lagos. This state-of-the-art facility is a game-changer for Nigerians seeking healthcare. As it will provide timely, accurate diagnostics and expert pathology services to all.\n\nDuring my tenure as Minister of State for Health and now in my role leading the Federal Ministry of Education, I remain steadfast in my commitment to strengthening the healthcare sector by prioritizing medical sciences in our educational policies. By fostering collaboration between education and healthcare, we aim to cultivate a skilled workforce ready to support innovative institutions like Cerba Lancet Nigeria and others.\n\nI’d like to extend a special commendation to Dr. Olayemi Dawodu and her team for their visionary leadership in advancing diagnostic healthcare across Nigeria. I also challenge her to push the needle by partnering with Medical Schools and universities to offer residency programmes. Let’s work together to improve healthcare outcomes and advance medical research for a healthier Nigeria. \n\nCongratulations to the entire @CerbaLancetng team on this incredible milestone!",
    "likes": 63,
    "retweets": 19,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1857834082744361020",
    "url": "https://x.com/DrTunjiAlausa/status/1857834082744361020",
    "created_at": "Sat Nov 16 17:12:16 +0000 2024",
    "text": "Honoured to have attended the 9th Annual Conference of the Nigeria Implementation Science Alliance (NISA). NISA’s dedication to training and knowledge-sharing in implementation science has made a significant impact on health systems worldwide. \n\nThe Federal Ministry of Education is committed to improving public health literacy through the National School Health Policy, partnering with @UNESCO and @UNICEF @UNICEF_Nigeria to integrate health education in schools, especially in conflict areas. \n\nAs we move forward, I call on all stakeholders to work together to implement evidence-based health interventions, improve health literacy, and drive sustainable, community-focused practices that will shape a healthier future.\n\nGrateful for the opportunity to be part of this powerful exchange of ideas and looking forward to the lasting impact of this conference. \n\n#NISA2024 #HealthInnovation #PublicHealth #GlobalCollaboration",
    "likes": 40,
    "retweets": 6,
    "replies": 5,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1853884684888870963",
    "url": "https://x.com/DrTunjiAlausa/status/1853884684888870963",
    "created_at": "Tue Nov 05 19:38:47 +0000 2024",
    "text": "This week marks a bittersweet moment as I hand over my role as Minister of State for Health and Social Welfare to my dear friend and colleague, Dr. Isiaq Salako @SalakoIziaq.\n\nI have known Dr. Salako for many years, and I am extremely confident in his ability to work alongside Professor Pate @muhammadpate , build on what we’ve accomplished, and achieve the remaining goals and objectives we set out to accomplish.\n\nIt has been an honor to serve as your HMSHSW for the past 16 months. During that time, the @Fmohnigeria has made significant strides in revitalizing the health sector and advancing President Bola Ahmed Tinubu GCFR’s @officialABAT goal of providing Universal Health Coverage and delivering comprehensive, meaningful healthcare to all Nigerians.\n\nI would like to emphasize that the work we’ve done was not the result of my efforts alone. It has been a collective effort involving my office, the CMHSW’s office, the Office of the Permanent Secretary, the Ministry's directors, and too many others to name.\n\nI extend my heartfelt gratitude and appreciation to everyone who has supported and worked with me throughout this journey.\n\nThis is not farewell; it’s simply \"see you later.\"",
    "likes": 170,
    "retweets": 35,
    "replies": 16,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1853527817406828914",
    "url": "https://x.com/DrTunjiAlausa/status/1853527817406828914",
    "created_at": "Mon Nov 04 20:00:43 +0000 2024",
    "text": "As I conclude my tenure as Honourable Minister of State for Health and Social Welfare, I was pleased to hand out official appointment letters to ten acting CMDs and MDs of our Federal Tertiary Hospitals.\n\nEnsuring effective governance and leadership at the tertiary level is paramount to delivering comprehensive and meaningful healthcare to Nigerians.\n\nSince I resumed office, this has been a significant goal of the @Fmohnigeria, and we have worked diligently to streamline cumbersome processes and meet the needs of all our Federal Tertiary Hospitals.\n\nAs we present these letters today, I wish the new CMDs and MDs the best of luck in their new roles. To whom much is given, much is expected. President Bola Ahmed Tinubu has deemed you all capable of fulfilling this important task, and we, as a Ministry, will provide the necessary support to help you succeed.\n\nOnce again, I extend my congratulations to:\n\n• Dr. Amina Hassan Wali, CMD, National Eye Centre, Kaduna\n• Dr. Agboola Afis Akanni, CMD, Federal Neuropsychiatric Hospital Aro, Abeokuta\n• Dr. Adeleke Adesola Kaka, MD, FMC Epe, Lagos\n• Dr. Ngozielukwu Nneka Unaogu, MD, Federal Neuropsychiatric Hospital, Enugu\n• Prof. Icha Inalegwu Onche, MD, National Orthopaedic Hospital, Jos\n• Dr. Imafidon Osama Agboline, MD, Federal Neuropsychiatric Hospital, Benin City, Edo\n• Dr. Aisha Shehu Adamu, MD, FMC, Jalingo, Taraba State\n• Prof. Johnson Dare Ogunlesi, MD, FMC Ikole-Ekiti\n• Dr. Rabiu A. Dachi, MD, FMC Misau, Bauchi\n• Prof. Ileogben Sunday Adeoye, MD, National Obstetric Fistula Centre, Benin City.",
    "likes": 73,
    "retweets": 8,
    "replies": 12,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1850607346940252602",
    "url": "https://x.com/DrTunjiAlausa/status/1850607346940252602",
    "created_at": "Sun Oct 27 18:35:48 +0000 2024",
    "text": "As I wrap up my duties as Minister of State for Health & Social Welfare, @Fmohnigeria, I was pleased to attend the 27th Annual Scientific Conference and Annual General Meeting of the Medical Association of Nigerians Across Great Britain (MANSAG) @MANSAG_uk. \n\nThe theme of this year’s conference, “The Future of Healthcare – A Global Perspective,” could not be more timely. To navigate the complex systemic challenges we currently face and those that lie ahead, international cooperation is critical.\n\nI believe that one of the most immediate and impactful areas for engagement is between our government and our partners in the United Kingdom, such as MANSAG. As a leading Nigerian medical organization in the diaspora, with over 15,000 medical professionals, MANSAG plays a crucial role in shaping the future of healthcare in the British Isles, Nigeria, and beyond.\n\nWe, as a government, are extremely proud of our diaspora community and are committed to building on their skills to strengthen Nigeria’s healthcare system.\n\nHowever, we know that leveraging the full potential of diaspora engagement is not without its challenges. That is why we are proactively addressing these issues and have set up the Nigerian Health Professionals in Diaspora Engagement Programme to harness the expertise of diaspora healthcare professionals.\n\nThrough this programme, we aim to establish a two-way knowledge exchange between our healthcare professionals abroad and those working in Nigeria, via Specialized Medical Missions, Training and Capacity Building, Public-Private Partnerships, and Research and Innovation.\n\nThe challenges we face are immense, but with stronger partnerships with local and international organisations, institutions and partners, we can build a future where every Nigerian has access to quality healthcare.\n\nI extend my thanks to the President of MANSAG for his willingness to support our initiatives and plans.",
    "likes": 155,
    "retweets": 32,
    "replies": 12,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1850169898645017032",
    "url": "https://x.com/DrTunjiAlausa/status/1850169898645017032",
    "created_at": "Sat Oct 26 13:37:32 +0000 2024",
    "text": "Dear Nigerians,\n\nI am truly honored and grateful for the opportunity to serve as your new Minister of Education, @NigEducation . I extend my sincere thanks to President Bola Ahmed Tinubu, GCFR, for this remarkable opportunity, his trust and his unwavering support.\n\nI extend my profound appreciation to my dedicated team and the entire Federal Ministry of Health & Social Welfare @Fmohnigeria for their hard work and commitment to improving the health and well-being of our citizens. Together, in the past 18-months, we have made significant strides to enhance governance, strengthen the healthcare system, unlock the sector’s value chain, and improve our health security. \n\nI extend congratulations to my friend and colleague Dr @SalakoIziaq on his appointment as Minister of State for Health & Social Welfare, and assure you all that the health sector is in capable hands. \n\nAs we embark on this new chapter, I am committed to fostering collaboration and innovation, ensuring that we continue to do what is right to rebuild our nation for ourselves and for our children. Together, we will create a brighter and more prosperous future. \n\nThank you.",
    "likes": 1295,
    "retweets": 258,
    "replies": 315,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1848787700759072815",
    "url": "https://x.com/DrTunjiAlausa/status/1848787700759072815",
    "created_at": "Tue Oct 22 18:05:11 +0000 2024",
    "text": "Whilst in Bauchi for our Health Sector Ministerial Retreat 2024, the Coordinating Minister @muhammadpate and I took the opportunity to sign a Memorandum of Understanding (MOU) with @GovBauchi for the conversion of General Hospital Misau to a Federal Medical Centre.\n\nFollowing the appointment of Dr. Rufai Abdu Dachi a couple of months ago, the signing of this MOU solidifies the Federal Government’s dedication to improving the health and welfare of the citizens of Misau, #Bauchi.\n\nPart of this initiative is a new nursing school that the FMC is building next year. The school will help increase educational and career opportunities for the approximately 2 million residents of Bauchi and its surrounding states, addressing the brain drain crisis.\n\nI extend my gratitude to President @officialABAT, GCFR, for his unwavering commitment to revamping the healthcare sector, and to the Governor of Bauchi State, H.E. @SenBalaMohammed, for transferring Misau General Hospital to the Federal Government for conversion into a Federal Medical Centre.\n\n@Fmohnigeria",
    "likes": 33,
    "retweets": 9,
    "replies": 25,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1848639265569182181",
    "url": "https://x.com/DrTunjiAlausa/status/1848639265569182181",
    "created_at": "Tue Oct 22 08:15:21 +0000 2024",
    "text": "I was thrilled to open the @Fmohnigeria’s 2024 Federal Health Sector Retreat, yesterday in Bauchi State.\n\nThis retreat serves as a unique and critical platform for us to reflect on our progress, analyse challenges and take stock of our achievements so far.\n\nAt the retreat, we’ll review our 4 Pillar Agenda — focused on enhancing health governance, improving population health outcomes, promoting health industrialization, and strengthening health security. It's essential that we assess what we’ve accomplished in order to identify the next steps needed to meet our ambitious targets.\n\nI’m happy to note that in the past year, we've made significant strides, from expanding health insurance enrollment to enhancing healthcare infrastructure. However, there’s much more to be done. Together, we need to fully operationalize our Sector Wide Approach (SWAp) and accelerate our efforts to reach our goal of reaching 50 million insured individuals.\n\nI extend my gratitude to H.E @SenBalaMohammed , Governor of @GovBauchi for your generous hospitality in hosting us. \nI’m confident that, through our collective efforts, and discussions held at this meeting that we can make a lasting impact on the health of Nigerians. Let’s make these discussions productive! \n\n#HealthSectorRetreat2024 #BetterHealthForNigeria",
    "likes": 29,
    "retweets": 6,
    "replies": 10,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1846252966027973036",
    "url": "https://x.com/DrTunjiAlausa/status/1846252966027973036",
    "created_at": "Tue Oct 15 18:13:03 +0000 2024",
    "text": "Today marks a pivotal day for the health sector.\n\nThis afternoon the @Fmohnigeria on behalf of the Five (5) Schools of Biomedical Engineering, signed a Memorandum of Understanding (MOU) between @GEHealthCare, and @JNCILtd to build training capacity of their students. \n\nEarlier this year, I met with the Heads of Biomedical Engineering Schools in Enugu, Benin, Zaria, Maiduguri, and Lagos to understand the current bottle necks such as the dwindling number of biomedical engineers in the country and discuss innovative initiatives regarding student uptake, accreditation and funding. \n\nAs a next step, I created a Technical Working Group compromising of GE Healthcare, JNCI, @GlobalFund Global Fund and the Heads of the Biomedical Engineering schools to enhance the capacity of the schools and their infrastructure. The  MOU signed today permits both GE & JNCI to train five students from each biomedical school of engineering.\n\nIn addition JNCI have also presented a revised curriculum integrating practical sessions and modern technologies such as AI and electronics and proposed a professional development program for #biomedicalengineers to enhance the employability of graduates, which will be adopted immediately. \n\nBoth the curriculum and training will allow our biomedical engineers to receive world class education to become eligible for the job market in country and internationally, in line with pillar 2 (strengthening healthcare systems) of our 4 point agenda.\n\nFor further skills enhancement, a simulation lab is also being built at @LUTHofficial to provide the students with hands-on training in areas such as minimally invasive surgery, MRI, CT, and robotics. \n\nI extend my gratitude to the Leadership of JNCI and GE Healthcare for their support for taking up this great task.\n\n#health #nigeria",
    "likes": 35,
    "retweets": 9,
    "replies": 6,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1844313938697023777",
    "url": "https://x.com/DrTunjiAlausa/status/1844313938697023777",
    "created_at": "Thu Oct 10 09:48:03 +0000 2024",
    "text": "On this #WorldSightDay, the Federal Ministry of Health & Social Welfare @Fmohnigeria reaffirms our commitment to ensuring all Nigerians, particularly children have access to inclusive, affordable, and quality people-centred eye care services. Vision is a fundamental human right, and it is our responsibility to prevent avoidable blindness and promote eye health across the nation.\n\nLet us work together to raise awareness about the importance of regular eye check-ups, protective measures, and proper nutrition for maintaining healthy eyesight. I encourage everyone to prioritize eye health in their communities and support initiatives aimed at improving access to eye care.\n\nTogether, we can build a future where everyone has the opportunity to see clearly and live fully. #WorldSightDay #EyeHealthNigeria #VisionForAll",
    "likes": 14,
    "retweets": 3,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1844064154140946670",
    "url": "https://x.com/DrTunjiAlausa/status/1844064154140946670",
    "created_at": "Wed Oct 09 17:15:30 +0000 2024",
    "text": "Yesterday, I had the pleasure of attending a high-level healthcare policy dialogue themed “The Private Sector Support for #SWAP in Healthcare” in Abuja, hosted by the Health Federation of Nigeria (HFN) in collaboration with the @Fmohnigeria.\n\nAt the event, I shared the significant progress made by the Nigeria Digital in Health Initiative (NDHI) in establishing governance, data standards, and security. Our goal is to transition our facilities from largely paper-based systems to interoperable Electronic Health Record (EHR) systems. Implementing EHRs will streamline patient data management and ensure real-time access to information across healthcare facilities. To facilitate this, NDHI has launched a Request for Information (RFI) on its website, inviting local vendors to propose solutions that align with our vision for an integrated national digital health system. This process will be transparent and fair for all participants.\n\nThe expansion of digital health tools, such as EHRs, is vital to Mr. President @officialABAT ’s Health Sector Renewal Initiative and supports the achievement of our four-point agenda. As I mentioned during the panel session, we are actively involving the private sector in our planning. Once established, the National Digital Health Architecture will enable private healthcare facilities and allied businesses to integrate and contribute.\n\nThe synergy between public and private healthcare facilities will enhance access to quality healthcare delivery at all levels and empower the federal government to make data-driven decisions for effective policies and solutions. Our ultimate mission is to harvest clean, quality data.\n\nI extend my gratitude to the organizers for hosting such an important event, the panelists for their diverse perspectives and support toward a forward-moving integrated health system, and our development partners for their unwavering support and invaluable strategic advice.\n\nTogether, we are making significant strides toward enhancing Nigeria's healthcare system, and we truly appreciate your commitment to our shared vision.",
    "likes": 27,
    "retweets": 7,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1844013882819355112",
    "url": "https://x.com/DrTunjiAlausa/status/1844013882819355112",
    "created_at": "Wed Oct 09 13:55:44 +0000 2024",
    "text": "PRESS STATEMENT \n\nFINALIZATION OF EXECUTIVE ORDER ON ZERO VAT FOR PHARMACEUTICAL MANUFACTURERS\n\nThe Ministry of Health and Social Welfare @Fmohnigeria,  is pleased to announce the finalization of the Executive Order Harmonized Implementation Framework, which has now been cleared for gazetting. This critical step ensures that the Federal Inland Revenue Service (FIRS) and the Nigeria Customs Service can proceed with the implementation of zero VAT and excise duties on pharmaceutical products and medical devices. This is a significant milestone, as it opens the door for our local pharmaceutical and medical device manufacturers to begin fully benefiting from the relief measures outlined by His Excellency, President Bola Ahmed Tinubu @officialABAT, in the Executive Order.\n\nWith the implementation of this Executive Order, we anticipate a notable reduction in the prices of essential pharmaceutical products and medical consumables. This development aligns with the Ministry’s unwavering commitment to reducing both the physical and financial pain faced by millions of Nigerians who depend on these critical health supplies.\n\nFurthermore, the gazetting of the Harmonized Implementation Framework represents the realization of the third pillar of the Ministry’s 4-point agenda, which focuses on unlocking the healthcare value chain. By creating an environment that supports local manufacturers, we are fostering a healthier, more self-reliant nation, and ensuring that quality healthcare becomes more accessible and affordable for all.\n\nThe gazetted copies of the Harmonized Implementation Framework will be distributed to the relevant government agencies, including @FIRSNigeria and @CustomsNG for immediate action.\n\nUndoubtedly, today is another great day for our country and a huge win for the health sector. We are grateful to President BAT, for his continued commitment to improving the healthcare sector and supporting our local industries.",
    "likes": 3,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1843694941303910503",
    "url": "https://x.com/DrTunjiAlausa/status/1843694941303910503",
    "created_at": "Tue Oct 08 16:48:22 +0000 2024",
    "text": "I would like to extend my congratulations to @DrZSB on her election win as the new President-Elect of the UICC!\n\nThis is a proud moment for Nigeria, Africa, and the global cancer community. Dr. Zainab Shinkafi-Bagudu’s election as President-elect of the UICC is a reflection of her tireless dedication to the fight against cancer and her exceptional leadership skills. \n\nHer extensive experience and passion for improving cancer care, particularly in low-resource settings, will drive meaningful progress in the delivery of cancer care. The @Fmohnigeria fully supports Dr Shinkafi-Bagudu as she takes on this prestigious role, and we are confident that her leadership will bring about transformative change in cancer prevention, treatment, and research worldwide.",
    "likes": 23,
    "retweets": 11,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1843667652763439593",
    "url": "https://x.com/DrTunjiAlausa/status/1843667652763439593",
    "created_at": "Tue Oct 08 14:59:56 +0000 2024",
    "text": "I was honored to attend the HIV Continuum of Care Summit in Abuja.\n\nIn line with the 2nd pillar (improving health outcomes) of our 4-point agenda, this event reaffirms our commitment as a government to end the #HIV/#AIDS epidemic by 2030.\n\nFor too long, Nigeria has relied on the importation of basic products like RDTs that we have the capacity to produce locally. That's why we have engaged two manufacturing plants to produce RDTs and HIV/AIDS test kits, set to be commissioned this December. That being said, we implore all manufacturers interested in producing HIV/AIDs related products to domesticate their operations and manufacture locally. The @Fmohnigeria under the leadership of the Federal Government will provide all necessary logistics support needed. \n\nHowever, we still need all our development partners, as well as device and pharmaceutical manufacturers, to support our renewed efforts to localize manufacturing within our country. Unlocking our healthcare value chain through industrialisation is key to the growth & sustainability of our health system.\n\nOur goal is to ensure that everyone living with HIV receives timely, quality care, achieving viral suppression and improved health outcomes.\n\nAs we strive toward the global goal of eliminating HIV/AIDS by 2030, I urge everyone to remain committed and steadfast.\n\nI extend my gratitude to the organisers for their leadership and innovation in HIV diagnostics, and to our development partners —@WHONigeria @WHO @GlobalFund @PEPFAR (US @CDCgov, @USAID, and DoD),@CHAI_health , @NepwhanN, pharmaceuticals, and other key stakeholders—for their invaluable commitment to controlling HIV/AIDS in Nigeria. \n\nTogether, we can make a meaningful difference in the lives of those affected.",
    "likes": 24,
    "retweets": 7,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1843346526082396266",
    "url": "https://x.com/DrTunjiAlausa/status/1843346526082396266",
    "created_at": "Mon Oct 07 17:43:54 +0000 2024",
    "text": "In honor of Breast Cancer Awareness Month, I would like to reaffirm my endorsement of Dr Zainab Bagudu for the position of President-Elect of the Union for International Cancer Control (UICC).\n\nDr. Bagudu’s extensive career as a pediatrician and a renowned cancer advocate speaks volumes about her tenacity and unwavering dedication to providing better care for cancer patients, especially women and adolescent girls, making her the ideal candidate to lead the UICC.\n\nAs voting draws to a close tomorrow, I urge members of the @uicc to carefully consider their votes. Dr. Bagudu’s position as President-Elect of the UICC will provide Africa with a greater platform to showcase our commitment to cancer control, build strategic partnerships, enhance access to quality cancer care, and provide comprehensive healthcare for all. As well as champion other African leaders to progress their own commitments to providing better access to quality cancer care. \n\nDr. Bagudu’s impressive national and international track record speaks for itself, and I am confident she will excel in this role. Join me in supporting @DrZSB for strong and successful leadership! #cancer #UICCPresidentElect #UICC \n\n@muhammadpate @DrTedros @MedicaidcfP",
    "likes": 31,
    "retweets": 13,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1842640648014307497",
    "url": "https://x.com/DrTunjiAlausa/status/1842640648014307497",
    "created_at": "Sat Oct 05 18:58:59 +0000 2024",
    "text": "I was pleased to launch the National Health Research Ethics Committee (NHREC) Electronic Portal yesterday in Lagos State, alongside Prof Olopade, NHRC Chairwoman,   and Prof Akin Abayomi, Comissioner for Health for Lagos State. \n\nAs we strive to transform Nigeria into a hub for health research, the e-portal will serve as a comprehensive platform for the ethical review and approval of research proposals. It will collaborate with local Institutional Review Boards (IRBs) to ensure that all health research in Nigeria adheres to global standards while protecting the rights, dignity, and safety of participants. This platform will also minimize delays and eliminate redundancies, enhancing the robustness and competitiveness of our health research landscape on the global stage.\n\nWith this portal, we can further optimize health research to promote equity, improve our policies and systems, safeguard public health, and, most importantly, protect the individuals at the heart of this research—our patients and communities.\n\nNumerous research projects, such as the ARETTA 2.0 study on breast cancer, are currently underway in the country. It is essential that we create an enabling environment for them to flourish.\n\nI extend my gratitude to our partners, the US CDC and PHIS3, for their invaluable support, as well as to the Chairman and members of NHREC for their tireless efforts in reshaping the landscape of research ethics since their inauguration.\n\nTogether, we are not just launching a system; we are building the future of ethical health research in Nigeria.",
    "likes": 8,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1841900234315853908",
    "url": "https://x.com/DrTunjiAlausa/status/1841900234315853908",
    "created_at": "Thu Oct 03 17:56:51 +0000 2024",
    "text": "Today, I was pleased to sign the Memorandum of Understanding (MOU) between the Federal Government, @Fmohnigeria, and the @followlasg for the transfer of Epe General Hospital, which will become the newly established Federal Medical Centre, Epe.\n\nThis agreement, signed during Lagos State’s first Trauma Conference 2024 @LagosTrauma, is not only a significant milestone for the people of #Epe and Lagos State, but also a testament to the vision and leadership of our esteemed President, His Excellency @officialABAT, GCFR.\n\nThis project, born from the heartfelt request of the Governor of Lagos State @jidesanwoolu, reflects the urgent need for an advanced medical facility to serve the rapidly growing population of Epe and its surrounding communities.\n\nEpe's strategic location and expanding population have made this decision imperative. Our people deserve access to quality healthcare, and I am proud to say that today we are making great strides toward ensuring they receive it.\n\nIn addition to the new FMC, the government will also establish a Nursing School at the FMC to train nurses and midwives, with enrollment beginning next year.\n\nOver the next two years, FMC Epe will enhance the community by providing specialized care in the following areas:\n- Pediatric care, including a Neonatal Intensive Care Unit (NICU)\n- Medical ICU\n- Advanced surgical care, including open-heart surgeries\n- Cardiology services\n- Advanced obstetric and gynecological services for high-risk pregnancies and gynecological cases\n- A state-of-the-art emergency and trauma center\n- Nephrology services, including dialysis and kidney transplants\n- Radiological services, including CT and MRI scans\n- Orthopedic care, including spinal procedures\n- Burn and plastic surgery services\n\nTo further increase the utilization of FMC Epe, Ilara Igboye has been chosen as the site for the Federal College of Complementary and Alternative Medicine (FEDCAM). This will allow FEDCAM students to use the hospital for their clinical postings, enhancing their practical experience. FEDCAM will offer the following courses:\n- Acupuncture\n- Naturopathy\n- Homeopathy\n- Chiropractic medicine\n- Osteopathy\n- Herbal medicine\n\nI express my profound gratitude to the President for his unwavering commitment to Nigerians; to Governor Sanwo-Olu for his foresight and dedication to the health and welfare of our citizens; to @ProfAkinAbayomi, Lagos State Commissioner of Health, and the Special Advisor to the Governor on Health, as well as Lagos State’s Permanent Secretaries, Executive Council Members and Legislators their diligence and collaboration in bringing this project to fruition.\n\nI also extend my thanks to His Royal Majesty, the Oloja of Epe, Alayelluwa Oba Kamorudeen Ishola Animashaun, for his generous support of this effort, and to my dear brother, Honourable Wale Raji, a member of the Federal House of Representatives representing the Epe constituency, for the tremendous work he has contributed to this process.\n\nTogether, we will ensure that every Lagosian and Nigerian receives comprehensive and meaningful healthcare.",
    "likes": 26,
    "retweets": 7,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1841773209944822034",
    "url": "https://x.com/DrTunjiAlausa/status/1841773209944822034",
    "created_at": "Thu Oct 03 09:32:06 +0000 2024",
    "text": "Yesterday, I visited the Diamed Centre in Lagos State.\n\n@diamedcentres is a state-of-the-art, newly built clinic offering a range of services, including cardiology, neurology, endocrinology, orthopedics, and oncology.\n\nDuring my tour of the facility, I discussed the Federal Government's plan to increase the number of Nigerians with health insurance and the imminent energy subsidy for public health facilities. Nigeria stands at a pivotal moment, with a President committed to harnessing renewable energy resources to power the nation. Given the rising costs of petrol and diesel, I encouraged Dr Olorode, CEO of Diamed, to explore the installation of solar lithium-based mini-grids and consider retrofitting her generators to use CNG. After the initial investment, these solutions could significantly reduce her ongoing energy expenses.\n\nIt is unfortunate that the costs of healthcare delivery often exceed what Health Maintenance Organizations (HMOs) are willing to reimburse providers. This is why we are working on a new reform plan aimed at encouraging Nigerians to obtain health insurance and improve their health-seeking behavior. Be assured that the @Fmohnigeria on behalf of the Federal Government, is dedicated to improve access to better care and better service delivery. \n\nWith its facilities, the Diamed Centre has the potential to become a center of excellence for specialist care. I extend my heartfelt thanks to Dr. Abiola Olorode for developing such an exceptional center dedicated to delivering meaningful and comprehensive healthcare to Nigerians.\n\n#betterhealth",
    "likes": 12,
    "retweets": 5,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1839730907122397511",
    "url": "https://x.com/DrTunjiAlausa/status/1839730907122397511",
    "created_at": "Fri Sep 27 18:16:43 +0000 2024",
    "text": "At #UNGA79, Coordinating Minister of Health and Social Welfare, Prof @muhammadpate and myself took part in High-Level meeting on #AntiMicrobialResistance, aimed at building stronger national, regional and international political commitment, comprehensively in a multi-sectoral manner. \n\nWith Nigeria’s high morbidity rates associated with and attributed to AMR, in September, the FMOH&SW established an Antimicrobial Stewardship Taskforce to coordinate countrywide surveillance of AMR trends and research activities, and provide further public awareness and education on AMR. We’ve also set up a National infection prevention and control programme called “Turning Nigeria Orange”, inline with the Global action plan for infection prevention and control, and are intensifying surveillance for multi-drug resistance Tuberculosis and governing the use and sale of antibiotics. \n\nAMR is a silent but deadly threat that has taken root globally. It is therefore imperative that we widen the scope for research and development for new innovations, diagnostics, and treatment of diseases and infections to abate AMR. \n\nAs the Ministers of health, we are deeply committed to building on past lessons and successes to combat AMR and provide better healthcare for all Nigerians.\nNigeria welcomes the commitment under this political declaration on AMR and assure the global community of our readiness to fully implement the obligations of this declaration.",
    "likes": 29,
    "retweets": 10,
    "replies": 5,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1839321496939815221",
    "url": "https://x.com/DrTunjiAlausa/status/1839321496939815221",
    "created_at": "Thu Sep 26 15:09:52 +0000 2024",
    "text": "While at #UNGA79, I had a high-level meeting with the CEO of United States Pharmacopeia (USP) @USPharmacopeia and his team to discuss our shared commitment to transforming Nigeria’s pharmaceutical industry. We’re focused on unlocking the sector’s immense potential to drive Medicines Security and advance Universal Health Coverage across Nigeria and Africa. In line with Pillar 3 (Unlocking the value chain) of the @Fmohnigeria’s 4-point Agenda, in august, an MOU was signed between the USP and the Federal Government under the leadership of PVAC to attain this vision.\n\nThrough this strategic partnership, we aim to not only improve access to quality medicines but also create significant socioeconomic impact—generating employment, facilitating knowledge transfer, and boosting revenue. Strengthening the networks and processes within our healthcare system is key to ensuring sustainable progress.\n\nTogether with USP, we are laying the foundation for Nigeria to become a leader in pharmaceutical innovation across Africa. Exciting things are ahead as we work towards a healthier and more prosperous future!\n\n#UNGA #uhc #healthcare #HealthcareForAll",
    "likes": 13,
    "retweets": 3,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1838730748846604311",
    "url": "https://x.com/DrTunjiAlausa/status/1838730748846604311",
    "created_at": "Wed Sep 25 00:02:27 +0000 2024",
    "text": "I'm pleased to be attending this year’s United Nations General Assembly (#UNGA) in New York. To kick off my time at this prestigious event, I participated in @CHAI_healt’s  Roundtable Side session to discuss and raise awareness about our country's progress in cervical #cancer elimination.\n\nCervical cancer is the second most common cancer among women in Nigeria. In addition to our HPV vaccine rollout, we have established a National Taskforce on Cervical Cancer Elimination (NTF-CCE), chaired by former Minister of Health Professor Isaac Adewole, a renowned gynae-oncologist, alongside Nigeria's First Lady, Sen. Oluremi Tinubu, CON. @SenRemiTinubu \n\nThe NTF-CCE will lead the implementation of our cervical cancer elimination strategy in coordination with @NicratGov, providing strategic oversight, mobilizing financial and technical resources, and coordinating efforts among stakeholders to ensure effective program execution.\n\nI extend my gratitude to CHAI and for the invitation to the Roundtable and look forward to sharing our progress with other global leaders.\n\n#UNGA79",
    "likes": 9,
    "retweets": 1,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1834301380473037239",
    "url": "https://x.com/DrTunjiAlausa/status/1834301380473037239",
    "created_at": "Thu Sep 12 18:41:43 +0000 2024",
    "text": "Today, I had a very productive meeting with Mr. Rafael Mariano Grossi @rafaelmgrossi, the Director General of the International Atomic Energy Agency (IAEA) @iaeaorg at their headquarters in Vienna, Austria. Our discussion centered on several key areas:\n\n1. Strengthening Bilateral Relationships: We explored ways to further enhance the collaboration between the Federal Government of Nigeria and international atomic energy agency. Specifically, we focused on expanding cancer care and treatment in Nigeria. This includes a partnership with the IAEA’s ‘Rays of Hope’ Fund  with our own @NicratGov to conduct  needs assessment for comprehensive cancer care across all 36 states and 774 local government areas in Nigeria. \n\n2. Building Partnerships for Funding: We also discussed the importance of forging additional partnerships with funding organizations such as the OPEC Fund and the Islamic Development Bank to support our ambitious goal of expanding cancer care that will enable our Country to have enough penetration  for advanced Cancer Care technologies that will include LINACs, PET scans and cyclotrons,\n\n3. IAEA’s Support for Gamma Cameras: Mr. Grossi agreed to help support  Nigeria with Gamma cameras for the National Hospital Abuja. Additionally, the IAEA will assist in removing the decayed isotopes from our six cancer centers equipped with brachytherapy machines and providing replacements. \nAlso IAEA will support provision of dosimetry and transluminescent sensors.\n\n4. Nuclear Medicine Program: We updated Mr. Grossi on the Federal Ministry of Health and Social Welfare @Fmohnigeria’s commitment to launching a Nuclear Medicine residency program. Following significant collaboration with the National Postgraduate Medical College and the West African College of Surgeons, the Nuclear Medicine residency program will commence this September 2024 at both the National Hospital Abuja @NatHospital_ABJ and the University College Hospital Ibadan @uchibadan_ .\n\nMr. Grossi expressed his admiration for Nigeria’s progress since his initial visit in May. In line with our commitment to strengthening our relationship with the IAEA, the federal government has paid Nigeria’s outstanding dues to the IAEA, including contributions to the National Obligation Fund, Technical Cooperation Fund, National Participation Fund, and the African Regional Agreement Fund.\n\nI extend my sincere thanks to DG Grossi for the fruitful discussions, his support towards Nigeria’s development, and his dedication to the safe , peaceful and effective use of nuclear technology globally.",
    "likes": 15,
    "retweets": 9,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1833865353606127973",
    "url": "https://x.com/DrTunjiAlausa/status/1833865353606127973",
    "created_at": "Wed Sep 11 13:49:06 +0000 2024",
    "text": "This month, the Federal Government under the leadership of the Federal Ministry of Health & Social Welfare @Fmohnigeria inaugurated the establishment Committee for the National Health Facility Regulatory Agency (NHFRA).\n\nIn alignment with Pillar 1 (Improving Governance) and Pillar 2 (Improving Health Outcomes) of the FMOH & SW’s 4-point agenda and the need to address current issues, the implementation of NHFRA is extremely necessary to achieve President @officialABAT GCFR’s ‘Renewed Hope Agenda’ and solemn mission to deliver comprehensive and meaningful healthcare for all Nigerians. \n\nThe NHFRA will play a crucial role in regulating and enhancing the quality, delivery and safety of healthcare services (public and private) nationwide. The agency will also oversee that all healthcare facilities, commodities, equipment, and personnel adhere to high-level standards developed by the Standards Committee, thereby safeguarding patient safety.\n\nGiven our ever-evolving healthcare landscape, the need for a robust regulatory framework has never been more critical. It is our duty, as leaders to ensure that our healthcare institutions operate at the highest possible standards, providing care that is not just adequate, but exemplary and ethical.\n\nThe formation of this agency marks a significant milestone in our ongoing efforts to strengthen the healthcare system in our nation, ensuring that every citizen has access to the highest standard of care.\n\nEffective healthcare regulation is not just about enforcement, but about fostering a culture of continuous improvement and excellence.\n\nI extend my deepest gratitude to the committee members who have accepted their roles to ensure our healthcare system is put on the right track. Together, we can build a regulatory agency that will serve as a model for the region and a guarantor of health excellence for all our citizens.",
    "likes": 10,
    "retweets": 3,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1832489640387105159",
    "url": "https://x.com/DrTunjiAlausa/status/1832489640387105159",
    "created_at": "Sat Sep 07 18:42:30 +0000 2024",
    "text": "Evening All, \n\nThis week, I had an exclusive interview with Channel’s TV, to shed light on the current trends of the healthcare sector, local manufacturing, the recent resident’s doctors strike and more.\n\nThe interview airs tonight at 8 &amp; 10 PM on Channels TV. Be sure to watch! https://t.co/nQ2FDGOIrI",
    "likes": 8,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1831972768868343952",
    "url": "https://x.com/DrTunjiAlausa/status/1831972768868343952",
    "created_at": "Fri Sep 06 08:28:39 +0000 2024",
    "text": "This week, I had the pleasure of reuniting with the Chief Medical Directors (CMDs) and Medical Directors (MDs) of our Federal Tertiary Hospitals at their Quarterly Meeting.\n\nIn addition to updating the CMDs and MDs on the progress we’ve made with our 4-point agenda, I emphasized the importance of effectively utilizing our current infrastructure and maximizing resources to provide Nigerians with the best possible healthcare now.\n\nWhile prioritizing the efficient use of our infrastructure, it is also crucial that our hospitals meet the highest standards of care and management. Under the leadership of the Federal Ministry of Health and Social Welfare @Fmohnigeria , the National Tertiary Hospitals Standards Committee is developing a list of standards that reflect the high level of care deserving of Nigerians.\n\nFinally, to advance local production in the country, I have urged all CMDs and MDs to purchase syringes and needles from selected local manufacturing companies. This is a clear path to reinvesting in our economy.\n\nPresident Bola Ahmed Tinubu, GCFR, @officialABAT, has demonstrated unprecedented support for the health sector, and we must do our part to show the President that we are up to the task.\n\nI extend my thanks to our CMDs and MDs for their continued commitment and urge them to keep working diligently to meet the challenges ahead.",
    "likes": 11,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1831796654959215035",
    "url": "https://x.com/DrTunjiAlausa/status/1831796654959215035",
    "created_at": "Thu Sep 05 20:48:50 +0000 2024",
    "text": "Today, I was proud to attend a panel discussion at the 2024 Gender & Equity Inclusion Summit in Abuja, alongside the First Lady of Kwara State, H.E, Ambassor Prof. Mrs Olufolake Abdulrazaq @firstladykwara, Honourable Minister of Arts & Culture, @hanneymusawa , the Perm Secretary of Budget and Planning and other distinguished guests. \n\nThe theme of the summit, \"Reimagining Gender-Inclusive Pathways and Partnerships for Poverty Reduction,\" is both timely and relevant.\n\nWith 63% of our population estimated to be living in multidimensional poverty, it is clear that poverty is not just about income deficiency but a complex web affecting health, education, and living standards.\nThat’s why it’s imperative that we invest in women and girls empowerment and education. For it is a strategic investment that will build our economy and reduce our poverty index.\n\nTo build a gender-inclusive, poverty declining Nigeria, we must also challenge the social and cultural norms that perpetuate inequality. This involves engaging men and boys as allies, promoting gender-sensitive policies, and ensuring our legal frameworks protect the rights of all citizens.\n\nAligned with the 'Renewed Hope Agenda' of President Bola Ahmed Tinubu, GCFR, the @Fmohnigeria is committed to implementing policies that prioritize the health and well-being of women and girls.\n\nDuring the discussion, I was asked about the repeal of the Violence Against Persons Prohibition (VAPP) Act. I assured the audience that we will fight against any attempt to repeal this Act, as doing so would only hinder progress towards a Nigeria where gender equality is a reality for all.\n\nI extend my thanks to the @officialNESG and PIC for inviting me to participate in this important discussion.",
    "likes": 12,
    "retweets": 4,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1831077004227051796",
    "url": "https://x.com/DrTunjiAlausa/status/1831077004227051796",
    "created_at": "Tue Sep 03 21:09:12 +0000 2024",
    "text": "It was indeed an honour to attend the Northern Traditional Leaders Committee meeting alongside the Coordinating Minister of Health, Prof. Ali Muhammad Pate, and esteemed guests such as Mr. Bill Gates @BillGates, Alhaji Aliko Dangote @AlikoDangote, the Royal Highnesses of the Northern states, and various development partners @WHO @WHONigeria @UNICEF .\n\nThe eradication of Wild Polio Virus in the country is a commendable achievement, accomplished through effective collaboration. This type of cooperative effort, combining medical interventions with the outreach of traditional leaders to their communities, will help us achieve our collective goal of providing life-saving treatments for all children and President Bola Ahmed Tinubu GCFR, @officialABAT ’s goal to provide comprehensive, meaningful healthcare for all Nigerians.",
    "likes": 29,
    "retweets": 4,
    "replies": 6,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1829914534083023053",
    "url": "https://x.com/DrTunjiAlausa/status/1829914534083023053",
    "created_at": "Sat Aug 31 16:09:57 +0000 2024",
    "text": "To wrap up my Kaduna trip, I joined the Deputy Governor of Kaduna, @DrHadiza Sabuwa Balarabe and the  Emir of Zazzau, His Highness Malami Ahmad Nuhu Bamalli, to commission a series of projects at the National Ear Care Centre Kaduna.\n\n@necckaduna has been at the forefront of providing quality ENT care to patients across the country and offering high-level specialty training both locally and internationally.\n\nThe projects we commissioned are:\n\n•A 200-capacity auditorium\n•A new student hostel\n•An oxygen plant\n•A molecular laboratory\n•A power house\n•An ENT specialty clinic\n•A theatre complex\n•A new ward for women and children\n\nI was extremely honored and proud to commission these capital projects and to be the first Health Minister in over a decade to visit this great federal tertiary institution.\n\nThe commissioning of these projects is a clear representation of our collective commitment to enhancing the quality of patient care, medical training, and improving healthcare delivery in Nigeria. It’s also a significant step forward in actualizing the @Fmohnigeria’s Four-Point Agenda, which aligns seamlessly with Mr. President @officialABAT's \"Renewed Hope\" agenda for our nation.\n\nLet us remember that the true measure of the hospital’s success lies in the lives it will touch, the patients it will heal, and the healthcare professionals it will inspire.\n\nI extend my gratitude to Dr. Mustapha Abubakar Yaro, CMD of the National Ear Care Centre Kaduna, for his leadership and commitment to ensuring that the National Ear Care Centre Kaduna remains at the forefront of specialized medical care in our country.\n\nTogether, we are building a future where every Nigerian can enjoy the highest standard of health and well-being.\n\n#renewedhealth",
    "likes": 11,
    "retweets": 1,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1829623549813837862",
    "url": "https://x.com/DrTunjiAlausa/status/1829623549813837862",
    "created_at": "Fri Aug 30 20:53:41 +0000 2024",
    "text": "It is my pleasure to endorse my dear sister, Dr. Zainab Bagudu, for the position of President-Elect of the Union for International Cancer Control (UICC). @DrZSB has been instrumental in advancing cancer prevention, diagnosis, and treatment in Nigeria.\n\nHer exceptional leadership, innovative vision, tenacity, and unwavering commitment makes Dr. Bagudu the ideal candidate to lead the @uicc . Her position as President-Elect of the UICC also offers the country a greater platform to showcase our dedication to cancer control through @NicratGov , build strategic partnerships, enhance access to quality cancer care, and provide comprehensive healthcare for all Nigerians.\n\nDr. Bagudu’s impressive national and international track record speaks for itself, and I am confident she will excel in this role. Join me in supporting Dr. Zainab Bagudu for a strong and successful leadership! #UICCPresidentElect",
    "likes": 303,
    "retweets": 57,
    "replies": 11,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1829488370809991332",
    "url": "https://x.com/DrTunjiAlausa/status/1829488370809991332",
    "created_at": "Fri Aug 30 11:56:32 +0000 2024",
    "text": "After touring @fnphkad, I visited the @neckaduna to commission their new optical showroom and their Ophthalmic, Diagnostic, and Laser Unit.\n\nThe National Eye Centre Kaduna is the only tertiary hospital in the country dedicated solely to eye care. Since the 1990s, it has been treating eye-related ailments for the people of Kaduna, its surrounding states, and across Nigeria.\n\nDuring my visit, Acting CMD Dr. Aminatu AbdulRahman provided insights into the hospital's specialties, training programs, achievements, and challenges, notably in security and electricity.\n\nWe are all aware of the recent kidnapping of Dr. Ganiyat Popoola, her nephew and husband. The Federal Ministry of Health & Social Welfare and the Police are diligently working to locate and safely return Dr. Ganiyat Popoola and her nephew. Moving forward, the @Fmohnigeria will collaborate with the CMD of the National Eye Centre to address the hospital’s infrastructural and security issues, aiming to reduce future risks and threats.\n\nIn alignment with President @officialABAT, GCFR’s mission to provide comprehensive and effective healthcare to Nigerians, the Federal Government will be offering a 50% subsidy on energy costs for all federal facilities. We hope this subsidy will support our facilities in delivering round-the-clock healthcare and enhance their service delivery.\n\nI extend my gratitude to Dr. Aminatu AbdulRahman for her steadfast leadership as acting CMD and her dedication to the safety and well-being of her staff and patients.",
    "likes": 11,
    "retweets": 0,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1829210029288735135",
    "url": "https://x.com/DrTunjiAlausa/status/1829210029288735135",
    "created_at": "Thu Aug 29 17:30:30 +0000 2024",
    "text": "When I began my role as Minister of State for Health & Social Welfare, I requested presentations from the Chief Medical Directors (CMDs) of all Federal Tertiary Hospitals to gain a comprehensive understanding of their services, capacity, and infrastructure.\n\nDuring these presentations, a few hospitals stood out, including the Federal Neuropsychiatric Hospital (FNPH) Kaduna. In line with Pillar 1 (Improving Governance) of our 4-point agenda, I traveled to Kaduna this week to commission FNPH Kaduna’s Electronic Health Record (EHR) office and Alternative Power Supply, and to witness firsthand the achievements of Dr. Aishatu Yusha’u Armiya’u CMD of FNPH Kaduna, over the past two years.\n\nI was impressed by the remarkable progress the hospital has made under Dr. Armiya’u’s leadership. Her ability to effectively utilize and maximize funds has greatly improved hospital operations, staff management, and patient care, providing a sense of normalcy for patients both during and after their treatment. It was truly inspiring.\n\nFNPH Kaduna is well on its way to becoming a center of excellence. I encourage all CMDs to follow Dr. Armiya’u’s example.\n\nGiven the stigma often associated with psychiatric hospitals, the Federal Government is working on an executive order to rename all FNPH facilities as Specialty Hospitals. Our goal is to ensure that Nigerians receive care in these facilities without judgment or stigma.\n\nI extend my thanks to Dr. Aishatu Yusha’u Armiya’u and her team for their warm welcome and commend her for her outstanding leadership.\n\n@Fmohnigeria #health #renewedhope",
    "likes": 15,
    "retweets": 4,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1829107810962923561",
    "url": "https://x.com/DrTunjiAlausa/status/1829107810962923561",
    "created_at": "Thu Aug 29 10:44:19 +0000 2024",
    "text": "Today, I’m pleased to be commissioning a series of projects at National Ear Care Centre, Kaduna @necckaduna, including a ENT Specialist Clinic, a new school of Post Basic ORL Nursing Hostel, 200 capacity Auditorium and a new Oxygen Plant. https://t.co/SzRaB7gKXD",
    "likes": 17,
    "retweets": 1,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1828508964881080748",
    "url": "https://x.com/DrTunjiAlausa/status/1828508964881080748",
    "created_at": "Tue Aug 27 19:04:43 +0000 2024",
    "text": "I was immensely pleased and proud to inaugurate the National Taskforce on Antimicrobial Stewardship (AMS) today in Abuja, in alignment with our 4-point agenda, specifically Pillar 2 (Improving Health Outcomes) and Pillar 4 (Health Security).\n\nAntimicrobial resistance (#AMR) is a silent but deadly threat that has taken root globally, including in Nigeria. #Nigeria ranks 18th worldwide in AMR-related deaths. In 2019, there were 64,500 deaths directly attributable to AMR and 263,400 deaths associated with AMR, surpassing fatalities from enteric infections, respiratory infections, tuberculosis, maternal and neonatal disorders, neglected tropical diseases, malaria, and cardiovascular diseases.\n\nCurrently, Nigeria lacks an AMS program to monitor antimicrobial use and sensitivity patterns across its regions. This poses a serious risk of escalating antimicrobial resistance, leading to increased morbidity and mortality.\n\nToday's inauguration marks a crucial step in our nation’s healthcare journey and underscores our government’s commitment to tackling one of the most pressing public health challenges of our time.\n\nThe taskforce is composed of distinguished experts in infectious diseases, public health practitioners, academics, representatives from multilateral groups focused on AMR, and officials from the Federal Ministry of Health and Social Welfare (FMOH&SW).\n\nTo address AMR effectively, the taskforce will:\n1. Coordinate AMR surveillance and research activities in Nigeria.\n2. Develop an AMR data platform.\n3. Promote education and awareness about AMR.\n\nRoutine education and widespread awareness are essential for reducing AMR-related deaths. \n\nOn behalf of the @Fmohnigeria, I extend my sincere gratitude to Prof Stephen Obaro, world renowned Paediatric Infectious Disease expert, the Taskforce’s National Coordinator, Dr. Omobosola Akinsete and all committee members for their dedication to this critical cause.\n\nI would also like to thank all our development partners their unwavering support.\n\nThe task before us is urgent and requires unwavering commitment. Together, we can combat antimicrobial resistance and safeguard the health of our people, fulfilling the mandate set by our President, @officialABAT, GCFR.",
    "likes": 33,
    "retweets": 3,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1827040980857414020",
    "url": "https://x.com/DrTunjiAlausa/status/1827040980857414020",
    "created_at": "Fri Aug 23 17:51:29 +0000 2024",
    "text": "The theme of the day was #malaria.\n\nYesterday, we also held the inaugural meeting of the National Intermittent Preventive Treatment in School Children (IPTsc) Research and Policy Uptake Task Team (NISPRPUT).\n\nStudies indicate that school-age #children (SAC) between the ages of 5-15 years bear a high burden of malaria. It is disheartening that this demographic has been overlooked in many malaria control interventions, despite comprising 26 percent of the African population.\n\nThe Federal Ministry of Health & Social Welfare's National Malaria Elimination Programme is planning a pilot randomized controlled trial (RCT) on IPTsc to assess the protective effects of Sulphadoxine-Pyrimethamine plus Amodiaquine (SPAQ) and Dihydroartemisinin-Piperaquine (DHP) in SAC in Sokoto and Cross River States from September 2024 to December 2025. It is important to note that resistance to these drugs has not been recorded in the country, and continuous monitoring is in place to ensure this remains the case.\n\nThe NISPRPUT task team consists of experts from various ministries, departments, agencies, programs, academia, and professional organizations, carefully chosen to facilitate decision-making for the adoption of IPTsc policies based on data generated from the RCT study.\n\nGiven that malaria is a major contributor to absenteeism in schools and workplaces, our hope is that focusing on SAC will further reduce malaria prevalence in Nigeria.\n\nAdditionally, the study will complement existing malaria prevention strategies, i.e. insecticide-treated nets, seasonal malaria chemoprevention, and intermittent preventive treatment in pregnancy, as well as improve malaria surveillance and treatment outcomes.\n\nI am confident that the collective wisdom, expertise, and dedication of the task team will guide the assessment of the intervention and provide the data needed to make informed decisions for the wellbeing and betterment of Nigerians.\n\nOn behalf of the @Fmohnigeria, I commend our partners, the Ministries of Education and World Bank, for their efforts and look forward to the results of the study.",
    "likes": 7,
    "retweets": 1,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1826969248008126684",
    "url": "https://x.com/DrTunjiAlausa/status/1826969248008126684",
    "created_at": "Fri Aug 23 13:06:26 +0000 2024",
    "text": "In our pursuit to meet the WHO's Eliminate Malaria Mandate by 2030, the @Fmohnigeria held the inaugural meeting of the End #Malaria Council (EMC) yesterday.\n\nOriginally established in 2017 and inaugurated by former President Buhari in August 2022, Nigeria’s EMC aims to:\n- Increase advocacy among national and state actors\n- Mobilize resources\n- Ensure accountability\n- Foster strong political commitment and will at all levels\n- Mobilize financial and in-kind resources from innovative sources, including the private sector, to bridge the resource gap in our national malaria strategic plan.\n\nAs you may recall, Nigeria, along with ten other countries, signed a declaration in Yaoundé, Cameroon, agreeing to rapidly scale up interventions to eliminate malaria.\n\nThe meeting, convened by EMC Chairman Alhaji @AlikoDangote, marked a significant step in our Rethinking Malaria Elimination Strategy and realigned our efforts toward meeting the WHO's mandate.\n\nI am pleased to report that the meeting was productive, with full attendance and active participation from all members. Ideas for potential initiatives were discussed, and members expressed enthusiasm for combating malaria and supporting President @officialABAT GCFR’s goal of providing comprehensive healthcare to all Nigerians.\n\nOn behalf of the Federal Government and the Federal Ministry of Health & Social Welfare, I extend my gratitude to EMC Chairman Alhaji Aliko Dangote for chairing this significant meeting and for his outstanding leadership and unwavering commitment to the progress of our nation.\n\nI also thank each member of the EMC for their dedication and ongoing commitment to enhancing our health sector. Together we can eliminate Malaria in Nigeria. \n\n#ZeroMalaria \n#Health  #Renewedhope",
    "likes": 33,
    "retweets": 12,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1826644908255432763",
    "url": "https://x.com/DrTunjiAlausa/status/1826644908255432763",
    "created_at": "Thu Aug 22 15:37:38 +0000 2024",
    "text": "The Healthcare sector is forging ahead. \n\nIn line with Pillar 1 & 2 (Improving Governance & Improving Population Health) of our 4-point Agenda, the Federal Ministry of Health & Social Welfare, on behalf of the Federal Government, has signed a Memorandum of Understanding (MoU) with the @tarabagovt for the transition of the National Orthopedic Hospital in Jalingo into a Federal Medical Centre. This agreement represents a significant step in our ongoing efforts to enhance healthcare delivery in the region.\n\nThe President is resolute in his commitment to strengthening healthcare infrastructure across the country, particularly in underserved areas, to improve overall health outcomes for Nigerians. This commitment is evident in the recent establishment of FMCs in Ado (Ekiti), Epe, Misau (Bauchi), and other new orthopedic centers across the country.\n\nI would like to extend our gratitude to the Governor of Taraba State, H.E. @AgbuKefas, for transferring the hospital to the Federal Government, and to the Deputy Governor of Taraba State, Alhaji Aminu AbdullahiAlkali, for attending the MoU signing. We are thankful for your support in ensuring that the facility is utilized to its full potential for the ongoing benefit of the state.\n\nThe @Fmohnigeria is dedicated to providing the necessary support and resources to ensure that the hospital serves the people of Taraba and its surrounding states, offering comprehensive and affordable healthcare services.",
    "likes": 19,
    "retweets": 8,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1822918038535979489",
    "url": "https://x.com/DrTunjiAlausa/status/1822918038535979489",
    "created_at": "Mon Aug 12 08:48:23 +0000 2024",
    "text": "Good morning All,\n\nI recently appeared on NTA Yoruba to spread awareness of the Ministry of Health & Social Welfare’s 4-pillar plan, the President’s Renewed Hope Agenda, and other initiatives the Federal  Government is advancing.\n\nClick the link below to watch the segment.\n\nhttps://t.co/41lCjBJACU",
    "likes": 10,
    "retweets": 0,
    "replies": 6,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1822218483783897428",
    "url": "https://x.com/DrTunjiAlausa/status/1822218483783897428",
    "created_at": "Sat Aug 10 10:28:36 +0000 2024",
    "text": "This week, we kicked off another groundbreaking initiative aimed at expanding the health workforce and building capacity.\n\nIn alignment with President @officialABAT, GCFR’s mission to aggressively enhance the healthcare workforce, I had a key meeting with @drdolapofasawe, the FCT Mandate Secretary for Health & Environment, and the leadership of @officialVUA, @NileUni , and @bazeuni_abuja Universities. Our discussion focused on the universities participation in Phase 2 of the @Fmohnigeria’s initiative to increase the quota of medical students.\n\nPhase 1 of this pilot initiative, in collaboration with the Lagos State Government @followlasg and LASUTH College of Medicine @LASUTHikeja @collegeofmedicine, will expand the school’s annual enrollment quota to approximately 2,000 medical students, along with several hundred students in pharmacy, dental, and biomedical engineering. This phase is set to begin in December 2024.\n\nFor Phase 2, approximately 800 students from @BazeUniversity, Veritas, and Nile University will participate in the pilot program and receive training at selected FCT General Hospitals. To enhance capacity building at these General Hospitals, the universities will contribute financially to infrastructure development, equipment provision, and other necessary resources to help the hospitals meet specific standards for training students.\n\nApplicants for medical school during this pilot will be admitted based on merit, and doctors at the selected General Hospitals will receive honorariums for teaching the students, with potential opportunities for becoming professors. In addition to building capacity and addressing the \"japa syndrome,\" this initiative will increase access to care, offer students a robust healthcare education, improve health indices, and create new career opportunities.\n\nWe at the FMOH&SW are excited about Phase 2 and have already seen interest from other states eager to join the program. I commend the FCT Mandate Secretary for her leadership and support. I also extend thanks the university leaders, and look forward to further discussions.",
    "likes": 6,
    "retweets": 6,
    "replies": 9,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1821597320644792528",
    "url": "https://x.com/DrTunjiAlausa/status/1821597320644792528",
    "created_at": "Thu Aug 08 17:20:19 +0000 2024",
    "text": "@muhammadpate @DrZSB @Fmohnigeria @DrZSB Congratulations, my dear sister on your appointment. Your dedication to reducing cancer prevalences in women and girls has not gone unnoticed.",
    "likes": 3,
    "retweets": 0,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1820862690123723224",
    "url": "https://x.com/DrTunjiAlausa/status/1820862690123723224",
    "created_at": "Tue Aug 06 16:41:09 +0000 2024",
    "text": "This week marks a significant milestone for the citizens of Misau, #Bauchi.\n\nIt was my pleasure to hand over an appointment letter to Dr. Rufai Abdu Dachi, who has been appointed as the first Acting Medical Director for Federal Medical Centre (FMC) Misau.\n\nIn alignment with President Bola Ahmed Tinubu, GCFR’s Renewed Hope Agenda, which focuses on improving citizens' access to meaningful and comprehensive healthcare, the FMOH&SW has instructed FMC Misau to establish its own nursing school next year. This initiative will increase educational and career opportunities for the approximately 2 million residents of Bauchi, its surrounding states, and address the brain drain crisis.\n\nI extend my gratitude to President @officialABAT, GCFR, for his unwavering commitment to revamping the healthcare sector, and the Governor of Bauchi State, H.E. Sen. Bala Mohammed, for transferring Misau General Hospital to the Federal Government for conversion into a Federal Medical Centre.\n\nCongratulations once again to Dr. Dachi on his appointment. We at the @Fmohnigeria are committed to providing all the necessary support needed to help succeed in your role and deliver tertiary care to #Nigerians in Misau and its surrounding areas.",
    "likes": 23,
    "retweets": 9,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1820794183839359284",
    "url": "https://x.com/DrTunjiAlausa/status/1820794183839359284",
    "created_at": "Tue Aug 06 12:08:56 +0000 2024",
    "text": "Yesterday marked a significant milestone for the citizens of Epe, #Lagos.\n\nIt was my pleasure to hand over the appointment letter to Dr. Adeleke Adesola Kaka, who has been appointed as the first acting Medical Director for the Federal Medical Centre (FMC) Epe.\n\nAs it stands, millions of people in Epe have to travel long distances to access healthcare. With the establishment of this Centre, residents from Epe township as well as the northern and southern parts of Epe can now receive comprehensive healthcare closer to their homes, reducing the need for long journeys.\n\nAdditionally, as part of the @Fmohnigeria’s strategy to expand the healthcare workforce, we have instructed FMC Epe to establish their own Nursing school by next year. This initiative aims to improve educational and career opportunities for young Nigerians and address the brain drain crisis. \n\nOn behalf of the people of #Epe — my constituency, I extend my gratitude to President @officialABAT, GCFR, for his unwavering commitment to revamping the healthcare sector and ensuring that every Nigerian citizen has access to meaningful and comprehensive healthcare.\n\nI also express my sincere gratitude to the Governor of @followlasg State, H.E. Mr. @jidesanwoolu, for transferring Epe General Hospital to the Federal Government for conversion into a Federal Medical Centre.\n\nCongratulations once again to Dr. Kaka on his appointment. We at the @Fmohnigeria (FMOH&SW) are committed to providing all the support necessary for you to succeed in your role.",
    "likes": 20,
    "retweets": 6,
    "replies": 12,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1819742243303137585",
    "url": "https://x.com/DrTunjiAlausa/status/1819742243303137585",
    "created_at": "Sat Aug 03 14:28:54 +0000 2024",
    "text": "Yesterday I paid a visit to Portland Gas Limited’s Compressed Natural Gas (CNG) Plant in Utako, Abuja. \n\nAs it stands, there is a current gap in provision of power that enables hospitals and primary care centres to run on 24hour power supply.\n\nFollowing the removal of the fuel subsidy and H.E. President Bola Ahmed Tinubu GCFR’s directive for the Federal Government to start procurement of CNG powered vehicles, generators and tricycles (PNCGI) , #CNG could potentially fill in the gap as a cheaper alternative.\n\nThat’s why it’s essential that we clearly understand the current CNG landscape, manufacturing, transportation, and sale process, in order for the health sector to utilise it as an alternative to petrol and diesel.\n\nAt the visit, I was enthused to see how CNG powers vehicles and generators, learn about its storage, refilling and distribution. It was also interesting to learn about the fuel to CNG conversion process, which takes about 2hour 30mins. The dual fuel hybrid conversion solution also allows for car users to seamlessly switch from fuel from CNG. CNG could very well be the future for power supply in the country.\n\nI extend thanks to Mr Folajimi Lai Mohammed for the tour.",
    "likes": 20,
    "retweets": 6,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1819364607040901298",
    "url": "https://x.com/DrTunjiAlausa/status/1819364607040901298",
    "created_at": "Fri Aug 02 13:28:19 +0000 2024",
    "text": "After the One-day National Strategic Meeting on health research, I was pleased to welcome the Chairs of NHREC and NHRC, and the VC of UNILAG to my office to further discuss our research and innovation plans. \n\nI extend thanks to the Chairs and the VC, for the courtesy visit. https://t.co/q4moVAcpyq",
    "likes": 10,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1819051298576081204",
    "url": "https://x.com/DrTunjiAlausa/status/1819051298576081204",
    "created_at": "Thu Aug 01 16:43:20 +0000 2024",
    "text": "I was immensely proud to witness the gathering of such a distinguished assembly of experts, policymakers, researchers, and stakeholders at the National Strategic Meeting on Health Research Development and Innovation.\n\nNigeria stands at a critical juncture in its journey toward achieving optimal health outcomes for all its citizens. The role of health research and innovation in this endeavor cannot be overstated. Rigorous research provides the insights necessary to develop effective interventions and tangible solutions that improve the lives of our people.\n\nQuality and accessible healthcare for all Nigerians is a key objective within President Bola Ahmed Tinubu GCFR’s Renewed Hope Agenda. Research and innovation are crucial enablers in achieving this vision.\n\nThis three-day event is a testament to our collective commitment to fostering a robust health research ecosystem that not only addresses our current health challenges but also anticipates and prepares for future ones.\n\nI would like to extend my heartfelt gratitude to all participants and partners, including the National Health Research Committee, National Health Research Ethics Committees, Research Agencies (NIMR, NIPRID, NICRAT), NCDC, and our partners, especially the World Health Organization for their consistent support. I also want to recognize participants such as Professor Olufunmilayo Olopade, Chair of NHRC, Professor Richard Adegbola, Chair of NHREC, Professor Ogunsola, Vice Chancellor of the University of Lagos, who have made this important gathering possible.\n\nYour dedication and hard work are the backbone of our national health research agenda. Together, we have the potential to create a vibrant and sustainable research environment that drives innovation, enhances health outcomes, and ensures a healthier and more prosperous Nigeria.\n\n#research \n#innovation\n#Nigeria",
    "likes": 12,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1818992258605080887",
    "url": "https://x.com/DrTunjiAlausa/status/1818992258605080887",
    "created_at": "Thu Aug 01 12:48:44 +0000 2024",
    "text": "MESSAGE FROM DR TUNJI ALAUSA, HONOURABLE MINISTER OF STATE FOR HEALTH &amp; SOCIAL WELFARE on 01.08.2024\n\nThe Honourable Minister of State for Health &amp; Social Welfare, Dr Tunji Alausa, is seated at his office today Thursday August 1st, 2024, ready to work and serve his country. https://t.co/PCuwAKKNUl",
    "likes": 7,
    "retweets": 1,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1818720594453533013",
    "url": "https://x.com/DrTunjiAlausa/status/1818720594453533013",
    "created_at": "Wed Jul 31 18:49:14 +0000 2024",
    "text": "It was an honor to represent His Excellency President Asiwaju Bola Ahmed Tinubu GCFR at the commissioning ceremony of the Thompson Abayomi Oshin Physiotherapy Building at the College of Medicine, UCH Ibadan. This commendable structure was built by Pa Oshin’s children to honor their father, Africa and Nigeria’s first physiotherapist, Professor T. Abayomi Oshin.\n\nThe building will house lecture rooms, offices, and a museum dedicated to the beginnings of physiotherapy in Africa and Nigeria. It will serve as a beacon for advancements in physiotherapy in Nigeria and West Africa, supporting the education and development of both current and future physiotherapists. It will also further cement the history and legacy of the great Professor Thompson Abayomi Oshin. I extend heartfelt congratulations to Pa Oshin on his 98th birthday and the commissioning of this remarkable facility.",
    "likes": 20,
    "retweets": 5,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1818602497360933251",
    "url": "https://x.com/DrTunjiAlausa/status/1818602497360933251",
    "created_at": "Wed Jul 31 10:59:58 +0000 2024",
    "text": "Great words from our Permanent Secretary, Ms. Daju Dajukachollom, on @Fmohnigeria’s dedication to revitalizing our health research ecosystem. \n\n#research #health #nigeria https://t.co/h1AdadR1MC",
    "likes": 9,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1818585347141353730",
    "url": "https://x.com/DrTunjiAlausa/status/1818585347141353730",
    "created_at": "Wed Jul 31 09:51:49 +0000 2024",
    "text": "I’m pleased to be attending the One-Strategic Meeting on Health Research Development and Innovation. Research is the back bone of advancing societies, it’s high time we refocus the spotlight back on it. \n\n@Fmohnigeria https://t.co/CThJSgR12w",
    "likes": 5,
    "retweets": 5,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1818539262834266553",
    "url": "https://x.com/DrTunjiAlausa/status/1818539262834266553",
    "created_at": "Wed Jul 31 06:48:41 +0000 2024",
    "text": "Good morning everyone, I’ll be going live on channels TV this morning at 7.55 AM, to discuss the current progress the health sector has made in line with our 4 point agenda and Mr President’s Renewed Hope Agenda. \n\nClick here to watch the segment",
    "likes": 2,
    "retweets": 1,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1818243870515233275",
    "url": "https://x.com/DrTunjiAlausa/status/1818243870515233275",
    "created_at": "Tue Jul 30 11:14:54 +0000 2024",
    "text": "It is my pleasure to formally present the letter of appointment to Professor John Oladapo Obafunwa as the new Director General (DG) of the National Institute of Medical Research (NIMR).\n\nProfessor Obafunwa is a distinguished pathologist with a remarkable career, including his previous roles as Provost and Vice Chancellor of LASUTH’s Medical School. His extensive expertise in pathology, combined with his commitment to forensic science and medical advancements both in Nigeria and internationally, makes him the ideal candidate to build upon the legacy of Professor Salako, the former DG of @nimrnigeria .\n\nHaving a dedicated researcher leading one of our foremost research institutes aligns perfectly with our four-pillar agenda and the President’s vision of transforming Nigeria into a destination for medical tourism and a hub for medical and clinical research in West Africa.\n\nThe Federal Ministry of Health & Social Welfare, @Fmohnigeria, under the leadership of Professor Pate @muhammadpate, the Permanent Secretary, and myself, is fully committed to supporting Professor Obafunwa as he settles into his new role and strives to elevate NIMR to new heights.\n\nI extend my heartfelt congratulations to Professor Obafunwa on his appointment.\n\n#health #nigeria",
    "likes": 31,
    "retweets": 8,
    "replies": 6,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1816851554562941014",
    "url": "https://x.com/DrTunjiAlausa/status/1816851554562941014",
    "created_at": "Fri Jul 26 15:02:20 +0000 2024",
    "text": "To conclude my trip, I was pleased to attend @NACANigeria’s event on Sustainable Approaches to HIV Response in Nigeria.\n\nThis year’s @AIDS_conference theme, “Putting People First,” aligns perfectly with H.E. @officialABAT’s #RenewedHope Agenda and our Sector-Wide Approach (SWaP), which emphasizes innovative and sustainable solutions.\n\nOur focus on sustainability in the healthcare sector and the #HIV space involves empowering government-mandated structures to fulfill their responsibilities, rather than creating parallel systems. Implementing partners will provide technical support to these structures.\n\nAs stated during the inauguration of Nigeria’s Pediatric AIDS and PMTCT Acceleration Committee earlier this month, the @Fmohnigeria is committed to:\n\n1. Advancing the global alliance plan to eliminate mother-to-child transmission of HIV and pediatric HIV.\n\n2. Enhancing capacity for domestic production of HIV commodities to meet local needs, support neighboring West African countries, and sustain the national HIV response.\n\n3. Stimulating the local economy through industrialization.\n\nWith the recent executive order removing duties on pharmaceutical products and machinery, we will continue to encourage local production and improve health outcomes for Nigerians.\n\nA comprehensive public health approach is vital to addressing legal, policy, and structural issues, particularly for key populations in Nigeria.\n\nAs emphasized in my discussions with @PEPFAR and @UNAIDS , “No one will be denied services based on their sexual orientation.” While we uphold our laws, we are committed to ensuring that everyone, including those in custodial centers, receives necessary health services.\n\nI urge all stakeholders, both domestic and international, to partner with us in transforming our health system, starting with the HIV program.\n\nNigeria is open for business. The @Fmohnigeria is dedicated to creating a supportive policy environment for Nigerians first, and then for the international community.\n\nI extend my thanks to all our partners who have contributed to making this Nigeria event at #AIDS2024 a success. Your presence, despite your busy schedules, was greatly appreciated.\n\nI would like to extend special congratulations to Dr. @drtemitopeilori, Director General of NACA, for organizing such a well-attended event and conference. I look forward to the actionable items that will emerge from the high-level meetings held during the conference.",
    "likes": 10,
    "retweets": 2,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1816452658699321462",
    "url": "https://x.com/DrTunjiAlausa/status/1816452658699321462",
    "created_at": "Thu Jul 25 12:37:16 +0000 2024",
    "text": "At the @AIDS_conference, my team and I met with @Winnie_Byanyima, the Executive Director of @UNAIDS and her team. \n\nOur discussions focused on revitalising our #HIV/ #AIDS strategies, Nigeria's efforts with the inauguration of the PMTCT Acceleration Committee, and how UNAIDS can support increasing PMTCT and pediatric treatment. We also discussed UNAIDS' plans, enhancing collaboration with the @Fmohnigeria on advocacy programs, and our preparations for the upcoming Global Alliance Summit meeting, which Nigeria will be hosting.\n\nI extend my thanks to the Winnie Byanyima and her team for the productive discussions and look forward to further conversations on implementation strategies.\n\n#AIDS2024",
    "likes": 20,
    "retweets": 5,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1816204017112170786",
    "url": "https://x.com/DrTunjiAlausa/status/1816204017112170786",
    "created_at": "Wed Jul 24 20:09:15 +0000 2024",
    "text": "I was thrilled to witness significant participation from Nigerian researchers today at the @AIDS_conference. Engaging with the delegates was truly enriching; I learned about their research, and posed key questions on how their work could drive effective systemic change both locally and globally, and how @Fmohnigeria can support them in this endeavor.\n\nI extend my thanks to all the delegates and presenters for representing Nigeria admirably on the global HIV/AIDS stage and educating the global community on the progress we’re making in country. You are truly making Nigeria proud.\n\nLastly, I would like to express my appreciation to @AIDS_conference for organizing such an impactful conference.\n\n#HIV\n#AIDS\n#AIDS2024\n#PutPeopleFirst",
    "likes": 5,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1815778605558886546",
    "url": "https://x.com/DrTunjiAlausa/status/1815778605558886546",
    "created_at": "Tue Jul 23 15:58:49 +0000 2024",
    "text": "I’m delighted to be attending this year’s @AIDS_conference in Munich, Germany. #AIDS2024\n\nThe conference, themed \"Putting People First,\" aims to showcase global research and strategies aimed at reducing #HIV/ #AIDS prevalence, combating stigmatization, and enhancing the delivery of care.\n\nI had the pleasure of meeting Ambassador Dr. @JNkengasong, US Global AIDS Coordinator, ahead of the @PEPFAR & @UNAIDS session titled “A Public Health Approach to Creating an Enabling Legal and Policy Environment for an Equitable HIV Response.”\n\nLooking forward to sharing more about my experiences at the conference.\n\n#PutPeopleFirst \n#DrTunjiAlausa",
    "likes": 37,
    "retweets": 7,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1815426888828944774",
    "url": "https://x.com/DrTunjiAlausa/status/1815426888828944774",
    "created_at": "Mon Jul 22 16:41:13 +0000 2024",
    "text": "To address the growing public concerns regarding Genetically Modified (GM) foods, it was imperative that I convened a meeting with the Director-General of NBMA Dr. Agnes Yemisi Asagbra, and the Director-General of @NafdacAgency , Prof. Mojisola Adeyeye. Our goal was to find common ground and collaborate effectively to educate Nigerians and allay their fears.\n\nConsistent and effective communication among government agencies, coupled with a unified approach to disseminate information about #GMO crops and food safety, will significantly improve public perceptions.\n\nI extend my appreciation to the DG of NBMA and DG of NAFDAC for setting aside any differences and reaffirming NAFDAC’s commitment to adhere to the Memorandum of Understanding (MOU), ensuring the revocation of approval for any GM foods that fail to meet rigorous scientific safety assessments.\n\nTo enhance public trust in food safety regulations, we are establishing a Technical Working Group (TWG) between NBMA and NAFDAC. This TWG aims to:\n\n- Channel applicants through NBMA for preliminary assessments before NAFDAC processing.\n\n- Foster collaboration on risk assessment and GMO food labelling.\n\n- Facilitate capacity building and training exchanges.\n\n- Strengthen joint efforts in IT and global listing initiatives.\n\n@Fmohnigeria",
    "likes": 10,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1815347721391206762",
    "url": "https://x.com/DrTunjiAlausa/status/1815347721391206762",
    "created_at": "Mon Jul 22 11:26:38 +0000 2024",
    "text": "Do we focus on mental health enough?\n\nLast week, I had the privilege of attending the International Conference on Positive Mental Health in Capo Verde. At the conference, I had the opportunity to learn about the progress various countries are making towards enhancing mental health, and to share the initiatives our ministry is undertaking.\n\nPositive mental health is the cornerstone of our healthcare agenda. We recognize that mental well-being is crucial for both personal and societal prosperity. To this end, we have implemented several initiatives aimed at enhancing mental health services and promoting mental well-being. These include a National Mental Health Policy, targeted awareness campaigns, school-based programs, extensive substance abuse initiatives, and intensified research, monitoring, and data collection efforts.\n\nWe, @Fmohnigeria, firmly believe that integrating mental health programs and services into primary healthcare and establishing community-based mental health services are pivotal steps towards improving the mental health of our citizens.\n\nImproved mental health is not a luxury but a fundamental necessity for all Nigerians and Africans alike. Nigeria and Capo Verde are united in our commitment to prioritize the mental well-being of our citizens.\n\nAs advocates for enhanced mental health management, we aspire to inspire other #ECOWAS leaders across the continent to follow suit.\n\nI extend heartfelt thanks to Honourable Minister Mrs. Filomena Mendes Gonçalves, Minister of Health of Capo Verde, and her team for organizing an excellent conference.\n\n#mentalhealth \n#MentalHealthMatters \n#wellbeing\n#DrTunjiAlausa",
    "likes": 20,
    "retweets": 6,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1814375599449747848",
    "url": "https://x.com/DrTunjiAlausa/status/1814375599449747848",
    "created_at": "Fri Jul 19 19:03:47 +0000 2024",
    "text": "I’m pleased to be attending the International Conference on Positive Mental Health, under the motto “Positive Mental Health - A Priority Commitment for All”, in Cape Verde. \n\nI’m grateful for the warm welcome received from Honourable Minister  Filomena Mendes Gonçalves, Cabo Verde (Cape Verde)’s Minister of Health and her team, and look forward to the sessions. \n\n#mentalhealth \n#DrTunjiAlausa",
    "likes": 10,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1813290664379183354",
    "url": "https://x.com/DrTunjiAlausa/status/1813290664379183354",
    "created_at": "Tue Jul 16 19:12:38 +0000 2024",
    "text": "I was pleased to welcome Femi Mohammed Sheidu, the newly appointed Executive Secretary of the Police Trust Fund, and his team to my office to discuss areas of collaboration and initiatives the fund could undertake to enhance the health and welfare of our police officers and their hospitals.\n\nIt’s inspiring to witness young leaders stepping into key roles, ready to drive change within the current system. I extend my congratulations once again to Mr. Sheidu on his appointment and eagerly anticipate the implementation of our discussions.\n\n#health \n#collaboration \n#DrTunjiAlausa",
    "likes": 14,
    "retweets": 0,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1812474108149379299",
    "url": "https://x.com/DrTunjiAlausa/status/1812474108149379299",
    "created_at": "Sun Jul 14 13:07:56 +0000 2024",
    "text": "This week, I was pleased to meet Mrs Funmi Adesanya, @PEPFAR National Coordinator and her team to discuss key area of collaboration  aimed at domesticating and reindustrializing our #health sector to create jobs for our young population. As well as our Nigeria Digital in Health Initiative in regards to the need for interoperability and health information exchange. \n\nIn our discussion, I urged PEPFAR to prioritize purchasing locally manufactured needles, syringes, and WHO-prequalified Rapid Diagnostic Test kits in order to boost our #local #manufacturing capacity. \n\nAs well as stressed the importance of coordination among stakeholders to optimize the value chain in public health supply chain management.\n\nI thank PEPFAR for the fruitful discussion and look forward to further conversations. \n\n@Fmohnigeria",
    "likes": 5,
    "retweets": 0,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1811702984507609594",
    "url": "https://x.com/DrTunjiAlausa/status/1811702984507609594",
    "created_at": "Fri Jul 12 10:03:45 +0000 2024",
    "text": "This week marked a significant development for women and children living with #HIV #AIDS with the launch of the Prevention of Mother-to-Child Transmission (PMTCT) & Pediatric AIDS Acceleration Plan Committee.\n\nIn alignment with Nigeria’s 2021 National Global Alliance to End AIDS in Children Action Plan, the committee includes representatives from the Governor’s Forum, development partners, the Ministries of Women Affairs @FMWA_ng , Youth  and Development @NigeriaFMYS, Education @NigEducation, and @NSCIAng. Our goal is to reduce Nigeria's 25% share of global HIV transmission from mothers to their children.\n\nThe @Fmohnigeria four-pillar agenda cannot be achieved if children and women remain vulnerable to HIV. The National Agency for the Control of AIDS (@NACANigeria) and the National AIDS and STIs Control Programme (NASCAP) will oversee this program, reflecting the Federal Ministry’s commitment to effective governance.\n\nEliminating mother-to-child transmission of HIV and providing care for all individuals living with HIV, particularly children, aligns with President @officialABAT’s renewed hope agenda. \n\nTo meet the global goal of eradicating HIV/AIDS by 2030, the Federal Ministry of Health & Social Welfare will collaborate with State governors and their spouses, State ministries of health, state agencies for AIDS control, lead implementing partners, and other stakeholders. Addressing AIDS requires a multi-stakeholder approach, and it is essential to work together to achieve this goal.\n\nI extend my gratitude to Dr. Temitope Ilori, DG of NACA; H.E. Amb. Dr. Olufolake AbdulRahman AbdulRazaq, First Lady of Kwara State and Chair of the First Lady’s Forum; and our national strategic and development partners (including the Association of Women Living with HIV/AIDS, @UN CDC, @PEPFAR, @UNAIDS, CHAI and @GlobalFund) for their unwavering support.\n\nTogether, we can create an AIDS-free generation.",
    "likes": 21,
    "retweets": 7,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1811054857366704290",
    "url": "https://x.com/DrTunjiAlausa/status/1811054857366704290",
    "created_at": "Wed Jul 10 15:08:20 +0000 2024",
    "text": "I was delighted to deliver the keynote address at the Third National Perennial #Malaria Chemoprevention (PMC) Research and Policy Uptake Task Team (NPRPUT) Meeting.\n\n#Nigeria continues to occupy the unenviable position of having the highest malaria burden, accounting for 27% of total cases and 31% of deaths respectively (World Malaria Report 2023).\n\nTherefore, it is imperative that we effectively utilize the data gathered in the PMC study to make informed decisions on future PMC policy adoptions and ensure that the deployed interventions complement other malaria control efforts.\n\nAt the Federal Ministry of Health and Social Welfare @Fmohnigeria , we are unwavering in our commitment to eliminating malaria, as demonstrated through the current National Malaria Strategic Plan 2021–2025.\n\nI am confident that the collective wisdom, expertise, and dedication present yesterday will pave the way for impactful PMC interventions and help us achieve Mr. President’s and our shared mission to improve public health.\n\nI extend my thanks to our funding and implementing partners, including the @WHONigeria,  @gatesfoundation, the Malaria Consortium,@NphcdaNG , the Department of Health Planning Research and Statistics, the State Malaria Elimination Programmes (SMEPs), and the State Primary Health Development Agency (SPHCDA). I also want to acknowledge the efforts of all health workers at the service delivery points who work tirelessly in collaboration with the study team.",
    "likes": 9,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1810012588694028387",
    "url": "https://x.com/DrTunjiAlausa/status/1810012588694028387",
    "created_at": "Sun Jul 07 18:06:44 +0000 2024",
    "text": "Later that day, I was honored to join H.E. Governor Oyebanji and his family at the commissioning of the Abiyamo Esther Bosede Oyebanji Maternity Ward, built by the Governor and his siblings in honor of their late mother, Chief (Mrs.) Esther Bosede Oyebanji.\n\nThe multi-bedded facility is supplied with new medical technology, operating suites, and well-trained staff to ensure every mother can experience the joy of childbirth without fear and avoidable complications.\n\nI extend my heartfelt gratitude to my dear brother and friend, Governor Oyebanji, for bestowing upon me the honor to open this new facility and look forward to learning of the impact this facility will have on his people.",
    "likes": 7,
    "retweets": 0,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1809926311940431925",
    "url": "https://x.com/DrTunjiAlausa/status/1809926311940431925",
    "created_at": "Sun Jul 07 12:23:54 +0000 2024",
    "text": "On Friday, July 5th, the @Fmohnigeria signed an MOU with the @ekitistategov for the handover of the State Specialist Hospital in Ikole Ekiti to the federal government as the Federal Medical Centre, Ikole Ekiti.\n\nThe transition of the hospital into a Federal Medical Centre will offer specialized medical care, attract skilled healthcare professionals, and provide a platform for cutting-edge medical research. The benefits will extend far beyond Ikole Ekiti, positively impacting the entire region and contributing to the overall improvement of our national healthcare system.\n\nThis transition into an FMC further underscores the goal of Mr. President to decentralize and democratize #healthcare, ensuring that every Nigerian, regardless of their location, has access to quality healthcare services.\n\nI would like to commend Governor Oyebanji; Deputy Governor Chief Mrs Monisade Afuye; Honourable Commissioner Dr. Oyebanji Filani, and the Ekiti State Government for their foresight and prioritization of healthcare. I would also like to thank the kabiyesi’s and regents who came and would driver further awareness of the FMC to their people. Together, we can continue to revolutionise Nigeria’s Healthcare system for the better.",
    "likes": 18,
    "retweets": 5,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1809145655257923859",
    "url": "https://x.com/DrTunjiAlausa/status/1809145655257923859",
    "created_at": "Fri Jul 05 08:41:51 +0000 2024",
    "text": "Breast cancer is one of the most prevalent forms of #cancer affecting the citizens of Nigeria.\n\nPrevention, advocacy, and increased awareness are key strategies to reduce the prevalence of breast cancer. That’s why it was important for me to join my dear friend, H.E. @biodunaoyebanji, Governor of @ekitistategov, and H.E Dr.@YemibOyebanji, Forst Lady of Ekiti State to commission a mammography machine at the Funmi Olayinka Diagnostic and Wellness Centre, located at Ekiti State University Teaching Hospital (EKSUTH) in Ado Ekiti.\n\nThe commissioning ceremony of the centre’s new mammography machine further raises awareness about the availability of screening, diagnostic capabilities, treatment, and other general services the centre provides.\n\nGovernor Biodun Oyebanji's efforts to ensure healthcare centres in Ekiti are well-equipped with the necessary medical devices and consumables to deliver quality healthcare to his citizens are highly commendable. His commitment underscores dedication to providing for his citizens.\n\nI’d also like to commend the work of Dr. Oyebanji Filani @okeanaye, Commissioner for Health & Human Services and Chairman of the Commissioners of Health Forum, for his efforts to revive hospitals and healthcare centres in his state. \n\nWe cannot continue with such a high level of cancer-related mortality. Early detection can save lives. Therefore, I urge the citizens of Ekiti State to take advantage of this centre.\n\nẸyin obirin ẹ lọ gba ayewo fun aarun jẹjẹrẹ oyan ni ile iwosan Ekiti State University Teaching Hospital (EKSUTH). Ẹyin okunrin ni ipinle Ekiti, ẹ sọ fun awọn iyawo yin, a ti mama yin, at i awon ọmọ yin obirin a ti gbo gbo awon ebi yin obirin pe ki wọn lọ gba ayewo fun aarun jẹjẹrẹ oyan ni ile iwosan Ekiti.\n\n@Fmohnigeria",
    "likes": 25,
    "retweets": 10,
    "replies": 5,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1808888870613962928",
    "url": "https://x.com/DrTunjiAlausa/status/1808888870613962928",
    "created_at": "Thu Jul 04 15:41:28 +0000 2024",
    "text": "Yesterday marked another significant milestone in delivering meaningful and effective healthcare to the citizens of Nigeria. \n\nI was honored to receive His Excellency Barr. @CalebMutfwang , Governor of Plateau State; Dr. Shurkuk, Plateau State’s Commissioner of Health; and their entourage for the signing of an MOU between Plateau State and the @Fmohnigeria. \n\nThe signed MoU indicates the handover of the National Orthopaedic Hospital Jos and Federal Teaching Hospital Wase from the state to the Federal Government. \n\nUnder President @officialABAT GCFR’s #RenewedHope Agenda, the adoption of these new tertiary facilities will enable the Federal Government to better serve the people of Plateau State, its neighboring states such as Gombe and Adamawa, and the entire country through job creation, capacity building, and training. \n\nOn behalf of the Federal Ministry of Health and Social Welfare, I extend my gratitude to Governor Caleb Mutfwang for his dedication to the betterment of his constituents and for upholding the Compact Agreement signed with the President last year.",
    "likes": 5,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1808808062444089793",
    "url": "https://x.com/DrTunjiAlausa/status/1808808062444089793",
    "created_at": "Thu Jul 04 10:20:22 +0000 2024",
    "text": "I was glad to welcome @EngrAbisoye, DG of @nimc_ng, and her team to my office to further discuss our ongoing dialogue on enhancing collaboration between NIMC and the @Fmohnigeria, particularly concerning our Nigeria Digital Health Initiative.\n\nNIMC's progress with NIN registrations is commendable, as this data holds significant potential for improving healthcare services and governance.\n\nI appreciate Engr Coker-Odusote and her team for their visit and eagerly anticipate our future collaboration efforts.",
    "likes": 18,
    "retweets": 4,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1808022863984673201",
    "url": "https://x.com/DrTunjiAlausa/status/1808022863984673201",
    "created_at": "Tue Jul 02 06:20:16 +0000 2024",
    "text": "Morning All,\n\nI’ll be live on @channelstv at 7.30AM this morning to discuss the  Executive Order on Pharmaceuticals and medicinal products.\n\nDo tune in to learn more about the order and the next steps we’ll be taking. https://t.co/S4C7B3iVcq",
    "likes": 13,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1807031820887654907",
    "url": "https://x.com/DrTunjiAlausa/status/1807031820887654907",
    "created_at": "Sat Jun 29 12:42:13 +0000 2024",
    "text": "On Thursday, June 27th, I had the pleasure of dining with the Federation of Nigerian Pharmaceutical Associations (FeNPIA).\n\nThe dinner provided an opportunity to hear about FeNPIA’s challenges, current bottlenecks, their goals, and to discuss how the Federal Ministry of Health & Social Welfare @Fmohnigeria (FMOH&SW) can offer support.\n\nEnsuring Nigeria’s pharmaceutical industry thrives through local medical industrialization is an integral part of the President’s Renewed Hope Agenda and Pillar 3, \"Unlocking the Value Chain,\" of the Federal Ministry of Health & Social Welfare’s 4-point agenda.\n\nTo foster national growth, it is crucial that we increase our manufacturing capacity, production, sales, and exportation of health products. This is why we have diligently worked on an Executive Order aimed at boosting local production of pharmaceuticals, diagnostics, devices (such as needles and syringes), biologicals, etc. This order was signed by the President on Friday, June 28th.\n\nThe Order introduces zero tariffs, excise taxes, and VAT on specified machinery, equipment, and raw materials, such as Active Pharmaceutical Ingredients (#APIs), excipients, solvents, disintegrants, etc., necessary for producing essential health medicines and products. This means existing and new manufacturers can now engage in end-to-end pharmaceutical production processes.\n\nOur hope is that the Executive Order will incentivize and support Nigerian #manufacturers, reduce production costs associated with imports, enhance the competitiveness of local manufacturers, create more jobs, and boost our economic value.\n\nI extend heartfelt thanks to President Bola Ahmed Tinubu @officialABAT for listening to the concerns of the people and for his commitment to reaffirming Nigeria’s position as a leading nation.\n\nI would also like to thank the Minister of Justice and Attorney General of the Federation, Prince Lateef @LOFagbemi , for initiating the codification process of the order, as well as all ministries and stakeholders who provided guidance and support in bringing this Executive Order to fruition. The Order is a collaborative effort across ministries, necessitating cross-sector cooperation for its swift implementation.",
    "likes": 7,
    "retweets": 1,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1806369690845073823",
    "url": "https://x.com/DrTunjiAlausa/status/1806369690845073823",
    "created_at": "Thu Jun 27 16:51:09 +0000 2024",
    "text": "I was honored to serve as the Special Guest of Honour at the 4th Edition of the Africa Digital Health Summit (ADHS), themed “Digital Transformation of Health Systems: What, Why, How?”\n\nIn our rapidly evolving world, digital transformation is no longer a luxury but a necessity. The COVID-19 pandemic has starkly highlighted gaps and challenges in global health systems, emphasizing the urgent need for innovative solutions to ensure resilient and responsive healthcare delivery.\n\nDigital health solutions have the potential to significantly improve patient care and safety, streamline processes, reduce errors, and facilitate more accurate diagnoses and treatments. They also enable us to reach underserved populations and enhance the efficiency of healthcare systems by reducing costs and optimizing resource allocation.\n\nUnder the visionary leadership of our President, @officialABAT , GCFR, Prof. @muhammadpate and I have been tasked with ensuring the full digitization of our health system, recognizing it as a key enabler to achieving quality healthcare and Universal Health Coverage (UHC) for all Nigerians.\n\nAligned with the President's Renewed Hope Agenda and the FMOH&SW’s 4-pillar agenda, we have established the Nigeria Digital in Health Initiative (NDHI), governed by a 20-member committee, to transform the country’s healthcare delivery system using a unified and interoperable digital health architecture.\n\nSince the inauguration of the NDHI’s Implementation Committee, we have reviewed existing national and international standards, frameworks, and policies, and engaged with various stakeholders including digital health solutions providers.\n\nAs the next step, we are proud to launch the NDHI website, https://t.co/0VnOG9FGSN. This website serves as a one-stop shop for information about the NDHI, our progress, and communication activities. I urge all stakeholders and digital health solution providers to join our community. This is an opportunity for all of us to work together towards our collective goal of creating the healthcare system we deserve.\n\nI extend my congratulations to @drosams, Founder of the @adhsummit and his team for bridging the digital health gap through this summit. I also commend all stakeholders and attendees, for their participation and contributions to the summit.",
    "likes": 9,
    "retweets": 4,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1806051528324563261",
    "url": "https://x.com/DrTunjiAlausa/status/1806051528324563261",
    "created_at": "Wed Jun 26 19:46:53 +0000 2024",
    "text": "Today, we marked the public presentation of the National Cancer Registry Regulations for Nigeria.\n\nThe National Cancer Registry Regulations offer a platform for continuous professional development and collaboration. They will improve access to real-time data, promote early detection through timely diagnosis and intervention, and help mitigate the impact of #cancer on individuals and communities, thereby significantly improving the quality of healthcare delivery in Nigeria.\n\nBy mandating healthcare providers to report cancer cases to centralized registries, @Fmohnigeria aims to create a comprehensive database that accurately reflects the burden of cancer within the country. This data-driven approach is essential for formulating evidence-based policies, allocating resources effectively, and monitoring the effectiveness of interventions over time.\n\nCancer is a global health crisis, and Nigeria is no exception. It is estimated that over 124,000 new cases of cancer were recorded in Nigeria in 2020, resulting in 78,899 deaths. The prevalence of cancer is rising at an alarming rate, posing a significant threat to the health and well-being of our people.\n\nOn behalf of the @Fmohnigeria, I extend my sincere appreciation to the Nigeria Institute of Cancer Research and Treatment (@NicratGov) and their partners: the African Cancer Registry Network, International Agency for Research on Cancer, and St Jude’s Children’s Research Hospital USA, for developing this important document. This collaborative effort is essential for building a resilient healthcare system capable of addressing the growing burden of cancer in Nigeria.\n\nIt is our hope that this will translate into concrete actions that advance our collective fight against cancer.",
    "likes": 29,
    "retweets": 11,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1805907438706516445",
    "url": "https://x.com/DrTunjiAlausa/status/1805907438706516445",
    "created_at": "Wed Jun 26 10:14:20 +0000 2024",
    "text": "On Tuesday, June 25th, 2024, the Federal Executive Council (FEC) convened to address several urgent issues. The agenda encompassed key sectors of the economy, including health, minimum wage, and environmental concerns. Regarding health, the council focused on four main areas: infrastructure, public health issues such as the current #cholera outbreak, and child and maternal malnutrition.\n\nIn terms of organizational structure for healthcare regulatory agencies, tertiary hospitals, Federal Medical Centres (FMCs), and Federal Specialist Hospitals (FSHs), the council approved guidelines specifying that regulatory agencies will have 13 board members and 5 statutory members, while teaching hospitals, FMCs, and FSHs will each have 7 board members and 3 statutory members.\n\nThe council and the President authorized the Attorney General to amend the acts governing regulatory agencies, tertiary hospitals, Federal Medical Centres, and specialist hospitals to align with the newly approved regulations and board compositions.\n\nDue to the increasing incidence of maternal and child malnutrition, the council approved a plan to distribute 'ready-to-eat' nutritional food within the coming weeks. Approval was granted for the Coordinating Minister of the Economy to mobilize funds for purchasing locally manufactured 'ready-to-eat' food, which will be distributed to states identified with high rates of malnutrition. This initiative aims to support local manufacturing capacity and promote industrialization. \n\n#FEC",
    "likes": 8,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1805858889423896598",
    "url": "https://x.com/DrTunjiAlausa/status/1805858889423896598",
    "created_at": "Wed Jun 26 07:01:25 +0000 2024",
    "text": "Ahead of today’s workshop on the National Cancer Registry’s Regulations, I was pleased to meet representatives from the African Cancer Registry Network, the International Agency for Research on Cancer, and St. Jude’s Children’s Research Hospital USA, whom are collaborating with Nigeria’s Institute of Cancer Research and Treatment (NICRAT).\n\nI am very proud of @NicratGov’s progress over the past year in raising awareness and working closely with stakeholders to ensure the effective implementation and sustainability of our national cancer registry.\n\nI extend my thanks to the representatives for the courtesy visit and Prof. Malami and his team for their hard work and dedication to improving the quality of healthcare delivery for Nigerians living with #cancer.",
    "likes": 24,
    "retweets": 11,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1805634435288650067",
    "url": "https://x.com/DrTunjiAlausa/status/1805634435288650067",
    "created_at": "Tue Jun 25 16:09:31 +0000 2024",
    "text": "It brings me great joy to announce the signing of an Memorandum of Understanding (MOU) between the Association of Nigerian Physicians in the Americas (ANPA) & the Medical Dental Council of Nigeria (MDCN), to collaborate in the pursuit of accreditation of Nigeria’s undergraduate medical education by the World Federation for Medical Education (WFME). \n\nWith this MOU, we are much closer to stabilising and improving the skill set and capacity of our healthcare workforce.\n\nI extend congratulations to Dr Kyari, MDCN Registrar, her team, Dr Chinyere Anyagou ANPA National President (Outgoing) Dr Cliff Eke ANPA National President (Incoming) and the ANPA leadership team on this momentous occasion. \n\nThe future is looking brighter for Nigeria’s healthcare sector.\n\n#healthcare #workforce #capacitybuilding #nigeria",
    "likes": 47,
    "retweets": 15,
    "replies": 8,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1805243586931257464",
    "url": "https://x.com/DrTunjiAlausa/status/1805243586931257464",
    "created_at": "Mon Jun 24 14:16:25 +0000 2024",
    "text": "Another highlight of the ANPA convention was attending the Ibadan College of Medicine Alumni Association's 2024 Annual General Meeting and the College of Medicine University of Lagos (CMUL) Alumni meeting. It was wonderful to engage with all my colleagues from these esteemed institutions and discuss our joint goal to improve the country’s healthcare sector.",
    "likes": 14,
    "retweets": 2,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1804650769662321096",
    "url": "https://x.com/DrTunjiAlausa/status/1804650769662321096",
    "created_at": "Sat Jun 22 23:00:46 +0000 2024",
    "text": "In line with the Federal Ministry of Health and Social Welfare’s Healthcare professional in the Diaspora (HPD) initiative, I was pleased to lead the Nigerian delegation on discussions regarding MDCN’s aim to facilitate licensing for Nigerian Physicians in Diaspora to be able to practice in Nigeria. \n\nThe MDCN’s goal not only aligns with their core objective to enhance stakeholder engagement and relationships nationally and globally, but also aligns with Mr President’s mission to boost the involvement of Nigerian healthcare professionals both at home and abroad.\n\nBy working with ANPA, the MDCN can utilise the associations network to;\n•Foster annual practising licensure\n•Serve as a clearing house providing 3rd party endorsement of MDs in the Americas and Caribbean\n•Support for the World Federation of Medical Education (WFME) accreditation of Medical Schools in Nigeria\n•Foster teaching engagement\n•Enhance MDCN’s relationship with academics in the Americas and Caribbean seeking faculty engagement or research collaboration\n\nIt’s time we leverage our national and global networks to drive productivity in the healthcare sector. \n\nI extend thanks to Dr Fatima Kyari, MDCN Registrar and  her team for making the trip to enlighten ANPA’s leadership team and it’s members about the councils plans. \n\nI eagerly await the positive change this collaboration will bring for the sector and the nation.",
    "likes": 30,
    "retweets": 6,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1804582697353748845",
    "url": "https://x.com/DrTunjiAlausa/status/1804582697353748845",
    "created_at": "Sat Jun 22 18:30:17 +0000 2024",
    "text": "Following the success of yesterday’s events, I was thrilled to engage in cross collaborative discussions with Dr. Diana Ramos, California Surgeon General, @CA_OSG, pertaining to advancing Maternal Health Equity. \n\nI look forward to continuing our discussions and to create a future where women and girls have better access to the healthcare they need when and where they need it.\n\n#health #anpa #nigeria #Usa",
    "likes": 9,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1804194596097765417",
    "url": "https://x.com/DrTunjiAlausa/status/1804194596097765417",
    "created_at": "Fri Jun 21 16:48:06 +0000 2024",
    "text": "It was with immense pride and pleasure that I opened @anpa_national’s Annual Convention & Scientific Assembly. \n\nAs doctors with Nigerian heritage, we all carry a unique responsibility, to not only serve the country where we live, but also to uplift and support the transformation of the healthcare landscape in our home country.\n\nGlobally and nationally, we are facing a myriad of challenges, opportunities and are witnessing rapid advancements in medical technology, changing patient demographics, evolving disease patterns, and global health crises.  \n\nThe President @officialABAT, GCFR led administration has shown a keen interest in the prioritization of healthcare including the involvement of Nigerian healthcare professionals both at home and abroad in a more robust and sustainable fashion. Thus presenting an opportune time for ANPA and its members to collectively and individually join hands with the Nigerian government, and provide access to the wealth of knowledge, experience, and skills gained through their endeavours in the United States and beyond.\n\nThe @Fmohnigeria recognizes the major role Nigerian healthcare professionals in the Diaspora can play towards strengthening the healthcare system in Nigeria and are therefor placing increased attention to Diaspora engagement.\n\nA key programme aimed at crystallizing this initiative is the Healthcare professional in the Diaspora (HPD) engagement programme, which is being expanded for sustainability.  As previously mentioned, we are in the process of setting up an active and interactive Dashboard, which will include a database of Nigerian Health Professionals in the Diaspora for ease of engagement and interaction.\n \nWe want to reinvigorate previous efforts and processes, fully engage the health professionals in diaspora and transfer skills and knowledge to home-based healthcare professionals in a more robust and sustainable manner. \n\nI extend my gratitude to the ANPA leadership team and its members for the interest being shown in giving back to Nigeria in the areas of medical services, capacity building and remittances to improve the economic situation of our dear country.",
    "likes": 7,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1803903452114022901",
    "url": "https://x.com/DrTunjiAlausa/status/1803903452114022901",
    "created_at": "Thu Jun 20 21:31:12 +0000 2024",
    "text": "I’m pleased to be attending this year’s Association of Nigerian Physicians in the America’s (ANPA) Annual Convention &amp; Scientific Assembly in California. I look forward to engaging with Nigerian Medical professionals in the diaspora. https://t.co/Oqcbaf7s00",
    "likes": 12,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1799405537706098969",
    "url": "https://x.com/DrTunjiAlausa/status/1799405537706098969",
    "created_at": "Sat Jun 08 11:38:06 +0000 2024",
    "text": "To round up the day, I joined my dear friend and sister, @Adejoke_O_A , to commission the new Nursing hostel at National Orthopaedic Hospital Igbobi, Lagos @nohlagos. \n\nThe newly built 36-bed hostel is equipped with en-suite bedrooms, kitchenettes, common rooms with flat-screen TVs with DsTV, Internet, and will house over 120 female nursing students.\n\nTo top it off, the @ossap_sdgs, under the leadership of our formidable President, @officialABAT has also committed to building a second hostel for Igbobi and a hostel for the students at Federal Neuro-Psychiatric Hospital Yaba. These hostels will surely help to reach the Federal Government’s goal of producing 120,000 nurses annually.\n\nAs my dear sister said, the youth are our future; we must continue to encourage them and build safe, nourishing environments for them to grow, think, and become good contributors to society.\n\nUnder the leadership of President Bola Ahmed Tinubu, change has already begun. Everything in life is a process, but rest assured with the foundations we are laying during this tenure, Nigeria’s future will be bright and sustainable. \n\n#RenewedHope \n#nigeria \n#health",
    "likes": 13,
    "retweets": 5,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1799352915460489567",
    "url": "https://x.com/DrTunjiAlausa/status/1799352915460489567",
    "created_at": "Sat Jun 08 08:09:00 +0000 2024",
    "text": "Yesterday, I was pleased to join Mr. @jidesanwoolu, Governor of Lagos State; @drobafemihamzat , Deputy Governor of Lagos State; HE Princess @Adejoke_O_A, OFR, OSSAP-SDGs; and @ProfAkinAbayomi, Commissioner of Health for Lagos State, at the opening of the new Sickle Cell Care Centre at LASUTH.\n\nEach year, roughly 150,000 babies are born with Sickle Cell in Nigeria. Sickle Cell disease has grown to be one of the largest Non-Communicable Diseases (NCDs) affecting Nigerians and their families in the country and in the diaspora.\n\nThe multi-bed care centre will act as a one-stop shop for all children and adolescents living with Sickle Cell disease and their families to get the treatment and support needed to cope with this heart-wrenching disease.\n\nThe Federal Government, under the leadership of President Bola Ahmed Tinubu GCFR @officialABAT, is extremely dedicated to increasing Nigerians' access to proper and safe healthcare, especially those suffering from Sickle Cell disease, as millions of Nigerians carry the gene.\n\nThe opening of LASUTH’s new Sickle Cell Care Centre, donated by our formidable @ossap_sdgs, shows her and @followlasg commitment to achieving Mr. President’s mandate and vision for the country.\n\nI would like to express my deepest gratitude to my dear sister for her relentless commitment to facilitating the delivery of exceptional healthcare and infrastructure to our communities and, in turn, the country. Her noble deeds and life-saving efforts are truly appreciated and do not go unnoticed.\n\nWe are moving forward in Nigeria 🇳🇬.",
    "likes": 19,
    "retweets": 7,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1799127655863763062",
    "url": "https://x.com/DrTunjiAlausa/status/1799127655863763062",
    "created_at": "Fri Jun 07 17:13:53 +0000 2024",
    "text": "I was filled with immense pride as I gave the opening remarks at the Matriculation Ceremony of the inaugural cohort of the National Diploma in Nursing at National Orthopaedic Hospital Igbobi @nohlagos \n\nThe decision to establish the College of Nursing Sciences was taken during my tenure as the Chairman of the Igbobi’s Board in March 2022, when we collectively recognised the need to enhance the quality and quantity of Nigeria’s Nursing workforce. It’s truly amazing how two years later we can begin to see the outcome of our efforts.\n\nAs part of Mr President @officialABAT’s mandate to restructure the healthcare system and replenish our workforce, we are working hard to push the output of nurses from 20,000 to 120,000. \n\n#Nurses are the back bone of healthcare sector. The profession embodies the spirit of compassion, dedication and resilience and unwavering commitment to care for others. I urge our new graduates to imbibe the spirit  of the profession and not only seek material gain. \n\nCongratulations again to all the new graduates and welcome to the healthcare workforce.",
    "likes": 15,
    "retweets": 4,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1798984856824893769",
    "url": "https://x.com/DrTunjiAlausa/status/1798984856824893769",
    "created_at": "Fri Jun 07 07:46:28 +0000 2024",
    "text": "Six months ago, I asked Prof Babatunde Salako, DG of NIMR if he could house the National Health Research Committee (NHRC) at @nimrnigeria. Yesterday, at the commissioning of the Human Virology and Genomics facility, I can happily say he delivered on my ask. \n\nI would like to take this time to applaud Prof Babatunde Salako for his commitment to the betterment of our country’s #research prowess and taking NIMR to the next level during his eight year tenure as DG. I also applaud his team of researchers for their dedication to improve Nigeria’s health indices. \n\nWith this new office, NHRC can stay close to the heart of their cause, and continue working towards guiding and supporting research initiatives that align with our national health priorities, enforcing standards, transparency and accountability when conducting research studies in Nigeria, and ultimately breathe new life into Nigeria’s research sector.\n\nAgain, I extend thanks to Prof Babatunde Salako and his team for creating a space for the NHRC at their institution. Collaboration is the key to our success.\n\n#nigeria #research",
    "likes": 30,
    "retweets": 8,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1798782656936567206",
    "url": "https://x.com/DrTunjiAlausa/status/1798782656936567206",
    "created_at": "Thu Jun 06 18:22:59 +0000 2024",
    "text": "Today I was pleased to commission the National Institute of Medical Research (NIMR)’s Human Virology and Genomics facility. \n\nSince it’s inception, NIMR has dedicated its resources towards improving the country’s ability to research, detect and survey public health diseases, and train researchers to develop the necessary skills and equipment to combat them.\n\nThe facility which has an international ISO 15189 accreditation houses multiple laboratories for immunology, histology, molecular research, sample and sequencing prep and more. I’m confident that this facility  will propel @nimrnigeria to become a powerhouse for genomics and precision medicine in Nigeria, cater to cutting edge research for endemic public health diseases and in turn shape the country into a hub for medical research, in line with President @officialABAT GCFR’s vision. \n\nDuring the ceremony, I was also delighted to see NIMR’s locally made, cost-efficient and highly effective #Hepatitis B (HBV) qPCR test kit as well as other test kits and products they’ve produced. Once on the market, the HBV test kit will aid to reduce morbidity and mortality rates accrued by HBV. \n\nMr President’s goal is to re-shape the economy to create a stable and sustainable market where Nigerian manufacturers can thrive. With this new kit, I can happily say NIMR is making great strides to achieve this vision. \n\nI’m eager to see the outputs of NIMR’s new facility and will work tirelessly to ensure their  HBV qPCR kit is @NafdacAgency certified and approved for use, so it’s available to those in need.",
    "likes": 6,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1798441894378197340",
    "url": "https://x.com/DrTunjiAlausa/status/1798441894378197340",
    "created_at": "Wed Jun 05 19:48:55 +0000 2024",
    "text": "In recent years, we have witnessed an alarming rise in the burden of cancer both globally and within Nigeria. This growing health crisis underscores an urgent need to move beyond conventional treatment paradigms.\n\nToday, I was pleased to open the “Discover, Innovate, and Collaborate” symposium on #cancer genomics, precision oncology care, and precision community health for Black populations. The occurrence of this event marks our progress towards a future where cancer care is truly personalized, where every life is valued, and every patient’s story is one of hope and triumph.\n\nIt is therefore imperative, that we embrace precision #oncology care and understand the genetic and molecular landscapes of cancers in African Black populations, which will enable the development of more effective, less toxic treatments. Precision community health will also ensure that these advancements equitably reach our populations, bridging gaps in care and fostering healthier communities.\n\nAs a nation, we have to foster collaborations with esteemed institutions, both locally and internationally to advance this cause. By pooling our resources, expertise, and innovative prowess, we can collectively lead the charge in transforming health outcomes for our communities.\n\nI extend my thanks to Dr Malami of @NicratGov, the @MilkenInstitute, and @CherylWillmanMD @MayoClinic and @JohnsHopkins @HopkinsMedicine for their unwavering dedication to this crucial initiative.",
    "likes": 30,
    "retweets": 13,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1797929776549630236",
    "url": "https://x.com/DrTunjiAlausa/status/1797929776549630236",
    "created_at": "Tue Jun 04 09:53:57 +0000 2024",
    "text": "In our quest to reduce Antibiotic resistance, the Federal Government has inaugurated a Sterring Committee to develop the Nigeria National Prescription Policy, in line with the 3rd edition of the National Drug Policy. \n\nThe policy will provide the framework healthcare workers use to ensure rational prescribing and dispensing of medicine. To cut down on quackery, going forward, prescriptions will be issued on standardised forms in line with international best practice and the interest of the patient. \n\nOnce the committee completes their tasks by the end of the year, the policy implementation will commence the following year.\n\nPresident Bola Ahmed Tinubu, @officialABAT GCFR’s vision for the country is to ensure every Nigerian is healthy and has access to safe and affordable medicines. With this policy, we are one step closer.\n\nI extend thanks to the chairperson and committee members for taking up the mantle to ensure our vision for a better Nigeria comes to pass. \n\n#healthcare #Nigeria #policy",
    "likes": 7,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1796132603470213454",
    "url": "https://x.com/DrTunjiAlausa/status/1796132603470213454",
    "created_at": "Thu May 30 10:52:37 +0000 2024",
    "text": "I’ve had a great time attending this year’s @GITEXAfrica Morocco’s Digital Summit 2024, meeting the Lagos delegate’s and discussing with key stakeholders and my fellow Ministers from African countries present. \n\nTo round up, I’ll be joining a panel session this morning looking at  “Unlocking Opportunities in African Healthcare, exploring burgeoning investment prospects in African healthcare, necessitating cross-sector partnerships and interventions to overcome existing challenges. \n\nIf you’re at the conference, be sure to attend and bring your questions.",
    "likes": 8,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1795154572186472699",
    "url": "https://x.com/DrTunjiAlausa/status/1795154572186472699",
    "created_at": "Mon May 27 18:06:17 +0000 2024",
    "text": "I’d like to commend the Medical Laboratory Science Council of Nigeria (MLSCN) on their 11th induction and oath-taking ceremony of Foreign trained Medical Laboratory Science Graduates and constantly engaging with the Federal Ministry of Health and Social Welfare @Fmohnigeria as we continue to push for the necessary paradigm shift in the health sector. \n\nThe induction of these 396 foreign graduates is a crucial step in the efforts of government, to ramp up the training and recruitment of competent, skilled, and versatile manpower for the health sector. It is more gratifying that you do not merely induct new entrants into your profession because they trained abroad, but rightly subject them to a re-training program and subsequent examinations in-country.\n\nIn line with the Renewed Hope agenda of President Bola Ahmed Tinubu, GCFR, @officialABAT the federal government is in a hurry to reposition the health sector to bring it at par with its peers in other countries, especially those we often seek to benchmark. \n\nThe current health professional to general public ratio of 300,000: 200 Million, and the $2 billion spend of our foreign reserves on health tourism is neither acceptable nor sustainable. Therefore, all hands must be on deck to ensure a better narrative and outcome for the health sector.\n\nWhile 396 new graduates is not enough to fill the existing gaps, I encourage the inductees to contribute their quota toward repositioning the health sector. As young Nigerians in whose hands the future of the health sector lies, you must imbibe the spirit of patriotism and always place the interest of the patients above material gains.\n\nI extend thanks to the leadership and team of @MedLabNigeria \n\nhttps://t.co/Ujix9yira2",
    "likes": 8,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1791401246114316709",
    "url": "https://x.com/DrTunjiAlausa/status/1791401246114316709",
    "created_at": "Fri May 17 09:31:54 +0000 2024",
    "text": "Following our meeting with the SGF, Mr @rafaelmgrossi and our teams went to review National Hospital Abuja’s @NatHospital_ABJ cancer radiology bunkers and equipment, some of which were donated by the IAEA.\n\nIt’s unfortunate to say that the few equipment we have available are meant to provide treatment for millions of cancer patients all over the country. Which is far from equitable. That’s why strengthening relationships with organisations like the IAEA and its member countries is imperative. We need a larger quantity of high grade radiology equipment, located in each of our geo political zones to be able to provide enough access to all of those who need it. \n\nI’m grateful to Mr Grossi and his team for taking the time to visit National Hospital Abuja and listen to Prof Mahammad Raji Mahmud, CMD of National Hospital Abuja and his team’s challenges and hopes amidst their busy schedule.\n\n#Cancer4All #FridayMotivation",
    "likes": 13,
    "retweets": 6,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1791172545464471667",
    "url": "https://x.com/DrTunjiAlausa/status/1791172545464471667",
    "created_at": "Thu May 16 18:23:07 +0000 2024",
    "text": "I was pleased to welcome Rafael Grossi @rafaelmgrossi Director General of the @iaeaorg to Abuja, Nigeria, whilst he’s here for the high-level regional seminar on promoting cancer awareness and advocacy programmes for the African member states of the OIC.\n\nAfter we opened the seminar, we paid a courtesy visit to Sen. Dr George Akume , Secretary to the Government of the Federation, where the IAEA shared their plans to support their member states with procuring more radiology equipment in line with their Rays of Hope initiative.",
    "likes": 18,
    "retweets": 10,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1791047311746855069",
    "url": "https://x.com/DrTunjiAlausa/status/1791047311746855069",
    "created_at": "Thu May 16 10:05:29 +0000 2024",
    "text": "Good morning everyone,\n\nToday I’ll be on @NTANewsNow at 11AM speaking about the progress we’ve made towards Mr President’s @officialABAT Renewed Hope Agenda for #Health . https://t.co/xiDFCKNP7E",
    "likes": 4,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1790800277185892638",
    "url": "https://x.com/DrTunjiAlausa/status/1790800277185892638",
    "created_at": "Wed May 15 17:43:52 +0000 2024",
    "text": "Today marked the opening of the two-day High-level Regional Seminar on Promoting Cancer Awareness and Advocacy Programmes for the member states of the organisation of Islamic cooperation (OIC) . \n\nThe high-level seminar hosted by our steadfast First Lady, Her Excellency Senator Oluremi Tinubu @SenRemiTinubu of the Federal Republic of Nigeria aims to promote cancer awareness, advocacy and access to and the affordability of cancer treatment. It features a range of topics and sessions designed to improve the capacity of technical partners as we support various governments and institutions.\n\nThe First Lady’s gesture is a testament to an uncommon commitment and people-oriented leadership of His Excellency, Bola Ahmed Tinubu, GCFR  @officialABAT who has passionately demonstrated a rare zeal to transform the health sector, especially cancer care through his Renewed Hope agenda.\n\nNever in Nigeria’s history has a large variety of international, national, public and private stakeholders come together to address our collective challenges against cancer. \n\nI extend my thanks and appreciation to the First Lady Senator Oluremi Tinubu , African First Ladies of the OIC Member States,  Dr Zainab Shinkafi-Bagudu, @DrZSB Chair of Nigeria’s First Ladies of Against Cancers (FLAC) @FlacNigeria, @Roche , @JNCILtd, and other key stakeholders for championing awareness creation and early detection, this will go a long way in increasing advocacy which will improve funding for cancer care at national and international levels.",
    "likes": 27,
    "retweets": 12,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1790495678658953618",
    "url": "https://x.com/DrTunjiAlausa/status/1790495678658953618",
    "created_at": "Tue May 14 21:33:30 +0000 2024",
    "text": "This week’s Federal Executive Council approved key initiatives that will spur sustainable progress for Nigeria\n\nToday, the President @officialABAT has mandated for the country to migrate towards cleaner and renewable energy sources such as solar and compressed natural gas (CNG). With climate change impacts and rising fuel costs, the President sees the imperative need for better energy sources to reduce carbon emissions, which grossly impact the health and welfare of Nigerians.\n\nIn lieu of this, the Minister of Power will be developing tools and programmes to encourage outside investments for the development of solar panels and batteries which we hope will sustainably shape the market. \n\nIn line with the President Renewed cities project which aims to provide 50,000 units of homes across the country, FEC also approved a private-public partnership (PPP) based initiative that will transform the nation's infrastructure and housing sector.\n \nThe initiative will unlock private-sector funds, which Nigerians can access for 25-year mortgages at low interest rates and meet the urgent demand for critical infrastructure and affordable homeownership. It will also foster job creation, inclusive growth, and long-term productivity enhancement.\n\nBy collaborating with more private sector institutional investors, the President Tinubu-led government seeks to leverage the expertise and capital to accelerate the delivery of vital projects, driving sustainable development and economic progress for all Nigerians.",
    "likes": 11,
    "retweets": 2,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1790110757083922897",
    "url": "https://x.com/DrTunjiAlausa/status/1790110757083922897",
    "created_at": "Mon May 13 20:03:57 +0000 2024",
    "text": "It was my esteemed pleasure to open the first coordinating meeting of the International Atomic Energy Agency (IAEA) RAF 6060 and RAF 9070 technical support projects here in Abuja today. \n\nThe IAEA’s projects mark a significant milestone in our collective efforts to enhance the capacity and skills of our health professionals to deliver efficient and quality cancer care in Nigeria and across the continent. It also allows us to leverage expertises resources and best practices build an expert workforce for cancer care that will in turn enhance population health.\n\nWith the growing rate of cancer and majority of Africans living without sufficient power supply it is high time, African countries work together as a continent to deliver for our people and catch up to the rest of the world.\n\nI would like to extend thanks to the International Atomic Energy Agency (IAEA) @iaeaorg represented by Prof Shaukat Abdulrazaq, for their commitment to improving cancer care, safe energy use and capacity building Africa and Dr Malami, DG NICRAT @NicratGov , Prof Yusuf  Aminu Ahmed, AFRA National Coordinator, for organising this meeting. \n\nI’d also like to thank the participants for attending this event. I wish you faithful deliberations and look forward to the outputs from both projects.",
    "likes": 13,
    "retweets": 7,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1789259106286534677",
    "url": "https://x.com/DrTunjiAlausa/status/1789259106286534677",
    "created_at": "Sat May 11 11:39:48 +0000 2024",
    "text": "This week, I addressed the press on the Federal Ministry of Health and Social Welfare’s @Fmohnigeria Malaria elimination strategy and the state of the healthcare sector. \n\nIn my conversations, I made reference to our sector no longer being in crisis in regards to medical migration and the operational capacity of our federal healthcare centres and facilities.  \n\nI can confidently say that since HE President Bola Ahmed Tinubu GCFR  @officialABAT began his tenure and Prof Pate @muhammadpate and I commenced our Ministerial duties, we have created some stability in the sector. We have done in house cleaning to ensure our parastatals, agencies and federal institutions our better equipped, managed and run. As stated in pillar one, governance, of our 4 point agenda. \n\nRegarding the rise of pharmaceuticals and medical consumables, we have developed an executive order, pending signature from Mr President that will shape the market, create room for local manufacturing which in turn will help to recuse the price of said consumables and further unlock our healthcare value chain. \n\nWe are also working on a holistic package for our healthcare workers, especially those that are yet to graduate and enrol into university. This package will ensure they are well trained, compensated and fulfilled in their roles.\n\nThat being said, I am very aware that a lot more needs to be done, but we are on the right path. We are not building a healthcare system for 1 person, we are building a sustainable system for all 200 million Nigerians. You deserve the best healthcare and we are working tirelessly to ensure you receive it. \n\nClick the links below to watch the full interviews. \n\nArise: https://t.co/iS9OK7BlxQ\n\nChannels: https://t.co/DyXxNIB8Fl",
    "likes": 16,
    "retweets": 5,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1787537835601375325",
    "url": "https://x.com/DrTunjiAlausa/status/1787537835601375325",
    "created_at": "Mon May 06 17:40:05 +0000 2024",
    "text": "Tomorrow morning I’ll be live on @channelstv’s Morning Show to discuss the @Fmohnigeria progress with our 4-point agenda, the state of the healthcare sector, increasing healthcare industrialisation and more. \n\nSee you tomorrow morning! https://t.co/KeKwbDO4P2",
    "likes": 16,
    "retweets": 4,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1787186044934271033",
    "url": "https://x.com/DrTunjiAlausa/status/1787186044934271033",
    "created_at": "Sun May 05 18:22:12 +0000 2024",
    "text": "Hi Everyone,\n\nFollowing Friday’s successful Ministerial Roundtable on Malaria, I’ll be joining Charles Aniagolu, host of @ARISEtv’s Prime Time show live at 8PM tomorrow to discuss the FMOH&SW’s next steps and our malaria elimination strategy, the current state of our healthcare system and more. \n\nBe sure to tune in!",
    "likes": 14,
    "retweets": 4,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1786828328353055075",
    "url": "https://x.com/DrTunjiAlausa/status/1786828328353055075",
    "created_at": "Sat May 04 18:40:45 +0000 2024",
    "text": "Yesterday, key in country and international stakeholders sat down to Rethink Malaria Elimination in Nigeria.\n\nCurrent data shows about 60% of all our hospital attendance in Nigeria to be about  malaria, contributing about 25 – 30% to childhood mortality. There is hardly any aspect of our daily lives that is not affected by malaria.\n\nAlthough efforts have been made to reduce its prevalence, Malaria remains a considerable burden in the country. That’s why it was imperative that we held this stakeholder round table. \n\nInstead of “Business as Usual”, it’s high time we review our past and current strategies and approaches, fine-tune some tools, and introduce new ones for a better outcome. \n\nUnder the leadership of HE President Bola Ahmed Tinubu GCFR @officialABAT, we are determined to scale up all interventions that added value in the past and bring on board new interventions that will facilitate Malaria elimination in Nigeria. Some of which have been outlined in a 9-part strategy by my colleague Prof Pate @muhammadpate. \n\nI extend thanks to all our Stakeholders present yesterday and our development partners, speakers and panellists i.e. @moei, @endmalaria, @PMIgov, @WHO, @DrTedros, @gavi @GlobalFund Solina, CHAI and @DangoteGroup to name a few, for sharing your honest and invaluable perspectives on Nigeria’s current situation and a path forward. \n\nI would also like specially thank Dr Ntandom, and his team at @NMEPNigeria and the FMOH’s Public Health department for a successful event.",
    "likes": 24,
    "retweets": 13,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1786381121434923155",
    "url": "https://x.com/DrTunjiAlausa/status/1786381121434923155",
    "created_at": "Fri May 03 13:03:43 +0000 2024",
    "text": "As part of today’s activities, I’m leading two panel sessions with our development partners. The first session topic asks “How do we fast track Malaria?”\n\nHere are a few answers from the panellists: \n\n•Utilise health information, collect quality data for surveillance etc.\n•Establish Malaria quality Standards that can be used in Machine learning \n•Establish a Mutual Accountability framework \n•Increase and diversify Malaria partnerships \n•Align our approach on Malaria elimination from Global to country level\n•Look at other opportunities I.e harness climate change initiatives and funding\n•Include Malaria Elimination in the country’s vision and national development plan\n•Ensure the Strengthening of the Public Administration \n•Invest in human capital and push forward with the One health approach\n•Utilise traditional and cultural leaders to educate the masses",
    "likes": 1,
    "retweets": 0,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1786373463948558627",
    "url": "https://x.com/DrTunjiAlausa/status/1786373463948558627",
    "created_at": "Fri May 03 12:33:17 +0000 2024",
    "text": "Our country is on the verge of sustainable development, and on the right trajectory for delivering efficient healthcare to our citizens. \n\nTo shed more light on the FMOH&SW’s initiatives in line with President Bola Ahmed Tinubu’s mandate on health, watch my conversation with Dr Dayo Ajibade @dr_davidajibade , the host of @NTANewsNow’s Your Health in Your Hands segment as we discuss   Implementing better standards at our Hospitals and Centres, improving Community Engagement, Lassa Fever, Sickle Cell, Health insurance and more. \n\nThe segment airs tomorrow,  Saturday 4th May at 11 PM on NTA.",
    "likes": 6,
    "retweets": 2,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1786359776756093431",
    "url": "https://x.com/DrTunjiAlausa/status/1786359776756093431",
    "created_at": "Fri May 03 11:38:54 +0000 2024",
    "text": "Live at the Ministerial Roundtable on Rethinking Malaria Elimination in Nigeria https://t.co/gCTyVXGBcu",
    "likes": 12,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1785374966520647978",
    "url": "https://x.com/DrTunjiAlausa/status/1785374966520647978",
    "created_at": "Tue Apr 30 18:25:37 +0000 2024",
    "text": "Biotechnology holds immense promise for the advancement of healthcare, agriculture, environmental sustainability, and various other sectors. It has the potential to revolutionize our method of approach to challenges and provide effective solutions if harnessed in a responsible and safe manner.\n\nI was pleased to attend the Biotechnology and Biosafety Stakeholders forum today, aiming to discuss the influence and benefits of Genetically Modified crops and animals on farming, crop production and food scarcity.\n\nIn adherence with the Federal Ministry of Health and Social Welfare 4-point agenda, we are going to collaborate synergistically with the Federal Ministry of Environment, Federal Ministry of Agriculture and Food Security (FMAFS), National Biotechnology Development Agency (NABDA) and National Biosafety Management Agency (NBMA) to push forward the “One Health” Approach, which favours an integrated, unifying approach to sustainably balance and optmise the health of people, animals and ecosystem, as they are closely linked and interdependent.\n\nNigeria can only become a food secure nation and by implication, Africa’s ‘Blue Zone’, if we adopt modern technologies to enhance the way we produce our food – which is at the core of the Renewed Hope Agenda of HE President Bola Ahmed Tinubu, GCFR @officialABAT \n\nIn order to become Africa’s Blue Zone, it is important that we change the narrative of GMO crops. Since its introduction over 30 years ago, over 2,000 studies have been conducted to evaluate the health and related aspects of genetically engineered products. These studies have found nothing to indicate that GM foods possess a health threat and predispose humans to higher health risk than conventional foods. \n\nBiotechnology presents the healthcare sector with boundless opportunities for the development of novel therapies, diagnostics, and preventive measures. By embracing biotechnological advancements, we can work towards addressing pressing public health challenges and improving the well-being of our citizens.\n\nThe @Fmohnigeria is committed to supporting and advancing the safe and responsible application of biotechnology in our healthcare system and eager to collaborate with all stakeholders to develop policies and regulations that promote innovation while safeguarding public health and environmental integrity.\n\nIt’s time we work together to pave the way for a future where biotechnology and biosafety work hand in hand to create a healthier, more sustainable, and prosperous society for all Nigerians.",
    "likes": 7,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1783615909061353754",
    "url": "https://x.com/DrTunjiAlausa/status/1783615909061353754",
    "created_at": "Thu Apr 25 21:55:45 +0000 2024",
    "text": "In honour of  #WorldMalariaDay, I’d like to call all everyone to join me in taking a stance against malaria.  \n\nMalaria is still a major public health challenge for our country, with rising morbidity rates each day, but under the leadership of HE President Bola Ahmed Tinubu, we are determined to reduce the burden to an insignificant level and finally eliminate it from our shores.\n\nOur resolve is evident in @FMoHsW’sin our 4-point agenda, particularly pillar 3 of unlocking the value chain to increase local industrialisation and the ongoing implementation of the National Malaria Strategic Plan 2021-2025 via the National Malaria Elimination Program which aims to:\n\n1. Improve access and utilization of vector control interventions to at least 80% of targeted population by 2025.\n2. Ensure provision of chemoprevention, diagnosis and appropriate treatment for 80% of the target populations at risk by 2025.\n3. Improve generation of evidence for decision making and impact through reporting of quality malaria data and information from at least 80% of health facilities (public and private) and other data sources including surveillance, surveys and operations research by 2025.\n4. Strengthen coordination, collaboration, and strategic partnership to promote efficiency and effectiveness of malaria control activities towards achieving at least 75% improvement from baseline using a standardized OCA tool.\n5. Improve funding for malaria control by at least 25% annually through predictable and innovative sources to ensure sustainability at federal and sub-national levels.\n\nOur overall goal is to reduce parasite prevalence of less than 10% and reduce malaria mortality to less than 50 deaths per 1,000 livebirths by 2025. \n\nWe are still on the path to meet the Global technical strategy for Malaria 2030 (GTS) and achieve Sustainable Development Goal (SDG) 3.3, calling to end epidemics of malaria and other communicable diseases by 2030.\n\nAs previously mentioned, following my trip to Cameroon earlier this year, the FMOH will be  hosting a Rethinking Malaria Elimination Event next week to conclude on our strategies to implement Malaria in our SWAP programme, unlock the treatment value chain and further discuss how to fast track the elimination of Malaria. \n\nEradicating Malaria in all 36 states will take time but if we all start taking the necessary steps to prevent it and protect ourselves, we are one step closer to eradication. \n\n#ZeroMalariaStartsWithMe and it can start with you too.",
    "likes": 14,
    "retweets": 6,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1783557076968509832",
    "url": "https://x.com/DrTunjiAlausa/status/1783557076968509832",
    "created_at": "Thu Apr 25 18:01:58 +0000 2024",
    "text": "In 2022, the estimated number of new #cancer cases in Nigeria was 127,763 with 79,542 deaths. With an expected increase of 77% and deaths to double by the year 205, increasing Nigerians access to effective cancer treatment and diagnostic tools is a key focal point within the @Fmohnigeria’s 4-point agenda. \n\nI was pleased to open the Nigerian-Siemens HealthIneers Systems workshop today, hosted by the National Institute for Cancer Research and Treatment (NICRAT), aimed at improving cancer care outcomes in the country.\n\nCross sectoral collaboration with key stakeholders, healthcare professionals, and NGOs is imperative to the success of HE President Bola Ahmed Tinubu GCFR’s @officialABAT mission against cancer.\n\nThe Federal Ministry of Health and Social Welfare, through NICRAT is determined to work with all relevant stakeholders to change the narrative on cancer care in Nigeria through intense awareness creation and improved access to treatment and research.\n\nFollowing the launch of our three cancer strategic policy documents last year, we are proceeding with the below strategies to improve cancer care:\n1.Geometrically increasing cancer experts in the country through training and re-training of all categories of healthcare professionals.\n2.Improving the administration and management of the cancer health fund in Nigeria.\n3.Forging impactful partnerships with International Atomic Energy Agency (IAEA), to optimize capacity building for cancer care in Nigeria. \n4.Upgrading 6 cancer centres of excellence for treatment and 8 centres for cancer diagnosis.\n\nThe beginning of this collaboration between the FMoH&SW and Siemens is further proof of the renewed commitment and readiness of the government to reduce cancer prevalence and Seimens dedication to support the implementation of the National Cancer Control Plan 2023-27. \n\nOur hope is that this workshop addresses challenges and key priority areas of cancer care in Nigeria and explores avenue for collaborations. \n\nI extend thanks to our partners from @SiemensHealth, and Dr Malami, DG of @NicratGov for taking the time to host this innovative workshop and look forward to sharing the outputs from the workshop.\n\nTogether we can improve cancer care in Nigeria.",
    "likes": 16,
    "retweets": 4,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1783213902215381492",
    "url": "https://x.com/DrTunjiAlausa/status/1783213902215381492",
    "created_at": "Wed Apr 24 19:18:19 +0000 2024",
    "text": "In honour of National Safe Motherhood Day, we proudly launched the Guidelines for the Management of Postpartum hemorrhage (PPH), including the usage of misoprostol and calibrated drapes, at the community and health facility level.\n\nPostpartum haemorrhage, Preeclampsia/Eclampsia, and unsafe abortions account for 55 per cent of maternal mortality cases in Nigeria. With these guidelines we’ll be able to radically reduce the rate of maternal and newborn morbidity and mortality. \n\nI echo my brother Prof Pate’s sentiments calling all stakeholders to action. Too many women and families have been lost to preventable health conditions.\n\nUnder the Administration of HE President Bola Ahmed Tinubu GCFR @officialABAT, the @Fmohnigeria Is committed to putting the Nigerian people, especially our women and girls at the focal point of all initiatives, ensuring that all policies and investments improve the well-being of our citizens.\n\nI extend thanks to the Safe Motherhood Sub-TWG and its partners, both National and global for their efforts and dedication. \n\nLet’s continue to work together establish a future where every mother and newborn receives the care and support they need when and where they need it.",
    "likes": 5,
    "retweets": 4,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1776302254846304699",
    "url": "https://x.com/DrTunjiAlausa/status/1776302254846304699",
    "created_at": "Fri Apr 05 17:33:54 +0000 2024",
    "text": "Research serves as the cornerstone of society and is essential for scientific progress. To revitalize our healthcare sector, it’s crucial to prioritize the creation of a conducive environment for medical and clinical research.\n\nI was pleased to meet a group of experts from the University or Chicago, Professor Alex Pearson and  Professor Birali Runesa, working with Nigerian doctors to train Nigerians on Data Science and Medical Image Analysis (DATICAN). \n\nDATICAN is a NIH funded project led by Professor Aribisala, Lagos State University, aimed at training 72 graduates and postgraduates. The programme is currently being implemented in University of Chicago, Lagos State University, University of Ibadan and Redeemer’s University. At the end of the course, enrolled participants will get MSc or PhD degree and a certificate of participation.\n\nTo expand their impact, DATICAN is collaborating with the Growing Data Science Research in Africa to stimulate Progress (GRASP) to train a further 1000 graduate students and postdocs in data-intensive health research, over a 5 year period. Initiated by Professor Olopade, NHRC Chair, the GRASP & DATICAN program will last for 10 months and be implemented at 6 institutions across the country (2x east, 2x north, 2x south). \n\nIn line with Mr President’s mandate to make Nigeria a hub for medical and health research, I have recommended other institutions in the country i.e, University of Maiduguri, FMC Nguru, Birin Kebbi , Abu Zaria, UNTH , Uyo Teaching Hospital , FMC Jabi and National Hospital Abuja, to host the data science training program in addition to UCH and LASUTH. \n\nUnder my leadership with support from Prof Pate, the FMOHSW will support the GRASP & DATICAN project to train the 1000 students by providing High Processing Computers (HPC) for the students which will be housed at NICRAT for continuity and to support the cancer registry being established at NICRAT. \n\nUnlocking the research value chain and promoting clinical research and development is a pivotal pillar in our 4 point agenda that’s vital to the success of the health system rejuvenation. The ministry is aware of the many issues affecting research undertaking in the country. That’s why we are implementing short to longterm solutions to help address the energy crisis in hospitals by providing infrastructure for solar power and challenges with Visa applications. Regarding grants and funding, Prof Pate and I with full support from Mr President are working on a Health Research Fund that will be dedicated to meeting our health research needs. \n\nI extend thanks to Prof Aribisala, Prof Olapade, Professor Alex Pearson, Professor Mayowa Owolabi and Professor Birali Runesa. I look forward to working with you to support healthcare and medical professionals.",
    "likes": 12,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1775989104167039311",
    "url": "https://x.com/DrTunjiAlausa/status/1775989104167039311",
    "created_at": "Thu Apr 04 20:49:33 +0000 2024",
    "text": "Nigeria’s large human capital is one of the country’s greatest assets, if appropriately utilised.\n\nFollowing the discussion I had with over 400 Diaspora Nigerian medical professionals in February, I met with Honourable Dr Abike Dabiri, CEO of Nigerians in Diaspora Commission (NiDCOM) @nidcom_gov and her team to discuss our plans to engage and find opportunities for diaspora health professionals to provide their services.\n\nWe had a fruitful discussion centred around restructuring former established Diaspora initiatives, i.e., Pride and Prime, to suit Mr President’s current mandates for the Ministry, the interactive dashboard we’ll be implementing and various other activities. \n\nIn line with Pillar 1 of the @Fmohnigeria 4 point agenda, Effective Governance, we’ve agreed to work with established institutions such as the Association of Nigeria Physicians in the America’s (ANPA) and the Medical and Dental Council of Nigeria (MDCN) to properly vet the professionals we enlist. It is imperative that we cap down on the level of quackery in the country. \n\nEffective collaboration across both public and private institutions is the only way we can combat our medical brain and provide our medical teachers, students and existing professionals with the support and training they need to succeed and rebuild the healthcare system. \n\nAs promised, we’ll be hosting our next open discussion with healthcare professionals in the diaspora in June. Please look out for information on the event, which will be shared closer to the time. \n\nI extend thanks to Dr Abike Dabiri for her service and dedication to Nigeria. She is an expert in her field with years of experience working with medical professionals in the diaspora. I look forward to working with her and her team to create better opportunities and training programmes for healthcare professionals.",
    "likes": 21,
    "retweets": 7,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1774010496338829319",
    "url": "https://x.com/DrTunjiAlausa/status/1774010496338829319",
    "created_at": "Sat Mar 30 09:47:16 +0000 2024",
    "text": "It was a pleasure to welcome my brother Senator Ademola Adeleke @AAdeleke_01, Governor of Osun State and his entourage to Abuja. \n\nSince his appointment Governor Adeleke and his team have been working tirelessly to improve the healthcare and welfare of the people of @Osun_State_Gov. Aligning well with Mr President @officialABAT’s Sector Wide Compact, mandating all State Governors to actively support and collaborate with the FMOHSW to ensure all Nigerians have access to safe and efficient healthcare services.\n\nIn support of the @Fmohnigeria’s aim to tackle medical migration, Adeleke University has also agreed to increase their intake quota for medical students to 250 this year. Increasing  the enrolment quota’s at our universities is just one step in our series of approaches to produce and retain healthcare professionals in the country.\n\nI extend thanks to the Governor for his dedication and look forward to working with him and his team. Under his leadership, I know the people of Osun will be well taken care of.",
    "likes": 13,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1773648060272226788",
    "url": "https://x.com/DrTunjiAlausa/status/1773648060272226788",
    "created_at": "Fri Mar 29 09:47:05 +0000 2024",
    "text": "Yesterday we commemorated the appointment of the First Lady, Her Excellence @SenRemiTinubu, CON, as the Global and National Stop Tuberculosis (TB) Champion. @StopTB \n\nTuberculosis is a deadly disease often misdiagnosed and thought to just affect the most vulnerable of our society. \n\nAs it stands, Nigeria has the highest burden of TB in Africa. Although we’ve made great strides to increase TB diagnoses through GeneXpert, referral programmes and increased TB screening, 50% of our health facilities still don’t provide coverage for TB services. Thus leaving a significant number of people vulnerable to this deadly yet treatable disease.\n\nHer Excellency’s appointment as the Global and National Stop Tuberculosis Champion further echoes her commitment to public health and dedication to be apart of programmes focused on the betterment of her countrymen and women; aligning well with President Bola Ahmed Tinubu GCFR’s @officialABAT Renewed Hope Agenda and vision to deliver a healthcare system where every single Nigerian is given meaningful and comprehensive healthcare. \n\nAs stated in Mr President’s sector wide compact, rebuilding our health sector to combat infectious diseases like Tuberculosis, Malaria and HIV/AIDs will take cross sectoral action from the community level all the way to the state and national level. I am confident that with the First Lady as our champion, the State Governors and their wives will be better supported and suited to tackle the healthcare conditions of their constituents. \n\nAdditionally, by unlocking the healthcare value chain through the local industrialisation of pharmaceuticals, diagnostic kits and vaccines, our healthcare providers will better equipped to diagnose and treat TB in Nigeria and soon provide aid to other African countries.\n\nI would like to extend my support to my brother and colleague Prof @muhammadpate in his mission to ensure Nigeria’s efforts to eradicate TB extend further than Nigeria and reaches the global community. \n\nI also extend gratitude to our bilateral partners, @USAID,  @GlobalFund, @CDCgov , the Stop TB Secretariat @LucicaDitiu, as well as my colleagues in the @Fmohnigeria  and the @StopTBNigeria team for their collaborative efforts and resilience to battle TB. Their dedication is what has brought us this far and will propel us to reducing TB prevalence even further in the near future.\n\nOnce again, I warmly congratulate the First Lady, Her Excellency Senator Oluremi Tinubu, CON, on her appointment as the Global and National Stop Tuberculosis (TB) Champion and thank her for taking up this mantle. \n\nIn line with this year’s theme for #WorldTBDay, I wholeheartedly believe that yes we can end TB, but we can only do it together.",
    "likes": 12,
    "retweets": 0,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1773289653837189582",
    "url": "https://x.com/DrTunjiAlausa/status/1773289653837189582",
    "created_at": "Thu Mar 28 10:02:54 +0000 2024",
    "text": "During the WHO’s Malaria Ministerial Conference in Yaoundé, Cameroon, themed “Tackling Malaria in countries hit by the disease”, I spoke to one of the foremost continental TV stations, Africa TV 24 on Nigeria’s Malaria elimination strategies and the various activities we are undergoing to overhaul Nigeria’s Health care system in line with President Bola Ahmed Tinubu renewed Hope Agenda which will ensure that “every single citizen of Nigeria is entitled to a meaningful and comprehensive health care.”\n\nClick on this link to watch the full video: \n\nhttps://t.co/yXVnnazHTB",
    "likes": 7,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1770188088456917346",
    "url": "https://x.com/DrTunjiAlausa/status/1770188088456917346",
    "created_at": "Tue Mar 19 20:38:23 +0000 2024",
    "text": "I had the privilege of leading the unveiling event centered on \"Making Global Fund Investments Work For Nigeria.\" Commencing the event in Lagos State today, we distributed 72 Hilux Project vehicles and medical equipment procured by The Global Fund to enhance efforts against HIV/AIDS, TB, and Malaria.\n\nThe event followed a strategic meeting led by Mark Eddington, Head of Grant Management at The Global Fund’s Country Coordinating Mechanism (CCM), with @ProfAkinAbayomi , Special Advisor to Gov. @jidesanwoolu , Dr (Mrs) Kemi Ogunyemi, Perm Sec of Lagos State MOH Dr Segun Ogboye. \n\nLast year, Nigeria diagnosed over 300,000 tuberculosis (TB) cases. This was the first time in our history of ever recoding such a high number of TB diagnoses, meaning our TB case finding has risen from 24% to 68%.\n\nThe equitable distribution of the equipment and vehicles across the 36 states and FCT will support our National response to HIV/AIDS and Tuberculosis, and state governments' oversight of integrated HIV and TB programs statewide — a critical component of the response strategy.\n\nIn alignment with the National Alignment 2.0 agreement, the Federal Government is aiming to decentralise responsibilities and shift ownership, coordination and management of the national response from us to the states and local government. As it will help to build a more resilient and sustainable system for health in Nigeria. \n\nLagos state has made commendable efforts to reduce HIV/AIDS, TB and Malaria prevalence, but it is time for the other states to follow suit and invest in building capacity to achieve similar success. \n\nInstead of following old patterns, I’m urging State and Local governments to become more flexible and adaptable with their approaches to address emerging challenges. We need better resource allocation, coordination and more effective strategies to eliminate these diseases and achieve our long-term health goals like Universal Health coverage. \n\nThe Global Fund has been and remains a strategic partner to The Federal Republic of Nigeria for over 2 decades. In the past three years, The Global fund had donated 333 units of Quatro TrueNat Machine, 100 units of TB-Lamp machines, 350 units of mobile digital X-Ray machines, 45 units of the Class II Biological Safety Cabinet (BSC) and 2 units of Mobile Chest X- Ray. \n\nIt is imperative that we build sustainable capacity within the country to ensure progress continues even without external support.  In line with our 4 point agenda we are committed to providing the necessary support and complementary funding to ensure availability of HIV tests, including HIV self- testing kits.\n\nThank you @GlobalFund for donating the equipment and supporting Nigeria's response towards ending HIV, TB and Malaria in Nigeria by the year 2030. \n\nWe look forward to working with you on this journey.",
    "likes": 17,
    "retweets": 6,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1768725376031748155",
    "url": "https://x.com/DrTunjiAlausa/status/1768725376031748155",
    "created_at": "Fri Mar 15 19:46:05 +0000 2024",
    "text": "Today marked a pivotal moment in Nigeria’s healthcare landscape. \n\nWe inaugurated the Implementation Committee for Nigeria’s Digital in Health Initiative. A 20-person multi-sectoral committee, comprising of a diverse group of individuals with extensive experience and pertinent skills in digital health, technology, healthcare administration. \n\nDigitalising the healthcare system is one of the key elements to achieving President Bola Ahmed Tinubu GCFR’s vision for the health sector. Having quality data available for use, is a key enabler that also underpins the entire health delivery system’s framework and is vital to the FMOHSW’s 4-point agenda.\n\nThe Implementation Committee will midwife data policy, regulation, repository management and serve as an ombudsman to establish and scale-up of our digital health interventions i.e, a national unified Electronic Medical Record (EMR) platform. \n\nA national EMR system would enable primary, secondary, and tertiary healthcare personnel to manage clinical and administrative data seamlessly across centres and achieve improved quality of care, reduce expenditure and increase staff capacity and productivity.\n\nUtilising existing national digital health policies and frameworks, the committee will be responsible for managing the deployment, architectural design and pilot of the EMR platform, as well as other overarching activities to drive our health digitalisation agenda.\n\nThe EMR platform pilot will initially begin at the federal tertiary hospitals and be implemented in one state per geo-political zone, to gauge its efficiency and accuracy.\n\nThe inauguration of this committee symbolises the strides we are taking towards establishing a national digital healthcare architecture and our steadfast dedication to fulfilling the President’s mandate to deliver Universal Health Coverage (UHC) for all Nigerians and regain our status as a leading nation in health productivity and care delivery. \n\nI extend gratitude to our development partners for their support and collaboration, and my deepest appreciation to the members of the Implementation Committee for Nigeria’s Digital in Health Initiative for accepting this responsibility. Together, I am confident in our ability to create the digital ecosystem we desire.",
    "likes": 26,
    "retweets": 2,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1768200994439979206",
    "url": "https://x.com/DrTunjiAlausa/status/1768200994439979206",
    "created_at": "Thu Mar 14 09:02:23 +0000 2024",
    "text": "Good morning everyone! \n\nAs you might have seen, I joined @tvcnewsng Politics tonight segment yesterday to discuss President Bola Ahmed Tinubu’s Health Agenda, the ministry’s achievements under leadership of myself and Prof Pate in the last 6 months and more.  \n\nFollow the link to watch the interview: \n\nhttps://t.co/pxwejmCIDd",
    "likes": 8,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1767933109658345743",
    "url": "https://x.com/DrTunjiAlausa/status/1767933109658345743",
    "created_at": "Wed Mar 13 15:17:54 +0000 2024",
    "text": "Hello everyone,\n\nI’ll be live on @tvcnewsng tonight, Wednesday 13th March 2024 at 8PM, to discuss the ministry’s quest to achieve President Bola Ahmed Tinubu’s Renewed Hope Agenda for health, our achievements in the last 6 months and more.  \n\nBe sure to tune in! https://t.co/JZbb24Swlq",
    "likes": 8,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1767825371825643826",
    "url": "https://x.com/DrTunjiAlausa/status/1767825371825643826",
    "created_at": "Wed Mar 13 08:09:47 +0000 2024",
    "text": "To round up my trip to Abeokuta, I visited Federal Neuropsychiatric Hospital in Aro, Abeokuta - the first purpose built mental health care hospital in Nigeria. \n\nSince its establishment, FNPH Aro has provided mental healthcare services, residency training, rehabilitation services, community mental health programs for adults, children and adolescents and more. \n\nIn the last decade, FNPH Aro expanded its scope to include General Medical practice and Antenatal care to better serve the community. \n\nDuring my tour, I visited FNPH Aro’s new infrastructures, had an open discussion with the staff to listen to their concerns and see their vision to become a National centre of excellence for Mental Health and Neurosciences.\n\nI extend thanks to Dr Paul Agboola, Provost and Medical Director of FNPH Aro and his staff for the warm reception and look forward to working with him to attain his vision for FNPH Aro.",
    "likes": 9,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1766912722472522107",
    "url": "https://x.com/DrTunjiAlausa/status/1766912722472522107",
    "created_at": "Sun Mar 10 19:43:15 +0000 2024",
    "text": "During my time in Abeokuta, I participated in the 105th Quarterly Meeting of Chief Medical Directors (CMDs) for Federal teaching, Neuropsychiatric, and Specialist Hospitals. The gathering served as a platform for me to actively engage with the dedicated CMDs, lending an attentive ear to their concerns, insights, and invaluable experiences. I also commissioned new medical infrastructures at FMC Abeokuta.\n\nTo the CMDs credit, our federal tertiary institutions have kept the Nigerian health system alive and afloat. Without their leadership, the system would have been far worse than it is now. Which is why the CMDs are essential to the success of the first pillar (Governance) of our 4-point agenda.\n\nWe will ensure this pillar is fully implemented in line with the National Health Act 2014, at all hospitals with support from our National Tertiary Health Institutions Standards Committee. I’ve instructed all CMDs to work hand in hand with the committee in order to strengthen the country’s regulatory capacity and foster the highest standards of service provision.\n\nHealthcare is a business that can stimulate gross employment and positively contribute to the growth of Nigeria’s GDP. To unlock the value chain, we’ve mandated all Federal Hospitals to cease usage and procurement of needles and syringes made outside the country and start purchasing them from local in-country manufacturers. By promoting clinical R&D, local production, shaping markets to ensure sustainable local demand and strenghtening suppy chains, the health sector can gain revenue to grow the economy. \n\nI’d like to extend my thanks to all our CMDs again for the tremendous work and effort they put in to provide good healthcare to our citizens.\n\nPresident Bola Ahmed Tinubu GCFR’s promise and mandate is clear; to build an effective governance framework that fosters efficiency, equity, and quality throughout the healthcare system. \n\nThe road ahead may be challenging, but I am confident that if the CMDs continue to maintain discipline, industrial harmony  amongst stakeholders and healthcare professionals, and pursue innovative approaches, we can build a healthcare system that is truly world-class.",
    "likes": 16,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1766514475765477525",
    "url": "https://x.com/DrTunjiAlausa/status/1766514475765477525",
    "created_at": "Sat Mar 09 17:20:45 +0000 2024",
    "text": "In our quest to strengthen Federal Government’s collaborative efforts with State Governors, I paid a visit to His Excellency Dapo Abiodun, Governor of Ogun State, whilst on my way to the 105th Quarterly Meeting of  Chief Medical Directors and the Commissioning of new infrastructures at our Federal Medical Centre, Abeokuta. \n\nIn our meeting, we discussed Federal Government’s plan to increase the number of   students enrolled for medicine, nursing and other health affiliated courses, the National Regulatory Health Facility Commission and the new University of Health Sciences being planned in Lagos State. We also spoke about Governor Abiodun’s plans to regulate healthcare providers and delivery of services in order to crack down on quackery in the state.\n\nI’m incredibly pleased with Governor Abiodun’s interest for Ogun State to be apart of the University of Health Sciences pilot programme and his overwhelming support to achieve President Bola Ahmed Tinubu’s GCFR Renewed Hope Agenda. \n\nI was also quite impressed with Governor Abiodun’s recent initiative to regulate, train and certify over 3,000 traditional birth attendants, to help control maternal and child mortality rates in the state. We are both in agreement that tighter regulation on healthcare providers and delivery is imminently needed to provide quality and efficient healthcare to Nigerians. \n\nI extend thanks to Governor Dapo Abiodun and his team for having me, and gifting me with Adiré, specially made in Ogun State @OGSG_Official . I’ll make sure to wear it on Friday’s like the Governor and most of Ogun state indigents do on Friday’s! I look forward to working with you and your state to create the healthcare environment desire.\n\n#HealthForAll #Nigeria",
    "likes": 9,
    "retweets": 0,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1765790108387570120",
    "url": "https://x.com/DrTunjiAlausa/status/1765790108387570120",
    "created_at": "Thu Mar 07 17:22:23 +0000 2024",
    "text": "This week I had the pleasure of attending @WHO’s Malaria Ministerial Conference in Yaoundé, Cameroon, themed “Tackling Malaria in countries hit by the disease”.\n\nIn the past couple of years, we have made moderate progress to reduce malaria parasite prevalence (from 27% — 22%), and #malaria deaths (from 92 to 87 per 100,000 population) with the help of our development partners. However, we are still on the long road to meet the Global technical strategy for Malaria 2030 (GTS) and achieve the 3rd Sustainable Development Goal (SDG), particularly target 3.3, which calls for ending epidemics of malaria and other communicable diseases by 2030.\n\nAs Nigeria is part of the 11 countries  responsible for 70% and 73% of the Global malaria incidence and malaria mortality respectively, it was extremely necessary for us to attend the conference and be part of the discussion and solution.\n\nThe objectives of the conference were to:\nhttps://t.co/1gKmYoJjbn progress and challenges in meeting the GTS Malaria 2030 targets.\n2.Discuss mitigation and funding strategies for Malaria prevention and treatment. \n3.Agree on effective strategies and responses for accelerated malaria mortality reduction in Africa, underpinned by a commitment to UHC.\n4.Establish a roadmap for increased political commitment and societal engagement in malaria control with a clear accountability mechanism.\n\nAt the end of the conference, all Ministers in attendance signed the 2024 Yaoundé Declaration on Malaria, which detailed the contents of the roadmap and our commitment to meet the GTS Malaria targets by 2030.\n\nWith a significant increase of funding allocated towards healthcare in our upcoming 2025 budget, the federal government is now poised to increase domestic funding towards our malaria elimination strategy, in line with the 2000 Abuja Declaration.\n\nCoupled with President Bola Ahmed Tinubu’s unwavering support and his commitment to improve our healthcare delivery system and the legislatures to ensure its implementation, Prof @muhammadpate and I will work tirelessly to create an environment where all citizens aren’t easily succumbed to the plight of malaria. \n\nOur plan is to invest more human resources for health across all levels of care, especially in primary healthcare facilities, work with development partners to direct more funding towards malaria eradication, and strengthen and improve quality data generation to improve decisions.\n\nAs a next step, the @Fmohnigeria will be organising a broad, all-encompassing meeting in Abuja focused on “Rethinking Malaria Elimination in Nigeria” in the coming weeks. We are expecting high power delegations from the Global Fund to fight AIDS, Tuberculosis and Malaria (GFATM), the United States of America President’s Malaria Initiative (US-PMI) and Bill and Melinda Gates Foundation in attendance.\n\nEradicating Malaria in all 36 states is going to take time and collaborative efforts from across the board, but we are determined to reduce its prevalence and save the lives of our citizens affected by malaria.",
    "likes": 8,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1763527963599917241",
    "url": "https://x.com/DrTunjiAlausa/status/1763527963599917241",
    "created_at": "Fri Mar 01 11:33:25 +0000 2024",
    "text": "Today I’ll be speaking at  the Investiture Ceremony of the 23rd President of the National Postgraduate Medical College of Nigeria, an apex medical institution in Nigeria established by decree 67 of 1979.\n\nI’m pleased to announce the @Fmohnigeria’s collaboration with the College to establish training in many medical subspecialties to improve the treatment of Nigerians, reduce medical tourism and enhance research. \n\nClick here to watch the livestream, to learn which curriculum we’ll be developing: \n\nhttps://t.co/rDg4u6sztR",
    "likes": 8,
    "retweets": 1,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1763479223711182984",
    "url": "https://x.com/DrTunjiAlausa/status/1763479223711182984",
    "created_at": "Fri Mar 01 08:19:45 +0000 2024",
    "text": "The achievement of President @officialABAT’s Renewed Hope Agenda and our 4-point vision for a better healthcare system, relies heavily on regulation, consistency and maintenance. \n\nToday, roughly 60% of our healthcare is delivered through the private sector, leaving 5-10% and 30% to be delivered by the Federal and State government respectively.\n\nThe lack of consistent health facility regulation in our sector, has left Nigerians to be preyed upon by ill-equipped, uncertified facilities and poorly qualified healthcare professionals, who face no consequences for their actions. It’s absence also causes saturated need in areas with multiple hospitals and facilities, which in turn affects the interest of foreign investors.\n\nMy discussion on Wednesday 27th February, with the State Commissioners of Health at the Quarterly Collaborative Meeting of the National Health Commissioner’s Forum (NHCF), focused on the Federal Government’s plan to implement a National Health Facility Regulatory Commission. The Commission will help to regulate all facilities and healthcare and allied healthcare professionals. The meeting served as a great opportunity to receive the commissioners in-person feedback and gain their support.\n \nWe have an incredibly complex healthcare system, that requires effective, collaborative governance through all levels (state to federal) to enable Nigerians to receive the highest standards of care, when and where they need it. \n\nI extend thanks to the State Commissioners for their honest feedback and support to implement the National Health Facility Regulatory Commission. With their support as our co-creators on this journey, our next step is to present this initiative at the next Federal Executive Council meeting and proceed with the legislation.  \n\nWe are at a penultimate time in history where the dawn of a rejuvenated healthcare system awaits us. All we need to do is seize it.",
    "likes": 21,
    "retweets": 3,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1762930305021673838",
    "url": "https://x.com/DrTunjiAlausa/status/1762930305021673838",
    "created_at": "Wed Feb 28 19:58:33 +0000 2024",
    "text": "Evening everyone, \n\nI’ll be going live on @ARISEtv news tonight at 9.30PM to discuss the highlights of today’s Ministerial briefing.\n\nDo tune in to learn more about the Ministry’s recent activities in regards to medical brain drain, high cost of pharmaceuticals, hospital and primary health centre improvements and more!",
    "likes": 9,
    "retweets": 2,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1762015107167510993",
    "url": "https://x.com/DrTunjiAlausa/status/1762015107167510993",
    "created_at": "Mon Feb 26 07:21:52 +0000 2024",
    "text": "As a Nigerian and American-trained Nephrologist, I know first-hand the impact diaspora participation can have on the improvement, quality and delivery of healthcare and research in Nigeria. \n\nOver the weekend, I hosted an unprecedented discussion with around 400 Nigerian healthcare professionals of Nigerian origin based internationally. \nThe distinctive gathering included esteemed physicians, professors, and allied practitioners from across the globe.\n\nI opened the session by sharing our four-point agenda and the progress our ministry has achieved in the last nine months under President @officialABAT. The session ended with an in-depth Q&A, where I answered multiple questions and addressed concerns from attendees living in USA, United Kingdom, Australia, Canada, and Saudi Arabia. \n\nAt the end of the 2 hour 45 min conversation, I believe the attendees were satisfied with I and Prof @muhammadpate’s approach to tackling our systemic challenges.\n\nIn addition to these sessions, which will be continuous, we are working on an interactive dashboard for healthcare professionals in the diaspora to engage and find opportunities to provide their services i.e., through training, teaching, research etc.\n\nNigeria, in regards to research and healthcare, has been absent on the world stage for far too long. Under President Tinubu, to which Healthcare is a priority evidenced by the current healthcare budget — the largest in Nigeria's history, we have the chance to change that.\n\nSo I challenge and implore all Nigerians in diaspora and in country to be loyal to Nigeria as other citizens are loyal to their country. \n\nI extend my thanks to everyone who joined and actively took part in the session. I am eager for the forthcoming discussions, anticipating valuable contributions from our diaspora professionals.",
    "likes": 40,
    "retweets": 10,
    "replies": 5,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1760709832795967824",
    "url": "https://x.com/DrTunjiAlausa/status/1760709832795967824",
    "created_at": "Thu Feb 22 16:55:11 +0000 2024",
    "text": "Ensuring Nigerians have access to the right care when and where they need it, is a vital objective within Mr President’s Renewed Hope Agenda and the FMOH&SW’s 4-point agenda.\n\nEarlier this week, I had a meeting with the Stroke Action Nigeria team to discuss how the Ministry of Health and Social Welfare (FMOH&SW) can support their plans to further Stroke care services on the healthcare landscape. \n\nThe discussion focused on the implementation of Stroke care services in our primary healthcare centres, building a Stroke registry, as well as creating more avenues for Stroke research in the country.\n\nIn Nigeria today, the current prevalence of #Stroke is 1.14 in 1000 persons. Although we have set guidelines on #Hypertension, non communicable diseases (NCDs) and a new stroke centre at the University Teaching Hospital, Maiduguri, we need to provide more accessible care services for persons susceptible to and living with Stroke. \n\nThank you to Dr Rita Melifonwu, Dr Ann Ojimba, Dr Ogugua Ogbo, Prof Jackie Bosch, and Sarah Belson for a productive meeting. I look forward to working with you to deliver quality healthcare services.",
    "likes": 20,
    "retweets": 5,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1760282641834672311",
    "url": "https://x.com/DrTunjiAlausa/status/1760282641834672311",
    "created_at": "Wed Feb 21 12:37:40 +0000 2024",
    "text": "I recently sat down with Lara Adejoro from @MobilePunch to discuss the steps Coordinating Minister Prof @muhammadpate and I are taking to control the cost of drugs and importation tariffs on medications.\n\n“Is the heath sector at the level we want it to be at? No, but it is not a bad system, we have a good healthcare system. It just needs to be improved and sustained for future use”  - Dr Tunji Alausa, Honourable Minister of State for Health and Social Welfare.\n\nRead the full article here: https://t.co/xzZf9arC8V",
    "likes": 35,
    "retweets": 16,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1758809060378386478",
    "url": "https://x.com/DrTunjiAlausa/status/1758809060378386478",
    "created_at": "Sat Feb 17 11:02:11 +0000 2024",
    "text": "Our primary focus is to drive progress across sectors and elevate Nigeria's capacity to become a more productive nation.\n\nThis week, AU Member states attended the 44th Ordinary Session of the Executive Council and the 37th Ordinary Session of the Assembly of the African Union (AU) summit to update our brother and sister nations on our objectives, in line with President Bola Ahmed Tinubu’s Renewed Hope Agenda. \n\nThe key objectives for discussion are to:\n1. Engage in discussions regarding the operationalisation of the American Medicine Agency, to aid the regulation of medicines manufactured and distributed in Africa. \n\n2. Scale up diagnostic facilities and kits in Nigeria and Africa. As well as manufacture homegrown kits and domesticate the use of these kits in country. \n\n4. Meet with the African CDC to discuss an action plan to help manage disease control, prevalence and prevention. \n\nThis summit is providing Nigeria with great opportunities for cross country collaboration.\n\n@_AfricanUnion \n#AUSummit",
    "likes": 10,
    "retweets": 5,
    "replies": 4,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1757349600216670469",
    "url": "https://x.com/DrTunjiAlausa/status/1757349600216670469",
    "created_at": "Tue Feb 13 10:22:49 +0000 2024",
    "text": "In continuation of my #WorldCancerDay activities, I paid a visit to Marcelle Ruth Cancer Centre and Specialist Hospital in Victoria Island, Lagos — known for their world class comprehensive treatment of #cancer and specialist conditions. \n\nI was very impressed with the centre’s facilities and top-line equipment, staff, as well as Dr Elebute-Odunsi and her team’s dedication to employing and training homegrown students, delivering high standards of cancer and ensuring continuity of care for their patients.\n\nA sub-goal under pillar 2 of @Fmohnigeria’s 4-point agenda is to improve the quality of care and service delivery across ALL levels of the health system, private sector included. That’s why ongoing partnerships between public and private facilities is essential to providing the best healthcare to Nigerians. \n\nThank you to Dr Modupe Elebute-Odunsi, Mr Bolaji Odunsi and Dr Kemi Ogunyemi for the tour and shedding light on Marcelle Ruth’s goal to become the top one-shop for cancer care in Africa - which I believe it will. I look forward to continuing our conversations and supporting you on this journey.",
    "likes": 7,
    "retweets": 1,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1757049430807621633",
    "url": "https://x.com/DrTunjiAlausa/status/1757049430807621633",
    "created_at": "Mon Feb 12 14:30:03 +0000 2024",
    "text": "Don’t forget tune in to Arise at 3.20PM WAT (2.20 GMT/ 9.20AM EST) to watch Dr Tunji Alausa, Honourable Minister of State for Health and Social Welfare discuss the Federal Government’s plans to improve cancer care in the country.",
    "likes": 8,
    "retweets": 4,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1756952053497114730",
    "url": "https://x.com/DrTunjiAlausa/status/1756952053497114730",
    "created_at": "Mon Feb 12 08:03:06 +0000 2024",
    "text": "Morning all! \n\nFollowing World Cancer Day last week, tune in to @ARISEtv’s Newsday show this afternoon, Monday 12th February at 3.20PM WAT (2.20 GMT/ 9.20AM EST) to watch my discussion with Vimbali on the @Fmohnigeria’s plans to improve cancer care in the country. https://t.co/RtqiIlzMl9",
    "likes": 14,
    "retweets": 7,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1756720874395222474",
    "url": "https://x.com/DrTunjiAlausa/status/1756720874395222474",
    "created_at": "Sun Feb 11 16:44:29 +0000 2024",
    "text": "In the many conversations I’ve had with private sector stakeholders, they all alluded to the costly customs duties and tariffs incurred when importing life saving healthcare goods and equipment.\n\nIn lieu of this, I invited the Mr Bashir Adewale Adeniyi MFR dsm fnipr psc, Comptroller General of Customs @CustomsNG to @hfn_nigeria’s Annual 2024 Conference on Thursday to listen to their queries. Which I’m happy to say that he did dutifully and emphatically.\n\nThe Comptroller General assured stakeholders that he will prioritise the clearance of all healthcare goods into Nigeria, escalate other issues, create a direct line of communication between the stakeholders and the Nigerian custom office, as well share the annual list of updated HS codes to ensure all stakeholders are privy to code changes.\n\nThis is the beginning of a new relationship between the Federal Ministry of Health and Social Welfare, Nigerian Customs and the Nigeria Private Health Sector. \n\nThe @Fmohnigeria are determined to make the sector a thriving, economically beneficial space for both the private and public sector.",
    "likes": 17,
    "retweets": 6,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1755618161981071864",
    "url": "https://x.com/DrTunjiAlausa/status/1755618161981071864",
    "created_at": "Thu Feb 08 15:42:42 +0000 2024",
    "text": "With a growing population of over 220 million Nigerians, it is becoming increasingly crucial for the Federal Government to deepen our private sector involvement to supplement and reinforce the services of the public sector.\n\nThis administration led by President Bola Ahmed Tinubu is determined to increase health sector contribution from <6% to >15%. However, this is only possible if we actively and effectively collaborate with the private sector. \n\nSince joining this administration, I’ve spent time meeting private sector stakeholders to understand the landscape, their needs and discuss paths towards creating better private public partnerships. These partnerships are key to achieving our 4-point agenda and the President’s Renewed Hope Agenda.\n\nI would like to thank Dr Pamela Ajayi, President of @hfn_nigeria and her team for inviting me to speak today at HFN’s Annual 2024 Conference and partake in the discussions. \n\nCoordinating Minister Prof Pate and I are determined to rejuvenate the health sector into a robust and integrated sector with strong governance, that delivers accessible, affordable, and quality healthcare to all Nigerians.\n\n#2024HFNAnnualConference",
    "likes": 23,
    "retweets": 9,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1755146961273901277",
    "url": "https://x.com/DrTunjiAlausa/status/1755146961273901277",
    "created_at": "Wed Feb 07 08:30:19 +0000 2024",
    "text": "In our efforts as a Government, to further our mission of increasing the supply of healthcare workers to reduce the gap in our healthcare workforce, I met with Director General of the National Youth Service Corps (@officialnyscng), Brig General YD Ahmed at my office on February, 5th 2024. \n\nOur deliberations focused on identifying opportunities to contribute to narrowing the gap that we currently have in our HRH and provide a pathway to a sustainable solution.  \n\nThank you to the DG and his team for the productive discussions and their commendable service to our nation.",
    "likes": 9,
    "retweets": 3,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1754896891446177995",
    "url": "https://x.com/DrTunjiAlausa/status/1754896891446177995",
    "created_at": "Tue Feb 06 15:56:37 +0000 2024",
    "text": "To tackle the burden of cancer in our nation it will take a collective effort from all public and private actors. \n\nToday, I was honoured to receive the Health Leadership Award, presented by members of the Nigerian Cancer Society and the leaders of the Nigerian First Ladies Against Cancer (FLAC) Coalition @FlacNigeria \n\nIt was a pleasure to learn about both initiatives, their activities and aims in regards to curbing the rise of cancer prevalence in the country. \n\nThank you to Mrs Bamidele Abiodun, First Lady of Ogun State, Mrs Abiola Ajimobi, Former First Lady of Oyo State, Dr Zainab Shinkafi-Bagudu @DrZSB,  Prof Moji Adeyeye, Director General of @NafdacAgency and for all the work you do to ensure Nigerians get what they need to survive their journey with cancer.",
    "likes": 16,
    "retweets": 6,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1754806951601439047",
    "url": "https://x.com/DrTunjiAlausa/status/1754806951601439047",
    "created_at": "Tue Feb 06 09:59:14 +0000 2024",
    "text": "#Cancer is one of the leading causes of death worldwide and in Nigeria, with 1 in 5 people being diagnosed with the disease during their lifetime. \n\nTo support Nigerians with the high incurred cost of cancer care, under our strategic guidance, the National Health Insurance Act (NHIA) will ensure all Nigerians including cancer patients are enrolled on a health insurance plan. The NHIA will manage funding for cancer care in the future, to avoid duplication of roles in terms of purchase of services for all patients.\n\nIn line with President Bola Ahmed Tinubu’s @officialABAT Renewed Hope Agenda and @Fmohnigeria ’s goal to save lives, reduce physical and financial pain, and produce health for all Nigerias, we finally received the funding needed to build 6 cancer centres in each geopolitical zone.  \n\nThese centres will be constructed in the following Federal Teaching Hospitals: UNTH, Enugu (South-East), ABUTH, Zaria, FTH Katsina (North-West), UBTH Benin (South-South), JUTH Jos (North Central), and LUTH, Lagos (South West), while UMTH Maiduguri is being upgraded (North-East).  All centres will be equipped with brachytherapy machines, other state-of-the-art equipment and will have trained biomedical engineers ready to maintain and service the equipment. \n\nWe are also in the process of implementing the 2021 National Policy on Hospice and Palliative care and 2021 National Policy on Chemotherapy Safety. The Ministry will take steps to review the level of implementation of the 2 policy documents with the view to ensuring optimal uptake by the Healthcare providers across the country.\n\nEffective data collection and disease monitoring is key to our health security and  the sector’s growth. To improve the reliability and effectiveness to capture relevant data adequate for the National Planning for Cancer Management, we will be revamping and optimising our current Population Based Cancer Registry (PBCR) to focus on all cancers including paediatric cancers. \n\nI would like to extend commendations to all bilateral and multilateral organisations, non-governmental organisations, pharmaceutical and equipment manufacturers  collaborating with us to tackle cancer prevalence in Nigeria.\n\nIt is only through effective communication, cross- and in-sectoral collaborations through our agencies and public private partnerships that we can provide robust care services to fight cancer in Nigeria. Together, I am confident we can #CloseTheGap (2)",
    "likes": 5,
    "retweets": 2,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1754806933784052149",
    "url": "https://x.com/DrTunjiAlausa/status/1754806933784052149",
    "created_at": "Tue Feb 06 09:59:10 +0000 2024",
    "text": "I am honoured to have attended this year’s #WorldCancerDay2024 Symposium, titled “Economy, Taxation and Cancer Control: The Exit of Pharmaceutical Companies from Nigeria.”, to speak on the Federal Ministry of Health and Social Welfare (FMOHSW)’s commitment and strides we’ve taken to address the burden of cancer in our nation.\n\nIn regards to primary care, the FMOHSW through the National Primary Healthcare Development Agency (NPHCDA) @NphcdaNG led a Hepatitis and Human Papilloma Virus (HPV) campaign to the tackle the prevalence of Cervical and Liver Cancer. In 2023, we provided single dose HPV vaccines to 7.7 million girls aged 9-14, implemented campaigns in schools and communities to increase the uptake of the vaccines, and encouraged cancer screening at all levels of our healthcare system.\n\nCoordinating Minister Prof Pate and I are very aware of the detrimental effect high-costing drugs have on treatment pathways and are driven to unlock the pharmaceutical value chain. We are collaborating with various pharmaceutical companies to reduce their costs and provide access to chemotherapeutic drugs and other cancer medication at about 50% cost reduction.\n\nInstead of importing drugs, we want to change our culture of consumption to production. To this effect, we are reviewing our Pharmaceutical Laws and Regulations to encourage local production and are building a robust relationship with the pharmaceutical industry and other relevant stakeholders in the Nigeria Cancer Ecosystem.\n\nTo ensure patients with cancer are sustainably treated efficiently and timely, we have moved the Cancer Health Fund originally coordinated and housed in the FMOHSW, to the National Institute of Cancer Research and Treatment (NICRAT) @NicratGov. This change will provide Nigerians with prompt and unhindered access the Cancer Health Fund. The FMOHSW will continue to provide oversight and policy direction for the fund. (1)",
    "likes": 7,
    "retweets": 2,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1754179164268040429",
    "url": "https://x.com/DrTunjiAlausa/status/1754179164268040429",
    "created_at": "Sun Feb 04 16:24:38 +0000 2024",
    "text": "Today is World Cancer Day, a day committed to raising global awareness of cancer.\n\nIn the lead up to this day, I met with Prof Usman Aliyu Malami, Director General of the National Institute of Cancer Research and Treatment (NICRAT), Nikhill Bhakta, Sub-Saharan African Regional Programme Director of St Jude Global and their respective teams, to discuss St Jude Global’s “National Stakeholders Prioritisation Workshop for Childhood Cancer in Nigeria”, aimed at improving health outcomes of children with cancer and other catastrophic diseases in the country.\n\nIn Nigeria today, an alarmingly high number of children are being diagnosed with Burkitt Lymphoma, a type of Non-Hogkins Lymphoma that affects the lymphatic system. If we don’t act now, these numbers will continue to rise.\n\nI am pleased that there are public and private sector actors in Nigeria dedicated to meet the @WHO‘s Global Initiative for Childhood Cancer, which aims to achieve a 60% survival rate for childhood cancer globally and reduce suffering for all by 2030.\n\nIn line with our strategic plan “to save lives, reduce physical and financial pain and produce better health for all Nigerians”, the @Fmohnigeria is ready to support @NicratGov and collaborate with @StJudeResearch to tackle paediatric cancer and improve cancer care in our nation. \n\n#WorldCancerDay",
    "likes": 21,
    "retweets": 6,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1753767614210285966",
    "url": "https://x.com/DrTunjiAlausa/status/1753767614210285966",
    "created_at": "Sat Feb 03 13:09:17 +0000 2024",
    "text": "Improving the governance of our healthcare system and federal medical centres and teaching hospitals is a key objective in our 4-point agenda. \n\nThis week, I continued my visitation of the FMCs and Teaching Hospitals to asses their current challenges and work with the respective leadership teams to forge a way forward. \n\nOn Thursday, I visited University College Hospital Ibadan, one the first hospitals built in our nation. Since the 1950’s, UCH has trained high-level healthcare providers and been a centre of health excellence. \n\nDuring my visit I was pleased to see the hospitals growth but also disheartened by the lack of progress in some areas as a result of limited resources. I extend commendation to Professor Otegboye and his leadership team for their continued efforts.\n\nThe health sector is in dire need of bridging the infrastructure deficiency gap and under the leadership of president Bola Ahmed Tinubu, The Federal Ministry of Health and Social Welfare is determined to restore our healthcare delivery reputation and  improve service delivery in the nation.",
    "likes": 14,
    "retweets": 4,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1753352600865390735",
    "url": "https://x.com/DrTunjiAlausa/status/1753352600865390735",
    "created_at": "Fri Feb 02 09:40:10 +0000 2024",
    "text": "In our continuous attempt to crack down on the illegal organ trafficking trade in FCT Abuja,  Perm. Sec. of Health, Ms Daju Kachollom, mni and I met with high-ranking officers in the Nigerian Police Force to discuss potential immediate and long term solutions that will bring justice to the victims, their families and quell further instances from occurring. \n\n@Fmohnigeria are also working towards developing a sustainable and efficient infrastructure for organ donations and transplants in the country.\n\nIn the meantime, I implore all Nigerians to consider the consequences of illegal harvesting on your health and your families. \n\nThe Federal Ministry of Health and Social Welfare is determined to find all individuals involved and subject them to the full extent of the law. As well as provide the necessary support to further the Police’s investigation.",
    "likes": 11,
    "retweets": 5,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1753095156964929783",
    "url": "https://x.com/DrTunjiAlausa/status/1753095156964929783",
    "created_at": "Thu Feb 01 16:37:11 +0000 2024",
    "text": "This evening, I’ll  be live on @tvcnewsng at 6PM, to discuss my visit to UCH Ibadan and @Fmohnigeria ’s plans to implement recruitment waivers to help seal the vacuum of healthcare workers in the country. \n\nTune in to listen to the discussion! https://t.co/JUoW1jCJzR",
    "likes": 18,
    "retweets": 4,
    "replies": 13,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1752693735006073159",
    "url": "https://x.com/DrTunjiAlausa/status/1752693735006073159",
    "created_at": "Wed Jan 31 14:02:04 +0000 2024",
    "text": "In an ongoing effort towards achieving the goals of reducing maternal mortality rate, infant mortality rate, and under-five mortality rate in Nigeria. The Federal Ministry of Health is pleased to announce the handover of 14 MCC (Maternal and Childcare) and 80-100 bedded and equipped facilities donated by the Office of the Senior Special Assistant to the President on Sustainable Development Goals (SDGs).\n\nAlthough some progress has been made to reduce under-five mortality and infant mortality rates, Nigeria still contributes to roughly 20% of global maternal mortality rates. \n\nThese newly constructed buildings will play a crucial role in providing essential healthcare services to mothers and children, contributing to the overall improvement of healthcare infrastructure in the country. \n\nThe facilities will be operated under Federal Teaching Hospitals and Federal Medical Centres (FMC) across the country (see list below) and will enhance capacity to deliver comprehensive and meaningful healthcare to Nigerians.\n\nThe Federal Ministry of Health and Social Welfare expresses gratitude to the OSSAP-SDG and acknowledges the importance of inter-governmental relationships and partnerships in achieving Sustainable Development Goal 3 (SDG 3) - ensuring healthy lives and promoting well-being for all at all ages. \n\nThis initiative aligns with President Bola Ahmed Tinubu's Renewed Hope Agenda, emphasising his commitment to delivering quality healthcare to Nigerian citizens.\n\nI extend commendations to Princess Adejoke Orelope-Adefulire, Senior Special Assistant on Sustainable Development Goals (SSAP on SDG) @Adejoke_O_A @ossap_sdgs for her dedication and efforts in making this collaboration a reality. \n\nThe Federal Ministry of Health and Social Welfare looks forward to the positive impact these MCC and 80-100 facilities will have on the health outcomes of the nation, as well as the continued success of such partnerships in the future.",
    "likes": 8,
    "retweets": 4,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1750966814178255075",
    "url": "https://x.com/DrTunjiAlausa/status/1750966814178255075",
    "created_at": "Fri Jan 26 19:39:54 +0000 2024",
    "text": "I’m always happy to shed light on what the Federal Ministry of Health and Social Welfare is doing to provide Nigerians with better service delivery and access to healthcare. \n\nTune in to @NTANewsNow tomorrow morning at 7.30AM WAT (6.30AM GMT/ 1.30 AM EST) to watch my interview with Thelma Obaze on all things healthcare.",
    "likes": 12,
    "retweets": 3,
    "replies": 2,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1750798396032532556",
    "url": "https://x.com/DrTunjiAlausa/status/1750798396032532556",
    "created_at": "Fri Jan 26 08:30:40 +0000 2024",
    "text": "The recent COVID-19 Pandemic highlighted numerous issues in our health system requiring immediate attention, such as our reliance on imported vaccines for infectious diseases. \n\nIn the global race to achieve SDG 3.8 and Universal Health Coverage, the National Institute of Pharmaceutical Research and Development (NIPRD) and its partners, have developed a bottom-up approach for vaccine research & development (R&D) and local vaccine manufacturing in Nigeria.\n\nAligned with the Nigerian Vaccine Policy 2021, the National Health Act 2014 and the National Health Sector Blueprint 2024-2026, the National Plan for Vaccine R&D and Local Production 2024-2034 provides nine evidence-based strategies to sustainably establish local vaccine production; in line with President Bola Ahmed Tinubu commitment to Unlock the Value Chain of the Healthcare Sector. \n\nThe ten-year plan addresses critical issues i.e., vaccine distribution, hesitancy and disparities in coverage, provides guidance for relevant stakeholders and insights on multi-sectoral interventions crucial to eradicate vaccine preventable diseases. By the end, it also ensures 3 additional plants become operational in the country.\n\nI extend gratitude and commendations to Dr Obi Adigwe, Director General NIPRID, NIPRD’s partners – the Bulgarian Government, represented by Ambassador Dr Yanko Yordanov, and EU delegation in Nigeria for recognising the criticality of this intervention and prioritising the expedited development of this important initiative.\n\nThe Federal Ministry of Health and Social Welfare will continue to provide the necessary support and will work with all relevant agencies and sector actors to ensure our desired result of delivering a sustainable vaccine R&D and local production in the country is achieved.",
    "likes": 5,
    "retweets": 3,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1750236617757937951",
    "url": "https://x.com/DrTunjiAlausa/status/1750236617757937951",
    "created_at": "Wed Jan 24 19:18:22 +0000 2024",
    "text": "It was a pleasure to speak to you all about the current gaps we have in cancer research, and identify the ways in which @iaeaorg @iaeapact @IAEANA @IAEANS can effectively contribute to expanding access to and delivery of cancer treatment in the nation. I look forward to our continued discussion in the coming weeks.",
    "likes": 9,
    "retweets": 1,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1750233656805749103",
    "url": "https://x.com/DrTunjiAlausa/status/1750233656805749103",
    "created_at": "Wed Jan 24 19:06:36 +0000 2024",
    "text": "Following the inauguration of the National Health Research Committee (NHRC) on January 4th 2024, I’m pleased to announce that we inaugurated the second set of members for the National Health Research Ethics Committee (NHREC) yesterday.\n\nIn line with the @Fmohnigeria ’s 4-point agenda, NHREC aims to enforce standards and protocols for ethically conducting clinical research studies in Nigeria. NHREC will also work hand in hand with NAFDAC to regulate all clinical research studies in order to protect all participants.\n\nThe committee, made up of medical, legislative and religious professionals is chaired by Professor Richard Adegbola. Professor Adegbola is a seasoned Medical Microbiologist, Research Professor and Consultant at the Nigerian Institute of Medical Research (NIMR), Lagos, Nigeria. Widely known for his work in pharmaceuticals, philanthropy, academia and diagnostic microbiology.\n\nResearch plays a critical role in the improvement of society and saving lives. It is essential for the development of new treatments and drives health system strengthening. \n\nThe inauguration of this committee reaffirms President @officialABAT’s  commitment to foster an environment that encourages groundbreaking research. \n\nWith NHREC, we want to guide our researchers, re-instil public trust and ensure our nation remains at the forefront of health research in the continent.\n\nI extend my deepest appreciation to Professor Adegbola and the members of the NHREC for accepting this responsibility. Together we will make our nation great again.\n\n#NHREC\n#research \n\nClick here for more information on NHREC:",
    "likes": 7,
    "retweets": 2,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1750210219039141970",
    "url": "https://x.com/DrTunjiAlausa/status/1750210219039141970",
    "created_at": "Wed Jan 24 17:33:28 +0000 2024",
    "text": "Aligned with the established deliverables from the recent FEC meeting, the team from the Federal Ministry of Health & Social Welfare , in conjunction with @DrDorisAnite , Minister of Industry, Trade and Investment, engaged in dialogues with representatives from the Needles and Syringes manufacturing group. The primary objective was to tackle the existing challenges within Nigeria's Needles and Syringes manufacturing industry, with a specific emphasis on devising both immediate and long-term strategies to foster local industrialization.\n\nOver the past several years, Nigeria has experienced a significant uptick in the importation of Needles and Syringes, creating hurdles for our local manufacturing companies and exacerbating persistent issues in the production sector. This collaborative initiative seeks to identify the specific factors contributing to this concerning trend and craft comprehensive solutions to fortify the growth and sustainability of indigenous manufacturing firms.\n\nFollowing the meeting, the Federal Ministry of Health and the Federal Ministry of Trade and Investment, along with the group, concluded with highly effective solutions and actionable steps designed to propel the Needles and Syringes manufacturing sector forward in Nigeria. I extend my gratitude to Dr Anite and her team for their prompt attention to this top priority amidst our extensive list of priorities.\n\nI want to assure Nigerians that Coordinating Minister Prof Pate, Dr. Doris Anite, and I are dedicated to fostering a sustainable ecosystem for local manufacturing businesses to thrive and facilitate the export of locally made products in the next 3-5 years.",
    "likes": 9,
    "retweets": 2,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1750062415620751750",
    "url": "https://x.com/DrTunjiAlausa/status/1750062415620751750",
    "created_at": "Wed Jan 24 07:46:09 +0000 2024",
    "text": "Tuesday 23rd January 2024 marked a great day for the Nigerian Health Sector, as we launched the seventh Grant Implementation Cycle (GC7) approved by the @GlobalFund to Fight HIV/AIDS, Tuberculosis (TB) and Malaria. \n\nThe Global Fund allocated US $933,156,931 to tackle these 3 diseases and build resilient and sustainable systems for health (RSSH) over the next 3 years (2024-2026), in preparation for future pandemics. \n\nNigeria has the highest burden of Malaria, TB and HIV/AIDS in Africa. Alone, we contribute 27% of global malaria cases. \n\nWith the addition of 120,000 retrained frontline workers and a focus on preventative measures, early diagnosis & testing services, treatment, human-related barriers and public private led community interventions, this grant will be integral in our progress to achieve Universal Health Coverage. \n\nIn line with Mr President @officialABAT’s Renewed Hope Agenda and our 4-point strategic plan, to “save lives, reduce both physical and financial pain and produce health for all Nigerians” the funding will also help to improve the population health outcomes we need to access affordable and quality health services for all Nigerians. \n\nI am confident that the Global Fund Country Coordinating Mechanism (CCM), its chairman Professor @muhammadpate and its partners will meet their ambitious 95, 95, 95 goal. As well as ensure all funding received will be managed efficiently, transparently and accurately in guidance with the Sector-wide compact signed in December.",
    "likes": 12,
    "retweets": 4,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1748850688170344597",
    "url": "https://x.com/DrTunjiAlausa/status/1748850688170344597",
    "created_at": "Sat Jan 20 23:31:10 +0000 2024",
    "text": "In the aftermath of the Bodija, Ibadan explosion, @muhammadpate and I, acting on behalf of President Bola Ahmed Tinubu, convey our deep shock. \n\nMy visit to University College Hospital (UCH) Ibadan revealed the commendable efforts of Dr. Otebayo, CMD of UCH, and the entire team in providing care for the affected individuals. \n\nI'm relieved that the hospital sustained minimal damage. The commitment of the Federal Ministry of Health and Social Welfare persists in supporting UCH Ibadan's recovery and ensuring optimal care in all federal hospitals.",
    "likes": 6,
    "retweets": 2,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1748268050002915725",
    "url": "https://x.com/DrTunjiAlausa/status/1748268050002915725",
    "created_at": "Fri Jan 19 08:55:59 +0000 2024",
    "text": "At the first Federal Executive Council (FEC) meeting of 2024, we brought attention to Nigeria’s current pharmaceutical crisis – the lack of certain essential medicines and the rising price of pharmaceutical products.\n\nEnhancing the availability of essential medicines is a critical objective within the Federal Ministry of Health’s Health Sector Renewal Strategy and the Compact we signed with the states.\n\nDuring the FEC deliberations, Coordinating Minister @muhammadpate and I suggested the following immediate solutions such as tax waivers for importing active pharmaceutical ingredients (APIs) and pharmaceutical raw materials, soft loans for manufacturers and reducing import duties and tariffs to help tackle the ongoing crisis.\n\nMr President @officialABAT is eager to provide Nigerians with immediate solutions to address urgent needs, as well as medium and long-term solutions that will pave the way for local industrialisation and job availability. To this end, Mr President has set up a committee for the @Fmohnigeria and the Attorney General to develop an executive order to ensure these solutions are quickly integrated.\n\nIn the next couple of weeks, Dr Pate and I will meet with the Attorney General and the Minister of Trade and Investment to discuss our suggested solutions and collaborative opportunities to support our initiatives.\n\nCoordinating Minister Dr Pate and I are determined to cultivate a thriving, supportive environment for our local manufacturers and international partners.",
    "likes": 21,
    "retweets": 9,
    "replies": 3,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1748035569685254174",
    "url": "https://x.com/DrTunjiAlausa/status/1748035569685254174",
    "created_at": "Thu Jan 18 17:32:11 +0000 2024",
    "text": "Indeed we were! \n\nSince it’s conception @MedicalWomensA1 has played an integral role in society to champion the rights of women and  young ladies. As well as help to dispel the misinformation of women-related diseases such as cervical cancer. \n\nThank you again for the visit, we look forward to partnering with you to change the narrative, raise further awareness and provide sustainable solutions to the challenges women and young ladies face everyday in our country.",
    "likes": 4,
    "retweets": 1,
    "replies": 0,
    "author": "Dr. Tunji Alausa"
  },
  {
    "username": "DrTunjiAlausa",
    "tweet_id": "1746939549991710824",
    "url": "https://x.com/DrTunjiAlausa/status/1746939549991710824",
    "created_at": "Mon Jan 15 16:56:59 +0000 2024",
    "text": "Thank you HFN for the invitation to be your special guest at your annual conference.\n\nThis year’s theme aligns perfectly with the 1st pillar of @Fmohnigeria ‘s 4-point agenda, to deliver Effective Governance.\n\nWe are in agreement that improving cross-functional coordination and effective partnerships between the public and private sector are indeed key to improving our healthcare system.\n\nI look forward to the event.",
    "likes": 12,
    "retweets": 2,
    "replies": 1,
    "author": "Dr. Tunji Alausa"
  }
]