[
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1967144366620721363",
    "url": "https://x.com/EmmanuelMacron/status/1967144366620721363",
    "created_at": "Sun Sep 14 08:32:19 +0000 2025",
    "text": "Il y a un an, notre Nation célébrait ses athlètes pour la parade de nos champions à l’Arc de Triomphe. \n      \nAinsi s’achevait un été où nous avons vibré et rayonné, ensemble, plus haut et plus fort que nous-mêmes. \n      \nCes jeux de Paris ont été en effet un immense succès. \n\nNous avons garanti la sécurité des visiteurs, assuré la magie lors des cérémonies, et obtenu un record de médailles pour la France. \n\nNos Jeux vont laisser et laissent déjà une trace durable, dans nos mémoires, dans le paysage des villes hôtes, dans le cœur de tous ceux qui en ont fait un succès, dans les yeux de ceux qui, par milliers, sont revenus contempler l’ascension de la vasque olympique aux Tuileries tandis que cent mille baigneurs plongeaient dans la Seine tout l’été. \n\nLa Fête du sport que nous célébrerons ce jour n’est pas le moindre des héritages des Jeux. Cette Fête vient appuyer une ambition de long-cours : faire de la France une Nation sportive. \n\nUne Nation qui excelle dans les grandes compétitions, qui sait recevoir le monde entier pour les grands événements, comme nous le ferons en 2030 dans les Alpes françaises. \n\nUne Nation aussi où le sport apprend la cohésion, le dépassement, la fraternité, une manière aussi d’être français, faite de panache et d’universel.\n\nPensée sur le modèle de la Fête de la musique, la Fête du sport se conçoit comme un moment de joie et un moment de liberté. À travers 5 000 manifestations sur tout le territoire. \n\nAvec l’aide des grands champions qui en sont les parrains et marraines, Désiré Doué, Marie Patouillet, Florent Manaudou, Marie-José Pérec, Arthur Bauchet, Gloria Agblemagnon. \n\nAvec la mobilisation de nos bénévoles, nos associations, nos collectivités, de nos fédérations, nos athlètes. Grâce à eux tous, tant de nos jeunes et de leurs familles pourront pratiquer le sport ce dimanche.\n\nDans le Bas-Rhin, au plan d’eau de Brumath, un « village des sports » proposera plus de cinquante disciplines. \n\nLes Marseillais pourront vibrer autour d’ « Olympiades de la jeunesse ». \n\nEn Martinique, les activités enrôleront des plus petits aux seniors, du vélo au foot. \n\nEnfin, à Paris, un boulevard du sport sera le plus grand rassemblement multisports de notre Histoire, nouvel exemple du rayonnement de notre capitale.\n\nDans un contexte rempli de défis pour la Nation, faisons de ce moment de partage un serment d’unité. \n\nLe sport doit nous rassembler. \n\nPour notre jeunesse, il est une école d’émancipation, d’effort et d’entraide comme un antidote aux risques de la sédentarité, dans une époque où les écrans ont sans aucun doute pris une place excessive. \n\nPour tous nos athlètes, c’est l’ambition de la Nation pour la haute performance que nous poursuivons dans la durée. \n\nCreuset de fierté comme d’unité, le sport c’est aussi une fabrique d’égalité par l’inclusion de toutes les différences, et je salue l’engagement du monde paralympique.\n\nAinsi la Fête du sport se lit-elle comme une invitation : Faites du sport ! \n\nPour entretenir notre santé, notre goût de l’accomplissement personnel et collectif, notre fierté d’être Français, ensemble. \n\nJe souhaite à tous une très belle première édition. \n\nEntre le sport et le peuple français, une histoire de passion ne cessera de se nouer.\n\nLongue vie à la Fête du sport.\n\nVive la République.\nVive la France !",
    "likes": 2375,
    "retweets": 584,
    "replies": 1806,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1956012293466005923",
    "url": "https://x.com/EmmanuelMacron/status/1956012293466005923",
    "created_at": "Thu Aug 14 15:17:26 +0000 2025",
    "text": "→ Every year, 430 million tonnes of plastic are produced, polluting our environment.\n\n→ Every minute, 15 tonnes of plastic end up in our oceans.\n\n→ Every day, our health is increasingly at risk.\n\nWhat are we waiting for to take action?\n\nThis global plastic pollution treaty is our chance to turn the tide. But the weak ambition in the draft presented yesterday at the United Nations is simply unacceptable.\n\nI urge all states gathered in Geneva to adopt an agreement that truly meets the scale of this environmental and public health emergency.\n\nFor our health. \nFor our environment. \nFor our children.\n\nI thank all the French negotiators who are working tirelessly toward achieving this goal.",
    "likes": 2768,
    "retweets": 596,
    "replies": 1249,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1956006839331532970",
    "url": "https://x.com/EmmanuelMacron/status/1956006839331532970",
    "created_at": "Thu Aug 14 14:55:46 +0000 2025",
    "text": "→ Chaque année, 430 millions de tonnes de plastique sont produites et polluent l’ensemble des milieux.\n \n→ Chaque minute, 15 tonnes de plastiques sont rejetées dans l’océan. \n   \n→ Chaque jour, notre santé est un peu plus menacée. \n            \nQu’attendons-nous pour agir ? \n\nLe traité mondial contre la pollution plastique est notre opportunité de faire bouger les choses. Mais le manque d’ambition dans le texte présenté hier aux Nations unies est inacceptable.\n\nJ’appelle tous les États présents à Genève à adopter un texte à la hauteur de l’urgence environnementale et sanitaire.\n\nPour notre santé.\nPour notre environnement.\nPour nos enfants.\n\nJe remercie tous les négociateurs français qui œuvrent sans relâche pour y arriver.",
    "likes": 2223,
    "retweets": 522,
    "replies": 2140,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1944817096975901071",
    "url": "https://x.com/EmmanuelMacron/status/1944817096975901071",
    "created_at": "Mon Jul 14 17:51:43 +0000 2025",
    "text": "مرحباً بكم في فرنسا في زيارتكم الرسمية الأولى، صاحب السمو الشيخ مشعل الأحمد الجابر الصباح.\n    \nفي هذا اليوم الوطني، تُشرّفنا وتُسعدنا مشاركة دولة الكويت، التي تربطنا بها صداقة ضاربة في جذور التاريخ.\n\nتجمعنا إرادة مشتركة: تعزيز تعاوننا في مجالات الدفاع، والتعليم، والصحة، والطاقة، والاستثمار، وحمل صوت مشترك يدعو إلى الاستقرار في مواجهة تحديات المنطقة.",
    "likes": 1649,
    "retweets": 415,
    "replies": 390,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1944816179983294629",
    "url": "https://x.com/EmmanuelMacron/status/1944816179983294629",
    "created_at": "Mon Jul 14 17:48:04 +0000 2025",
    "text": "Bienvenue en France pour votre première visite, votre altesse Cheikh Mechaal Al-Ahmad Al-Jaber Al-Sabah.\n\nEn ce jour de fête nationale, la présence du Koweït, avec qui notre amitié s'est inscrite dans l'histoire, nous honore et nous touche.\n     \nUne même volonté nous rassemble : renforcer notre coopération, en matière de défense, d’éducation, de santé, d’énergie, d'investissement, et porter ensemble une voix de stabilité face aux défis de la région.",
    "likes": 1099,
    "retweets": 250,
    "replies": 407,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1942949125508481494",
    "url": "https://x.com/EmmanuelMacron/status/1942949125508481494",
    "created_at": "Wed Jul 09 14:09:04 +0000 2025",
    "text": "La startup française CorWave vient de réaliser une première mondiale : l’implantation d'une pompe cardiaque unique.\n\nC’est un espoir pour des millions de patients souffrant d'insuffisance cardiaque. Félicitations aux équipes : vous pouvez être très fiers.",
    "likes": 2582,
    "retweets": 534,
    "replies": 671,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1940032114486804643",
    "url": "https://x.com/EmmanuelMacron/status/1940032114486804643",
    "created_at": "Tue Jul 01 12:57:54 +0000 2025",
    "text": "Les fortes chaleurs frappent d’abord les plus fragiles : nos aînés, nos enfants, les personnes plus vulnérables ou isolées. Soyons attentifs à nos proches, à nos voisins, à nos collègues. \n\nVeillons les uns sur les autres.\n\nLes bons conseils, rappelons-les : https://t.co/aVAjOJ1rG7",
    "likes": 2770,
    "retweets": 566,
    "replies": 2609,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1932533029089521831",
    "url": "https://x.com/EmmanuelMacron/status/1932533029089521831",
    "created_at": "Tue Jun 10 20:19:13 +0000 2025",
    "text": "C’est une recommandation des experts de la commission écrans : je porte l’interdiction des réseaux sociaux avant 15 ans. Les plateformes ont la possibilité de vérifier l’âge. Faisons-le.",
    "likes": 26376,
    "retweets": 1610,
    "replies": 3473,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1927408328021332383",
    "url": "https://x.com/EmmanuelMacron/status/1927408328021332383",
    "created_at": "Tue May 27 16:55:29 +0000 2025",
    "text": "Le vote par l'Assemblée nationale des textes sur le développement des soins palliatifs et l'aide à mourir est une étape importante.\n\nDans le respect des sensibilités, des doutes et espoirs, le chemin de fraternité que je souhaitais s'ouvre peu à peu.\n\nAvec dignité et humanité.",
    "likes": 2555,
    "retweets": 538,
    "replies": 1352,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1922422042218872903",
    "url": "https://x.com/EmmanuelMacron/status/1922422042218872903",
    "created_at": "Tue May 13 22:41:46 +0000 2025",
    "text": "Quand il y a une souffrance qui est réfractaire à tous les traitements, quand il n’y a plus d’espoir, je suis pour que l’on puisse aider à partir dans la dignité. Humanité et fraternité. https://t.co/Q02Yu5eZke",
    "likes": 2569,
    "retweets": 569,
    "replies": 428,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1914766874203632053",
    "url": "https://x.com/EmmanuelMacron/status/1914766874203632053",
    "created_at": "Tue Apr 22 19:42:52 +0000 2025",
    "text": "Face au chikungunya à La Réunion, nos militaires sont mobilisés pour renforcer la lutte contre les moustiques. Restons vigilants et vaccinons les plus vulnérables. https://t.co/9RKSpKvZ6T",
    "likes": 3065,
    "retweets": 445,
    "replies": 826,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1910004028374671451",
    "url": "https://x.com/EmmanuelMacron/status/1910004028374671451",
    "created_at": "Wed Apr 09 16:17:01 +0000 2025",
    "text": "1 200 tonnes de fret humanitaire, un navire hôpital militaire, des capacités de soutien logistique, une conférence humanitaire à Paris : la France est engagée depuis le premier jour.\n     \nJ’étais hier à El-Arich près de Gaza, auprès des humanitaires du Croissant rouge égyptien, de MSF, Handicap International, PUI, et Solidarités International, et des agences des Nations unies qui viennent en aide aux populations civiles de Gaza. Ils mènent une action absolument essentielle.\n\nLa situation humanitaire à Gaza est intenable. La reprise de l'aide, la libération des otages, le cessez-le-feu et le chemin vers la paix sont absolument indispensables.",
    "likes": 6759,
    "retweets": 1370,
    "replies": 1534,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1908470802183250252",
    "url": "https://x.com/EmmanuelMacron/status/1908470802183250252",
    "created_at": "Sat Apr 05 10:44:31 +0000 2025",
    "text": "J’adresse aux Réunionnais un message de solidarité et de vigilance face à l’épidémie de chikungunya qui progresse.\n\nProtégeons les plus fragiles : dès lundi, les plus de 65 ans présentant des maladies chroniques pourront se faire vacciner gratuitement.\n\nRestons mobilisés.",
    "likes": 2287,
    "retweets": 442,
    "replies": 769,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1907471151699255612",
    "url": "https://x.com/EmmanuelMacron/status/1907471151699255612",
    "created_at": "Wed Apr 02 16:32:16 +0000 2025",
    "text": "La France est plus forte quand elle donne sa place à chacun.\n\nEn cette Journée mondiale de sensibilisation à l’autisme, réaffirmons notre engagement : nous ne céderons aucun effort pour bâtir une société plus inclusive.\n                                    \nLa stratégie nationale pour les troubles du neurodéveloppement continue de se déployer.\n\nNous avons agi pour repérer plus tôt l’autisme grâce aux plateformes de coordination et d’orientation désormais présentes dans chaque département.\n\nNous avons aussi renforcé l’accompagnement et la scolarisation, avec de nouveaux dispositifs scolaires créés chaque année.\n\nUne avancée majeure cette année : les personnes autistes avec un trouble du développement intellectuel pourront accéder à un CDI en entreprise ordinaire, avec un accompagnement adapté.\n\nJ’ai une pensée particulière pour toutes celles et tous ceux qui cherchent des solutions, pour les familles dans l’attente et pour les professionnels à leurs côtés.\n\nEnsemble nous réussirons.",
    "likes": 2273,
    "retweets": 441,
    "replies": 987,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1905352446563484096",
    "url": "https://x.com/EmmanuelMacron/status/1905352446563484096",
    "created_at": "Thu Mar 27 20:13:17 +0000 2025",
    "text": "Over $27 billion have been mobilized at the Nutrition for Growth Summit in Paris to fight against food insecurity.\n\nWe must pursue relentlessly this battle for peace and for our planet. https://t.co/VXz6Q81onA",
    "likes": 1600,
    "retweets": 343,
    "replies": 500,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1905351299907912054",
    "url": "https://x.com/EmmanuelMacron/status/1905351299907912054",
    "created_at": "Thu Mar 27 20:08:44 +0000 2025",
    "text": "Plus de 27 milliards de dollars ont été mobilisés au Sommet Nutrition for Growth de Paris pour lutter contre l'insécurité alimentaire.\n\nUn combat pour la paix et pour notre planète que nous devons poursuivre sans relâche. https://t.co/eGjbtmtRiS",
    "likes": 1518,
    "retweets": 349,
    "replies": 605,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1905346968467247538",
    "url": "https://x.com/EmmanuelMacron/status/1905346968467247538",
    "created_at": "Thu Mar 27 19:51:31 +0000 2025",
    "text": "Honored to meet the King of Lesotho.\n\nWe are coming together in Paris for a vital cause: the fight against food insecurity and the improvement of food quality.\n\nA world without hunger—this is the ambition we champion at the Nutrition for Growth Summit.",
    "likes": 1393,
    "retweets": 205,
    "replies": 263,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1905344566544548164",
    "url": "https://x.com/EmmanuelMacron/status/1905344566544548164",
    "created_at": "Thu Mar 27 19:41:58 +0000 2025",
    "text": "Heureux de rencontrer le Roi du Lesotho.\n\nNous nous retrouvons à Paris pour un combat essentiel : la lutte contre l’insécurité alimentaire et l’amélioration de la qualité de l’alimentation.\n\nUn monde sans faim : voilà l’ambition que nous portons au Sommet Nutrition for Growth.",
    "likes": 1210,
    "retweets": 215,
    "replies": 627,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1901319788049150291",
    "url": "https://x.com/EmmanuelMacron/status/1901319788049150291",
    "created_at": "Sun Mar 16 17:08:56 +0000 2025",
    "text": "Il y a cinq ans, notre pays s’apprêtait à affronter l’une des épreuves les plus difficiles de son histoire récente, le Covid-19.\n                                  \nLa France s’est confinée. Mais jamais elle ne s’est arrêtée. Face à l’inconnu, face à l’épreuve, elle s’est unie.\n\nLes Françaises et les Français ont fait face avec courage. Nous avons pris soin les uns des autres. Nous avons fait preuve de solidarité dans les moments les plus durs, de résilience quand tout semblait vaciller.\n\nChaque soir à 20h, quand le silence des rues semblait figer le pays, des millions de mains faisaient résonner l’espoir. Aux fenêtres, les Français applaudissaient et frappaient sur des casseroles pour dire « merci », battement de cœur collectif en hommage à celles et ceux qui nous soignaient et nous protégeaient.\n\nNos soignants n’ont pas compté leurs heures. En première ligne, exemplaires, héroïques, ils ont sauvé un nombre incalculable de vies. \n\nÀ leurs côtés, les enseignants ont continué de transmettre le savoir. Les agriculteurs, transporteurs et caissiers ont nourri la Nation. Tandis que des millions de Français ont dû stopper leur activité, les éboueurs, agents d’entretien et postiers, nos forces de l’ordre, nos pompiers et nos militaires, ont assuré l’essentiel. Les chercheurs ont avancé sans relâche pour comprendre et lutter. Tous ont tenu le pays debout.\n\nComme ont tenu le pays debout ceux qui se sont engagés pour fabriquer des masques et, le jour venu, pour vacciner, vacciner, vacciner.\n\nCinq ans après, je pense avec émotion au décompte quotidien des victimes et à toutes ces familles qui ont perdu un être cher. Aux familles qui aujourd’hui encore ont le sentiment de ne pas avoir pu dire au revoir dignement. \n\nJe pense aux drames humains, aux douleurs silencieuses et aux déchirements tus. Je pense à notre jeunesse qui a souvent souffert de la solitude et a accepté de sacrifier des mois parmi les plus beaux pour protéger les plus vulnérables.\n\nLe Covid-19 a bouleversé nos vies.\n\nMais il a aussi révélé la force de notre unité qui ne doit jamais cesser de nous inspirer et de nous guider.\n\nEnsemble il y a cinq ans.\nEnsemble aujourd’hui.\nEnsemble pour demain.",
    "likes": 5490,
    "retweets": 976,
    "replies": 5406,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1898103784099774950",
    "url": "https://x.com/EmmanuelMacron/status/1898103784099774950",
    "created_at": "Fri Mar 07 20:09:41 +0000 2025",
    "text": "Cette initiative a déjà sauvé plusieurs vies. Bravo et merci aux équipes du Centre hospitalier Nord Ardennes !",
    "likes": 2034,
    "retweets": 400,
    "replies": 1247,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1887779256660341191",
    "url": "https://x.com/EmmanuelMacron/status/1887779256660341191",
    "created_at": "Fri Feb 07 08:23:42 +0000 2025",
    "text": "Pour Charlotte et Arthur à qui j’ai répondu hier sur TikTok, pour nos compatriotes qui ont besoin d’un fauteuil roulant pour se déplacer : les choses bougent.\n\nVoici la liste des fauteuils roulants intégralement remboursés à partir du 1er décembre : https://t.co/DF4JLmNMxN",
    "likes": 1640,
    "retweets": 468,
    "replies": 1090,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1886829523389305183",
    "url": "https://x.com/EmmanuelMacron/status/1886829523389305183",
    "created_at": "Tue Feb 04 17:29:48 +0000 2025",
    "text": "Je souhaite que l’on mette collectivement le Sommet pour l’action sur l'intelligence artificielle au service de la médecine et de la recherche en sciences du vivant. https://t.co/cHlCMe9p2U",
    "likes": 2190,
    "retweets": 539,
    "replies": 1428,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1886827842291614199",
    "url": "https://x.com/EmmanuelMacron/status/1886827842291614199",
    "created_at": "Tue Feb 04 17:23:07 +0000 2025",
    "text": "Journée mondiale contre le cancer.\n\nGratitude envers nos soignants, chercheurs et entrepreneurs qui incarnent l’espoir.\n\nÀ Gustave Roussy, premier centre de lutte contre le cancer en France et en Europe, nous écrivons un nouveau chapitre pour mieux soigner et sauver des vies. https://t.co/dse0XNADM3",
    "likes": 1820,
    "retweets": 443,
    "replies": 716,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1884682634741113317",
    "url": "https://x.com/EmmanuelMacron/status/1884682634741113317",
    "created_at": "Wed Jan 29 19:18:50 +0000 2025",
    "text": "向所有庆祝农历新年的同胞和朋友们拜年，祝你们蛇年身体健康、富足安乐。\n\n愿这个佳节成为你们与亲友共享欢乐时刻的机会。",
    "likes": 979,
    "retweets": 100,
    "replies": 151,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1884681808303796566",
    "url": "https://x.com/EmmanuelMacron/status/1884681808303796566",
    "created_at": "Wed Jan 29 19:15:33 +0000 2025",
    "text": "Tôi xin gửi đến toàn thể đồng bào và những người bạn đang đón Tết Nguyên Đán lời chúc cho một năm Ất Tỵ tràn đầy sức khỏe, thịnh vượng và hạnh phúc. Tôi mong rằng thời khắc lễ hội này là dịp để quý vị chia sẻ những khoảnh khắc ấm áp bên người thân.",
    "likes": 249,
    "retweets": 48,
    "replies": 77,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1871516211906744483",
    "url": "https://x.com/EmmanuelMacron/status/1871516211906744483",
    "created_at": "Tue Dec 24 11:20:10 +0000 2024",
    "text": "Françaises, Français,\n\nDurant les fêtes, nous allons nous réunir en famille et partager des moments de retrouvailles, de joie et d’espérance.\n                \nNous aurons une pensée fraternelle pour nos concitoyens dans l’épreuve, la maladie ou la solitude, et pour les Mahorais qui font face après ce terrible cyclone, s’entraident, s’apprêtent à rebâtir ensemble.\n\nNous aurons une pensée de gratitude et de respect, pour les femmes et les hommes qui se dévouent au service du pays, qui nous soignent, nous éduquent, nous protègent.\n\nPouvoir compter les uns sur les autres, c’est ce qui fait la Nation. La France puise sa force en chacun de vous, en nous tous.\n\nJoyeux Noël et belles fêtes de fin d’année.",
    "likes": 7472,
    "retweets": 1107,
    "replies": 3072,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1869493834046128312",
    "url": "https://x.com/EmmanuelMacron/status/1869493834046128312",
    "created_at": "Wed Dec 18 21:23:58 +0000 2024",
    "text": "Décollage pour Mayotte avec quatre tonnes de fret alimentaire et sanitaire ainsi que des forces qui viennent prêter main forte à leurs camarades déjà engagés auprès des Mahorais. https://t.co/Bz8KMP1SXN",
    "likes": 4182,
    "retweets": 673,
    "replies": 889,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1869099388787933593",
    "url": "https://x.com/EmmanuelMacron/status/1869099388787933593",
    "created_at": "Tue Dec 17 19:16:35 +0000 2024",
    "text": "Il y a 5 ans, je me suis engagé à ouvrir le campus de l'Académie de l'OMS à Lyon.\n\nAujourd’hui nous l’inaugurons.\n\nAu service de la santé de tous les peuples, cette maison commune va former des millions de professionnels de santé, encourager la recherche et l'innovation. https://t.co/ubb0dvs4XT",
    "likes": 1976,
    "retweets": 534,
    "replies": 992,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1854431935675687280",
    "url": "https://x.com/EmmanuelMacron/status/1854431935675687280",
    "created_at": "Thu Nov 07 07:53:21 +0000 2024",
    "text": "Insultes, moqueries, violences.\n                              \nVoilà le quotidien d’un jeune sur dix, à l’école et sur les réseaux sociaux.\n                                                                      \nJe vous parle là d’un fléau, le harcèlement.\n \nJe vous parle de vies retranchées peu à peu des autres, de destins brisés, d’enfances volées. De la boule au ventre pendant les cours, de drames intimes, de solitude, de honte.\n \nMais la honte, c’est le harcèlement.\n \nDepuis 2017 j’ai fait de cette cause, la lutte contre le harcèlement à l’école, une cause qui m’oblige.\n \nCela s’est traduit par des mesures :\n \nNous avons lancé le 30 18, un numéro et une application mobile gratuits pour signaler un fait de harcèlement et être accompagné. Il faut en parler encore et encore, le faire connaître de tous.\n \nNous avons créé un réseau de référents harcèlement pour venir en aide aux victimes et sensibiliser chaque communauté éducative. D’ici 2027, tout le personnel sera formé pour mieux accompagner.\n \nParce que les réseaux sociaux amplifient le harcèlement, nous avons interdit l’usage des téléphones portables à l’école et au collège.\n \nCes mesures ont commencé à porter leurs fruits, mais tant qu’il y aura du harcèlement, nous devrons redoubler nos efforts collectivement.\n \nJ’ai confiance en nous.\n \nConfiance dans l’État, dans les collectivités, dans l’École ; confiance dans la Justice ; toujours du côté des victimes et des familles.\n \nConfiance en nos enseignants. Je le dis à tous les jeunes de France : n’en doutez jamais, vos enseignants se lèvent chaque matin pour vous. Alors, si vous êtes harcelé, si vous êtes témoin de harcèlement, allez vers eux. Ils seront là.\n \nConfiance en tous les opérateurs du 30 18, engagés pour vous.\n \nConfiance dans les 67 000 collégiens et lycéens qui se sont portés volontaires pour être ambassadeurs de la lutte contre le harcèlement dans leur établissement. \n\nConfiance dans les 157 000 élèves qui ont participé au prix « Non au harcèlement ».\n \nIls sont notre fierté.\n \nAvec eux, tous ensemble, ne lâchons rien dans cette lutte.\n \nNe cédons rien aux premiers gestes, aux premiers mots, aux premiers messages qui dérapent sur les réseaux, aux premiers regards qui dénigrent, qui blessent, qui moquent. Tenons-nous toujours aux côtés des victimes et des familles.\n \nForgeons des âmes fraternelles et citoyennes, dans toutes nos écoles.\n \nCar la France c’est cela, la nation de la Fraternité.\n \nN’entamons rien de cette grande espérance : venir à bout, pour cette génération et les prochaines, du harcèlement.\n \nConfiance, engagement et espoir.\n \nJe compte sur chacun de vous.",
    "likes": 4834,
    "retweets": 930,
    "replies": 1880,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1816551537994342493",
    "url": "https://x.com/EmmanuelMacron/status/1816551537994342493",
    "created_at": "Thu Jul 25 19:10:11 +0000 2024",
    "text": "Du sport, du sport, du sport ! https://t.co/nM5CsyacKN",
    "likes": 3555,
    "retweets": 614,
    "replies": 1056,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1803813578270482933",
    "url": "https://x.com/EmmanuelMacron/status/1803813578270482933",
    "created_at": "Thu Jun 20 15:34:04 +0000 2024",
    "text": "À ceux qui considèrent que mettre les moyens pour accompagner l’Afrique est superflu et qu’il y a des économies à faire…\n\nJe dis avec force que notre engagement pour la santé mondiale sert la France et les Français. https://t.co/utoBFYUyYb",
    "likes": 1858,
    "retweets": 470,
    "replies": 2023,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1790478116546105571",
    "url": "https://x.com/EmmanuelMacron/status/1790478116546105571",
    "created_at": "Tue May 14 20:23:43 +0000 2024",
    "text": "One out of three people worldwide lacks access to clean cooking methods. In Africa, it's four out of five people, totaling one billion individuals.\n                                         \nSmoke from cooking with wood or charcoal causes hundreds of thousands of premature deaths each year, particularly among women and children, as well as intensive deforestation and CO2 emissions equivalent to those from the aviation and maritime sectors.\n\nAddressing this issue means protecting both people and the planet.\n\nThat's why, as part of the Paris Pact for People and the Planet, and with the commitment of Tanzania, Norway, the International Energy Agency, the African Development Bank, and many other partners, we are taking a step forward against this silent scourge today.\n\nWe are mobilizing $2.2 billion to provide clean alternatives to populations in Africa.\n\nFrance pledges to invest €100 million over five years in clean cooking methods and will mobilize even more through the Paris Pact for People and the Planet and Finance in Common.",
    "likes": 1055,
    "retweets": 253,
    "replies": 509,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1790474428846899534",
    "url": "https://x.com/EmmanuelMacron/status/1790474428846899534",
    "created_at": "Tue May 14 20:09:03 +0000 2024",
    "text": "Une personne sur trois dans le monde n’a pas accès à des modes de cuisson propres. En Afrique, c’est quatre personnes sur cinq, soit un milliard de personnes.\n     \nLes fumées dégagées par la cuisson au bois ou au charbon provoquent des centaines de milliers de morts prématurées chaque année, notamment chez les femmes et les enfants, ainsi qu’une déforestation intensive et des émissions de CO2 équivalentes à celles des secteurs aériens et maritimes.\n\nApporter une réponse à ce sujet, c’est protéger les peuples et la planète. \n\nC’est pourquoi, dans le cadre du Pacte de Paris pour les Peuples et la Planète et avec l’engagement de la Tanzanie, de la Norvège, de l'Agence internationale de l'énergie, de la Banque africaine de développement et de nombreux autres partenaires, nous faisons aujourd’hui un pas en avant contre un fléau silencieux. \n\nNous mobilisons 2,2 milliards de dollars pour fournir des alternatives aux populations en Afrique.\n\nLa France s'engage à investir 100 millions d'euros sur cinq ans pour les modes de cuisson propres et mobilisera encore plus grâce au Pacte de Paris pour les Peuples et la Planète et Finance in Common.",
    "likes": 2419,
    "retweets": 489,
    "replies": 2739,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1785565236667252973",
    "url": "https://x.com/EmmanuelMacron/status/1785565236667252973",
    "created_at": "Wed May 01 07:01:41 +0000 2024",
    "text": "Déterminer le bon usage des écrans pour nos enfants, à la maison comme en classe : c’est l'objet du rapport qui m'a été remis par la commission d'experts sur l'impact de l'exposition des jeunes aux écrans que j’avais lancée.\n                   \nJ’ai donné un mois au gouvernement pour examiner ses recommandations et les traduire en actions.\n\nMerci à tous les experts qui ont contribué à ce travail dense, riche et pertinent.",
    "likes": 2468,
    "retweets": 488,
    "replies": 1440,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1783198855032455487",
    "url": "https://x.com/EmmanuelMacron/status/1783198855032455487",
    "created_at": "Wed Apr 24 18:18:31 +0000 2024",
    "text": "Deux équipes mais un même but : améliorer le quotidien des enfants et des adolescents hospitalisés. Merci aux joueurs du @VarietesCF qui se mobilisent au profit des @PiecesJaunes. Le match se poursuit ! https://t.co/vQSiFaRO7H",
    "likes": 1590,
    "retweets": 309,
    "replies": 508,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1782662830174429475",
    "url": "https://x.com/EmmanuelMacron/status/1782662830174429475",
    "created_at": "Tue Apr 23 06:48:33 +0000 2024",
    "text": "Pour soutenir nos chercheurs et attirer les meilleurs, nous ouvrons les 22 premières chaires d'excellences en recherche en biologie et en santé, appuyées par 47 millions d’euros. Bravo à tous les lauréats !\n\nAvec France 2030, nous bâtissons notre souveraineté scientifique.",
    "likes": 1576,
    "retweets": 390,
    "replies": 576,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1777791939640738004",
    "url": "https://x.com/EmmanuelMacron/status/1777791939640738004",
    "created_at": "Tue Apr 09 20:13:22 +0000 2024",
    "text": "Given the humanitarian emergency in Gaza, France continues to deliver medication and food to the population.\n\nTogether with Jordan and other partners, today's airlift operation allowed the transportation of over 110 tons of cargo.\n\nThe effort is ongoing. https://t.co/wZLZiuDFx3",
    "likes": 1402,
    "retweets": 284,
    "replies": 524,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1777776602367090971",
    "url": "https://x.com/EmmanuelMacron/status/1777776602367090971",
    "created_at": "Tue Apr 09 19:12:26 +0000 2024",
    "text": "Face à l'urgence humanitaire à Gaza, la France continue de livrer des médicaments et des vivres à la population.\n\nAvec la Jordanie et d’autres partenaires, l’opération aérienne du jour a permis d’acheminer plus de 110 tonnes de fret.\n\nL’effort se poursuit. https://t.co/l25fnGpjDN",
    "likes": 2922,
    "retweets": 484,
    "replies": 1697,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1775260240919015513",
    "url": "https://x.com/EmmanuelMacron/status/1775260240919015513",
    "created_at": "Tue Apr 02 20:33:18 +0000 2024",
    "text": "Il ne sait interpréter ni les émotions, ni les expressions imagées, pourtant Paul El Kharrat est l’un des meilleurs en culture générale.\n\nLes manifestations de l'autisme varient d’une personne à une autre. Mieux connaître l’autisme, c’est mieux vivre ensemble, alors parlons-en !\n\nChacun a un rôle à jouer, une attention particulière à apporter à ce camarade, à ce collègue, à ce voisin.\n\nL'État a sa part.\n\nIl nous fallait améliorer le système de repérage précoce. Depuis la première stratégie nationale en 2018, plus de 70 000 enfants ont été repérés par les plateformes de coordination et d’orientation.\n\nIl nous fallait mieux accueillir les familles, savoir mieux orienter et former. \n\nLa Maison de l'autisme célèbre son premier anniversaire. Elle vient compléter les 28 centres ressources sur l’autisme qui informent, orientent, sensibilisent et forment.\n\nNous poursuivons les efforts pour un service public généralisé du repérage et de l’intervention précoce pour tous les enfants qui en ont besoin. 60 000 généralistes et pédiatres ont été formés.\n\nIl nous fallait mettre le paquet sur la recherche.\n\nNous comptons désormais 700 chercheurs, cinq centres d'excellence et un institut hospitalo-universitaire du cerveau de l’enfant : la France est devenue le premier pays européen en terme de projets de recherche en la matière.\n\nIl nous reste à faire, mais pour que chaque personne autiste puisse accéder à la scolarité, au travail, à un logement, les choses ont avancé : 45 000 élèves vont à l’École de la République ; 27 universités ont été accompagnées dans la mise en place d'un programme adapté ; plus de 400 habitats inclusifs ont été créés.\n\nCette stratégie, nous la poursuivons : pour 2023-2027, nous avons alloué 680 millions d’euros de moyens.\n\nUn mot pour tous les professionnels de santé, pour les familles et les proches qui se mobilisent pour accompagner nos compatriotes qui vivent avec l'autisme : merci.\n\nÀ vos côtés, nous continuerons d’agir.",
    "likes": 4213,
    "retweets": 795,
    "replies": 698,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1775129719110820013",
    "url": "https://x.com/EmmanuelMacron/status/1775129719110820013",
    "created_at": "Tue Apr 02 11:54:40 +0000 2024",
    "text": "This is the most precise image of the brain ever obtained, thanks to the CEA's MRI scanner, the most powerful in the world.\n\nIt's a major breakthrough and a huge hope for the study of our health. Congratulations to the Iseult project team.\n\nIconic! https://t.co/KLPcloAORD",
    "likes": 4487,
    "retweets": 709,
    "replies": 388,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1775124972920332702",
    "url": "https://x.com/EmmanuelMacron/status/1775124972920332702",
    "created_at": "Tue Apr 02 11:35:48 +0000 2024",
    "text": "Voici l’image du cerveau la plus précise de l’Histoire, obtenue grâce au scanner IRM du CEA, le plus puissant au monde.\n\nC’est une avancée majeure et un espoir immense pour l’étude de notre santé. Félicitations à l’équipe du projet Iseult.\n\nFierté française ! https://t.co/UGSm2RtvwU",
    "likes": 10576,
    "retweets": 1266,
    "replies": 1284,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1771849569690616236",
    "url": "https://x.com/EmmanuelMacron/status/1771849569690616236",
    "created_at": "Sun Mar 24 10:40:31 +0000 2024",
    "text": "En ce week-end de Sidaction, un rappel important à tous les moins de 26 ans :\n\nPour vous, les préservatifs sont gratuits.\n\nDepuis mon annonce, 16,7 millions ont déjà été distribués en pharmacie. Profitez-en. Continuez de vous protéger !",
    "likes": 3254,
    "retweets": 506,
    "replies": 1761,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1767100173241528629",
    "url": "https://x.com/EmmanuelMacron/status/1767100173241528629",
    "created_at": "Mon Mar 11 08:08:07 +0000 2024",
    "text": "Accompagner la fin de vie.\n\nJe m'y suis engagé : nous allons présenter une loi de fraternité qui concilie l’autonomie de l’individu et la solidarité de la Nation.\n                      \nNous voulons ouvrir la possibilité de demander une aide à mourir dans des conditions strictes : \n\n- Être majeur.\n\n- Être capable d’un discernement plein et entier. Sont exclus de cette aide les patients atteints de maladies psychiatriques ou de maladies neurodégénératives qui altèrent le discernement, comme Alzheimer. \n\n- Souffrir d’une maladie incurable, avec un pronostic vital engagé à court ou moyen terme et des souffrances réfractaires.\n\nNous avons consulté les patients, les familles, les équipes soignantes, la société, pour constater que la loi Claeys-Leonetti, qui fixe le cadre légal actuel, avait conduit à beaucoup d’avancées mais ne permettait pas de répondre à des situations humainement très difficiles.\n\nOn peut penser aux cas de patients atteints d’un cancer au stade terminal qui, pour certains, sont obligés d’aller à l’étranger pour être accompagnés.        \n\nIl fallait aller plus loin, en faisant preuve d’une exigence éthique.\n\nPour préparer ce texte de loi, nous nous sommes appuyés sur l’avis du Comité consultatif national d'éthique et sur les travaux de la Convention citoyenne qui a mené un immense travail, empreint de respect et de gravité, auquel je veux rendre hommage. Une réflexion transpartisane a été engagée.\n\nLe projet de loi sera composé d’une première partie sur les soins d’accompagnement, d’une deuxième sur le droit des patients et des aidants et d’une troisième sur l’aide à mourir.\n\nUne stratégie décennale sur les soins palliatifs et l'accompagnement de la douleur.\n\nLa priorité : que dès le diagnostic et le début du traitement, la douleur soit accompagnée avec humanité.\n\nNous consacrons actuellement 1,6 milliards d’euros aux soins d’accompagnement. Nous allons investir 1 milliard de plus.\n\nIl nous faut continuer de déployer des équipes mobiles qui aident les services hospitaliers à mieux prendre en charge la douleur.\n\nIl s’agit aussi de doter d’une unité de soins palliatifs les 21 départements qui en sont encore dépourvus.\n\nIl est primordial d’améliorer la prise en charge de la douleur notamment des nourrissons et des enfants. Nous le ferons aussi avec cette loi et cette stratégie décennale.\n\nNous allons aussi mettre en place un continuum avec la médecine de ville et investir sur l'accompagnement à domicile appuyé par les réseaux de soins.\n\nJ’insiste sur l’importance des actions que nous allons déployer sur les soins palliatifs avant même que la loi soit promulguée.\n\nAvec ce texte et la stratégie décennale en préparation, nous allons remettre les soins palliatifs au cœur de l’accompagnement. \n\nCe sera une vraie révolution d’humanité et de fraternité.\n\nNous avancerons de la manière la plus transparente possible.\n\nC'est un texte sur lequel il faut avoir l'humilité de cheminer, de bouger, accepter que ses convictions puissent être bousculées. \n\nJe donne plus de détails sur ces annonces dans La Croix et Libération.",
    "likes": 3527,
    "retweets": 731,
    "replies": 1450,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1766148926669734260",
    "url": "https://x.com/EmmanuelMacron/status/1766148926669734260",
    "created_at": "Fri Mar 08 17:08:12 +0000 2024",
    "text": "Le sceau de la République scelle aujourd’hui un long combat pour la liberté, celle pour toutes les femmes de pouvoir recourir à l'interruption volontaire de grossesse. https://t.co/1oaSKIgoNN",
    "likes": 3836,
    "retweets": 599,
    "replies": 1014,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1762943876841541931",
    "url": "https://x.com/EmmanuelMacron/status/1762943876841541931",
    "created_at": "Wed Feb 28 20:52:28 +0000 2024",
    "text": "Fiertés françaises.\n     \nBienvenue à l’Élysée, chers grands sportifs, vous qui porterez nos couleurs cet été, à domicile !\n\nOn compte sur vous pour monter sur les podiums. Comptez sur nous pour vous y porter et vous soutenir, toujours.\n                 \nÀ nos grands athlètes :\n \nVous faites rêver les Français et rayonner la France. La Nation sera derrière vous, toujours. \n\nVous saurez me trouver à vos côtés et celui de vos proches, depuis la tribune ou le bord du terrain, comme face aux défis qu’impliquent votre vocation sportive.\n\nPour soutenir tous nos grands sportifs dans leur pratique et dans leur vie, il fallait des moyens. Nous en avons alloué à un niveau inédit.\n\nLe budget de l'État dédié aux sportifs, aux fédérations et à la haute performance paralympique a augmenté de 68 % depuis les Jeux de Rio il y a cinq ans. Il s’élève aujourd’hui à 114 millions d’euros par an. C’est sans précédent.\n\nAujourd’hui, plus de 3000 sportifs bénéficient d’aides financières personnalisées ou d’un dispositif socio-professionnel qui intègre une rémunération.\n\nNous avons fait beaucoup au niveau de l’État. Nous avons créé une agence, établi une stratégie partagée et des moyens.\n\nJ’assure tous nos grands sportifs de mon plein soutien et d'un accompagnement sans faille de l'État.\n\nLes Jeux olympiques et paralympiques de Paris 2024 donneront en héritage l'envie de sport et des infrastructures modernes, nécessaires à notre Nation sportive.\n\nDemain, j'inaugurerai le village olympique et paralympique qui au-delà de son ambition de fournir un accueil optimal aux athlètes, deviendra au lendemain des Jeux un vrai morceau de ville pour les habitants de Seine-Saint-Denis.\n\nMais de manière plus générale, notre projet repose sur une vision claire de la Nation sportive que nous sommes en train de bâtir :\n \n→ On sait pourquoi on veut le faire : pour lutter contre la sédentarité, agir sur la cohésion sociale, contribuer à l’émancipation de nos enfants, créer de l’emploi et de l’activité économique sur un secteur à fort potentiel, améliorer la qualité de vie au travail.\n \n→ On sait comment on souhaite le porter : en changeant culturellement, à la racine, dès l’école, le rapport des Français au sport au travers d’une politique qui encourage et facilite la pratique.\n \n→ Notre projet, ce ne sont pas que des mots. Ce sont des réformes et des moyens : les 30 minutes de sport au primaire, les 2h au collège (périscolaire), les tests d’aptitude en 6ème, le passage de 10 000 à 25 000 classes de sport études, le Pass Sport, les plans 5000 terrains puis Génération 2024, les 1000 coachs socio-sportifs, les maisons sport-santé, la prise en charge de la pratique sportive par la Sécurité sociale dans certains parcours de soins, les 3000 nouveaux clubs para accueillants, etc.\n \nEt nous avons de premiers résultats : record de licenciés dans toutes les fédérations ou presque, record de pratiquants hors fédération !\n \nLa Nation sportive, ce n’est pas que l’État sportif. Chacun doit jouer sa part.\n \nLes collectivités font beaucoup.\n \nLes acteurs de terrain, aussi.\n \nEt j’ai besoin de vous !\n\nPar vos expressions et ce que vous incarnez, en étant des exemples, des modèles pour beaucoup, par vos engagements auprès des jeunes, par vos résultats tout simplement, vous participez à cette grande ambition du pays pour le bien-être et la santé de l’ensemble de nos concitoyens.\n\nVive le sport et vivement Paris 2024 !",
    "likes": 2125,
    "retweets": 383,
    "replies": 771,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1762579416759062827",
    "url": "https://x.com/EmmanuelMacron/status/1762579416759062827",
    "created_at": "Tue Feb 27 20:44:14 +0000 2024",
    "text": "وصلت إلى مرفأ العريش دفعة جديدة من المساعدات الإنسانية والطبيّة التي تزِن 75 طنًا وتتألف من 10 سيارات إسعاف وحصص غذائية و300 خيمة عائلية أُرسلتها فرنسا وقطر أمس إلى سكان قطاع غزّة. https://t.co/L8fVl4Af23",
    "likes": 591,
    "retweets": 116,
    "replies": 283,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1762492205300642179",
    "url": "https://x.com/EmmanuelMacron/status/1762492205300642179",
    "created_at": "Tue Feb 27 14:57:41 +0000 2024",
    "text": "75 tonnes of freight, 10 ambulances, food rations, 300 family tents: yesterday, France and Qatar chartered new humanitarian and medical aid, which arrived in Al-Arish.\n\nDestination: the people of Gaza. https://t.co/ETwE5Afcsa",
    "likes": 1351,
    "retweets": 266,
    "replies": 506,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1762488781289013480",
    "url": "https://x.com/EmmanuelMacron/status/1762488781289013480",
    "created_at": "Tue Feb 27 14:44:05 +0000 2024",
    "text": "75 tonnes de fret, 10 ambulances, des rations alimentaires, 300 tentes familiales : la France et le Qatar ont affrété hier une nouvelle aide humanitaire et médicale, arrivée à Al-Arish.\n\nDestination : la population de Gaza. https://t.co/zjM7fURR7K",
    "likes": 2145,
    "retweets": 418,
    "replies": 980,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1747409338900054037",
    "url": "https://x.com/EmmanuelMacron/status/1747409338900054037",
    "created_at": "Wed Jan 17 00:03:46 +0000 2024",
    "text": "Pour relancer la natalité de la France, nous allons créer un nouveau congé de naissance mieux rémunéré pour les parents et engager un grand plan de lutte contre l'infertilité qui progresse et fait souffrir tant de couples.",
    "likes": 4129,
    "retweets": 458,
    "replies": 2612,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1737868774638756346",
    "url": "https://x.com/EmmanuelMacron/status/1737868774638756346",
    "created_at": "Thu Dec 21 16:12:58 +0000 2023",
    "text": "Main dans la main.\n                                 \nAvec la Jordanie, nous l’étions déjà en novembre à la conférence humanitaire de Paris, puis à la conférence d'Amman.\n                                      \nNous le sommes toujours.\n\nFace à l'urgence humanitaire absolue à Gaza, nous ne ménageons pas nos efforts conjoints en vue d’obtenir un cessez-le-feu dès que possible et de répondre aux besoins urgents des populations.\n\nLa France a consacré 100 millions d'euros à l'aide aux Gazaouis, dont près d’1 million d’euros à l'achat de médicaments, d'équipements médicaux et de 10 ambulances, au profit des deux hôpitaux de campagne jordaniens à Gaza. En partenariat avec l'Organisation caritative hachémite de Jordanie, cette aide contribue aux efforts des services médicaux royaux en soutien à la population civile de Gaza.\n\nPour acheminer l’aide humanitaire, j’exprime aujourd’hui mon soutien à la création d'une plateforme humanitaire pour Gaza en Jordanie. \n\nLa France y participe déjà. Un premier vol est arrivé aujourd’hui à Amman avec 11 tonnes de fret humanitaire. Il s’agit d’abris et d’équipements de première nécessité. Un deuxième suivra dans les prochains jours. Nous sommes mobilisés pour que davantage d'aide soit acheminée.\n\nMobilisés, nous le sommes également pour rouvrir un horizon politique autour de la solution à deux États. C’est la condition essentielle pour garantir la sécurité d'Israël sur le long terme et répondre aux aspirations légitimes des Palestiniens. Pour y arriver, les efforts de la communauté internationale seront décisifs.\n\nMerci au Roi Abdallah II pour nos échanges aujourd’hui à Aqaba.\n\nCe soir je serai auprès de nos militaires déployés sur la base aérienne projetée au Levant. Ils luttent contre Daech dans le cadre de l'opération Inherent Resolve, là-encore, main dans la main.",
    "likes": 1556,
    "retweets": 376,
    "replies": 1061,
    "author": "Emmanuel Macron"
  },
  {
    "username": "EmmanuelMacron",
    "tweet_id": "1737595706049740970",
    "url": "https://x.com/EmmanuelMacron/status/1737595706049740970",
    "created_at": "Wed Dec 20 22:07:53 +0000 2023",
    "text": "Sur la question de la fin de vie, nous voulons apporter plus d'humanité à des femmes et à des hommes qui vivent dans le désarroi et la douleur.\n\nNous le ferons en bâtissant un modèle français des soins palliatifs, en accompagnant avec humanité. https://t.co/TutADVRGUL",
    "likes": 1241,
    "retweets": 339,
    "replies": 735,
    "author": "Emmanuel Macron"
  }
]