[
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1983502452511891767",
    "url": "https://x.com/KagutaMuseveni/status/1983502452511891767",
    "created_at": "Wed Oct 29 11:53:31 +0000 2025",
    "text": "Maata Nakapiripirit, Maata Karamojong!\nMaama and I visited Nakapiripirit today to rally support for the NRM and remind our people why we must continue supporting the Movement.\n\nPeace in Karamoja was not easy to achieve. Some once believed guns were the solution, but I assured our people that the government would defend them, and we have fulfilled that promise. Today, the region enjoys peace and stability under the NRM.\n\nNakapiripirit now has roads, electricity, phones, and clean water in some villages. We have built several valley tanks, with bigger schemes like Namalu Irrigation underway.\n\nThe district has 27 primary and 7 secondary schools, one HCIV, three HCIIIs, and a functional X-ray at Tokora HCIV. These developments in roads, water, electricity, education, and health reflect what the NRM has done and will continue to do for Uganda.",
    "likes": 581,
    "retweets": 239,
    "replies": 150,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1982055961356374348",
    "url": "https://x.com/KagutaMuseveni/status/1982055961356374348",
    "created_at": "Sat Oct 25 12:05:40 +0000 2025",
    "text": "Maata Karenga! Today, I addressed the people of Karenga, reflecting on our 40 years of progress and the journey ahead. Peace has been our foundation. Where cattle rustling once brought death and fear, we brought security and order through successful disarmament.\n\nNow, Karamoja enjoys peace and our children are in school, health services have improved, and electricity has reached Karenga. The next phase is better roads: connecting Kitgum–Namukora–Karenga–Kidepo and upgrading Moroto–Kotido–Kaabong. Alakara noi!",
    "likes": 853,
    "retweets": 474,
    "replies": 306,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1980233051662598557",
    "url": "https://x.com/KagutaMuseveni/status/1980233051662598557",
    "created_at": "Mon Oct 20 11:22:05 +0000 2025",
    "text": "Even where corruption by some officials has caused challenges, we have provided alternatives like the skilling hubs, whose success we have demonstrated across Uganda.\nOn health, the main problem remains theft of drugs in government facilities. We shall use computers and trusted, God-fearing people to monitor this vice.\nOn wealth creation, our message is taking root, as the Sheikh in Adjumani reminded us.\n\nI thank the people of Pakwach, Nebbi, Zombo, Obongi, Madi-Okollo, Arua, Koboko, Yumbe, Moyo, Terego, Maracha, and Adjumani for the warmth and support. Continue supporting NRM, and we shall do even more. Manzora!",
    "likes": 278,
    "retweets": 137,
    "replies": 43,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1978868744790192172",
    "url": "https://x.com/KagutaMuseveni/status/1978868744790192172",
    "created_at": "Thu Oct 16 17:00:49 +0000 2025",
    "text": "In education, our goal is to ensure free and quality education for all, strengthening UPE and USE, complemented by the Presidential Industrial Skilling Hubs for practical skills development.\n\nYumbe’s Regional Referral Hospital is expanding with new wards, and safe water coverage is at 77%, with more systems being implemented. \n\nTherefore Yumbe’s progress is a tangible result of NRM’s efforts against poverty and inequality, emphasizing that true Uzalendo involves unity and cooperation for the benefit of all Ugandans.",
    "likes": 223,
    "retweets": 119,
    "replies": 28,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1978812859841978683",
    "url": "https://x.com/KagutaMuseveni/status/1978812859841978683",
    "created_at": "Thu Oct 16 13:18:45 +0000 2025",
    "text": "I was glad to open the new Leju Stadium, a valuable addition to Terego District's social infrastructure.\n\nRegarding social services, Terego has 73 primary schools and 8 secondary schools across 42 parishes, but some still lack primary schools, indicating uneven distribution. We will correct this, ensuring every parish without a primary school gets one, and each sub-county without a secondary school also receives one.\n\nTerego has seven sub-counties; one has a Health Centre IV, and five have Health Centre IIIs. Only two lack any health Centre, and we will work to establish coverage for all, including a district hospital.",
    "likes": 903,
    "retweets": 451,
    "replies": 493,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1977764676101386376",
    "url": "https://x.com/KagutaMuseveni/status/1977764676101386376",
    "created_at": "Mon Oct 13 15:53:38 +0000 2025",
    "text": "In Arua District and Arua City, there are a total of 120 government primary schools, with 50 in the district and 70 in the city. Additionally, Arua District has 7 government secondary schools, while Arua City has 9. For someone who has been here for a long time, seeing this progress makes me very happy.\n\nOn health, our plan in the next government is to upgrade Orivu Health Centre III to a Health Centre IV in Ayivu Division East, and to upgrade Lazebu Health Centre II to a Health Centre III in Arivu Sub-county.\n\nOn wealth, if you have no income in your home, you create problems not only for your family but also for the country. The government receives taxes from what people buy. When you have no money, you are not contributing to your family or your nation. I, therefore, urge everyone to be active in wealth creation and ask that you support NRM in order to continue the battle against poverty. \n\nTomorrow, we continue in Maracha and Koboko Districts.",
    "likes": 2238,
    "retweets": 616,
    "replies": 396,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1976982664151281743",
    "url": "https://x.com/KagutaMuseveni/status/1976982664151281743",
    "created_at": "Sat Oct 11 12:06:12 +0000 2025",
    "text": "Maama Janet and I gladly addressed a rally in Nebbi. I recall In 1961, I was at Ntare School, and there were many boys from West Nile. They came to Ntare School because there was not a single A’Level school in the entire Northern and Eastern Uganda. There were only six A’Level schools in Uganda. So, when I see eight A’Level schools in Nebbi alone, as a district in West Nile, I am very happy because I know where we came from and where we are heading.\n\nIn terms of health, there are sixteen sub-counties, and ten of them have health centres in Nebbi; only six do not. We are committed to ensuring that the remaining six also receive facilities.\n\nOn electricity, I am glad that finally West  Nile is linked to the national grid all the way to Koboko.\n\nI, therefore, ask the  people of Nebbi to vote for the NRM to enable us continue with our path to achieving a High Income middle status.",
    "likes": 1856,
    "retweets": 546,
    "replies": 631,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1976029235606110567",
    "url": "https://x.com/KagutaMuseveni/status/1976029235606110567",
    "created_at": "Wed Oct 08 20:57:37 +0000 2025",
    "text": "Congratulations to Quality Chemical Industries Limited on their 20th anniversary and the groundbreaking of their new  28,000-square-metre state-of-the-art manufacturing facility.\n \nThis milestone as we celebrate Uganda’s Independence is what the NRM has been talking about all this time.  We must stop the hemorrhage of resources from our country. The  money we spend on imports can build about 40 factories in Uganda and create over one million jobs.\n\nWe resolved that Uganda must produce its own essential HIV and Malaria vaccines and I am very happy to  witness this vision being fulfilled. I congratulate them.",
    "likes": 1263,
    "retweets": 381,
    "replies": 454,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1974498105107058894",
    "url": "https://x.com/KagutaMuseveni/status/1974498105107058894",
    "created_at": "Sat Oct 04 15:33:27 +0000 2025",
    "text": "I commissioned new officer cadets at Kabamba today. I congratulate the new officers on their achievement and also thank the Chief of Defense Forces (CDF) and his commanders for the excellent work they have done in training the officers. With the new officers, as well as all the other serving officers and men in the Uganda People's Defense Force (UPDF), there are four words I left with them:\n\n1. Health (Afya)– Look after yourselves.\n2. Discipline (Nidhamu)– You cannot be a soldier if you are not disciplined. It is discipline that allows you to coordinate with all the other soldiers.\n3. Patriotism (Uzalendo)– You cannot be an army of Uganda if you have a colonial mentality of inferiority complex or dependence. It is very important for you to know why you are a soldier of Uganda (understanding our principles: Patriotism, Pan-Africanism, Socio-Economic Transformation, Democracy).\n4. Knowledge (Utalaamu)– You must be very knowledgeable in military matters (warfare). You need to understand modern warfare.",
    "likes": 3010,
    "retweets": 612,
    "replies": 243,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1973063096043471058",
    "url": "https://x.com/KagutaMuseveni/status/1973063096043471058",
    "created_at": "Tue Sep 30 16:31:14 +0000 2025",
    "text": "Maama Janet and I spent Day 1 of the campaigns in Luwero, and I took the opportunity to update the bazzukulu On the NRM’s achievements since taking over government and to share our vision for poverty alleviation. \n\nFrom the time we stood with their parents in Luwero to today, I can proudly say that Uganda has transformed. The only thing left for us to do is to loosen the grip of poverty by utilizing government programs.\nHere are some key achievements I  highlighted: \n\n✅ UPE Schools: We’ve increased the number from 30 in 1986 to 488 today.  \n✅ Health Centres: We’ve expanded from 5 in 1986 to 88 now.  \n✅ Clean Water Points: We’ve grown from 27 in 1986 to over 2,000 today, with 1,371 in Luwero alone.  \n✅ PDM Funding: We have allocated 72 billion shillings to the Parish Development Model.",
    "likes": 1107,
    "retweets": 394,
    "replies": 351,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1970517969642877238",
    "url": "https://x.com/KagutaMuseveni/status/1970517969642877238",
    "created_at": "Tue Sep 23 15:57:49 +0000 2025",
    "text": "We are going to fight the theft of drugs at the health centers. It is not true that the government cannot provide efficient healthcare. For example, the immunization program is working very well; that is why I do not see anyone with polio in this generation. These are all children of the NRM, so if immunization can be successful, then all other efforts can be effective as well.",
    "likes": 1954,
    "retweets": 632,
    "replies": 605,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1970430968335929370",
    "url": "https://x.com/KagutaMuseveni/status/1970430968335929370",
    "created_at": "Tue Sep 23 10:12:06 +0000 2025",
    "text": "Our priorities for this term include:\n\n1. Wealth creation: Everybody should be involved in the money economy. \n2. Education: All children in government primary and secondary schools should study for free. \n3. Infrastructure: Roads should be tarmaced on time and maintain the murram roads should be maintained. \n4. Crime: There is peace in the country but there's a bit of crime and impunity. The NRM structures should come out and fight them. \n5. Corruption: We should get rid of it. \n6. Health: Immunisation is doing very well. We should also ensure the drugs are not stolen. \n7. Water: Have safe clean water for all villages.",
    "likes": 286,
    "retweets": 131,
    "replies": 258,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1965837890002551151",
    "url": "https://x.com/KagutaMuseveni/status/1965837890002551151",
    "created_at": "Wed Sep 10 18:00:51 +0000 2025",
    "text": "We have many successful Ismailis in Uganda, and I am pleased with the significant investments they have made in the health, education, and tourism sectors. We discussed the critical need for an integrated East African Community market, which is essential for everyone. https://t.co/yvaF2hWZ52",
    "likes": 184,
    "retweets": 73,
    "replies": 13,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1965837515857998277",
    "url": "https://x.com/KagutaMuseveni/status/1965837515857998277",
    "created_at": "Wed Sep 10 17:59:21 +0000 2025",
    "text": "I warmly welcome His Highness Prince Rahim Al-Hussaini Aga Khan V to Uganda and offer my condolences for his father's death. Tomorrow, we will commission the Aga Khan University and begin construction on the Aga Khan Hospital. https://t.co/kBEufNcM34",
    "likes": 1831,
    "retweets": 455,
    "replies": 98,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1960018118102622719",
    "url": "https://x.com/KagutaMuseveni/status/1960018118102622719",
    "created_at": "Mon Aug 25 16:35:09 +0000 2025",
    "text": "Today at Nakasero, I met a team of American researchers who are collaborating with us to develop innovative treatments for cancer and diabetes derived from our plants. I welcome them. https://t.co/Rk8vmztD4K",
    "likes": 1523,
    "retweets": 347,
    "replies": 279,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1959971701220868289",
    "url": "https://x.com/KagutaMuseveni/status/1959971701220868289",
    "created_at": "Mon Aug 25 13:30:42 +0000 2025",
    "text": "Today, I opened the first meeting of the 4th National Conference of the NRM. \n\nI would like to congratulate all the members who have been elected. It is encouraging to see leaders stepping forward to continue the work that the elders began. \n\nOur slogan is: \"Protecting the Gains as We Make a Qualitative Leap into High Middle-Income Status.\" \n\nTo achieve this in the upcoming term, we must focus on the following areas:\n\n1. Fighting poverty.\n2. Combating corruption. We should not allow corrupt people to undermine the  progress of the NRM. \n3. Ensuring that the police effectively fight crime. If they do not, they should be reported. \n4. Maintaining the roads properly. We allocate 1.3 billion per district every year for the maintenance of existing roads.\n5. We will continue to insist on free education in government schools.\n6. Improved access to healthcare.\n7. Ensuring access to clean water.\n\nIf we successfully address these issues,  I am confident we shall make that qualitative leap into High Middle-Income status.\n\nI will share more on Wednesday.",
    "likes": 288,
    "retweets": 116,
    "replies": 104,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1955257768878776626",
    "url": "https://x.com/KagutaMuseveni/status/1955257768878776626",
    "created_at": "Tue Aug 12 13:19:13 +0000 2025",
    "text": "I commend Egypt for its support in providing Uganda with foot-and-mouth disease vaccines and welcome the decision to establish a vaccine factory in Uganda. Economic cooperation should be at the core of Africa's progress. I am pleased that His Excellency is prioritizing business initiatives. Together, we will explore ways to produce, trade, create jobs, and develop electricity and irrigation for our people.\n\nSeveral Memoranda of Understanding (MOUs) were signed across various sectors, including trade and investment, agriculture, water management, community development, and diplomatic engagement.",
    "likes": 410,
    "retweets": 252,
    "replies": 86,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1937952045920641116",
    "url": "https://x.com/KagutaMuseveni/status/1937952045920641116",
    "created_at": "Wed Jun 25 19:12:27 +0000 2025",
    "text": "Maama and I hosted a group of our talented Bazukulu sportsmen and sportswomen who have excelled in football, basketball, and rugby across various tournaments in Africa.\n\nWhen we fostered peace and expanded the school system, particularly through Universal Primary Education (UPE), we began to see talent emerge. Yet, we have not addressed areas such as nutrition or constructed sufficient stadiums. However, with just peace and education, we have made significant progress. Imagine the impact when we add nutrition, infrastructure, and sports-specific programs.\n\nI urge the sports leaders to collaborate with the Ministry of Health to promote nationwide public health education, especially regarding proper nutrition and discipline among young people.\n\nFinally, I want to congratulate Maama for her dedication as a sportswoman through her prayers and administration, as well as for her stable leadership in the Ministry of Education and Sports. Congratulations to all the young athletes, and may Almighty God bless them.",
    "likes": 671,
    "retweets": 234,
    "replies": 129,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1936112198310314065",
    "url": "https://x.com/KagutaMuseveni/status/1936112198310314065",
    "created_at": "Fri Jun 20 17:21:33 +0000 2025",
    "text": "I reminded the leaders of Greater Mukono about our five guiding pillars: Peace, Development, Wealth Creation, Jobs, and Obuwereza (services).\n\nPeace is crucial for development, and we are enhancing security to maintain the peace we fought for.\n\nDevelopment involves both infrastructure and essential services. \nWe should ensure that every sub-county has a primary school, a Health Centre III, and access roads, and we are taking a systematic approach to this.",
    "likes": 760,
    "retweets": 264,
    "replies": 124,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1935389547501666674",
    "url": "https://x.com/KagutaMuseveni/status/1935389547501666674",
    "created_at": "Wed Jun 18 17:30:00 +0000 2025",
    "text": "As I wound up my PDM assessment tour of Greater Mpigi, I emphasized that the NRM's first principle is peace which is vital for development, while also confronting poverty. Programs like PDM encourage households to utilize their land and collaborate for a better livelihood. \n\nWhile some are proactive, others remain inactive, like in the Parable of the Sower—choose to act. \nOn law enforcement, bonds must not be misused, and criminals need accountability. Parents should ensure their children are immunized for good health. \n\nUganda is progressing, and we will support those willing to act. The future belongs to the disciplined and organized.",
    "likes": 728,
    "retweets": 225,
    "replies": 162,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1931383886107304019",
    "url": "https://x.com/KagutaMuseveni/status/1931383886107304019",
    "created_at": "Sat Jun 07 16:12:56 +0000 2025",
    "text": "I participated in the Seventh-Day Adventist-led ceremony to give thanks to God for Hon. Milly Babalanda’s life. When she was appointed Minister, she celebrated and neglected the COVID19 standard operating procedures which led to her contracting corona, a situation that nearly claimed her life. \n\nAt this ceremony in Buyende District, as in others across various parts of the country where I have had the opportunity to speak, I preached about “akange kakira akaife,” encouraging the masses to actively engage with government initiatives intended to enhance household income.",
    "likes": 990,
    "retweets": 235,
    "replies": 105,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1925961118800891971",
    "url": "https://x.com/KagutaMuseveni/status/1925961118800891971",
    "created_at": "Fri May 23 17:04:48 +0000 2025",
    "text": "I was in Kyabayanja Kisaru, Kikuube District, for the Thanksgiving ceremony of my daughter, Hon Grace Mary Mugasa, the State Minister for Public Service, where I used the opportunity to reiterate my wealth creation message and continue to highlight the 6 priorities we must uphold; peace of our people, security of our nation, the health of our people, the development of our country, wealth creation/ household income of our people, jobs and free education for all.",
    "likes": 795,
    "retweets": 187,
    "replies": 92,
    "author": "Yoweri K Museveni"
  },
  {
    "username": "KagutaMuseveni",
    "tweet_id": "1925552988501799243",
    "url": "https://x.com/KagutaMuseveni/status/1925552988501799243",
    "created_at": "Thu May 22 14:03:02 +0000 2025",
    "text": "On my way to address a public rally in Nakasongola town, I stopped to commission Pura Organic Agro Tech Limited, a cassava processing factory. Cassava starch production is vital for key sectors, including pharmaceuticals, which rely heavily on supplies. I commend Ugandan cassava outgrowers for seizing this opportunity. I also encourage local cassava processors to explore indigenous nutritious food varieties to add value.\nMedicines are expensive, largely due to our reliance on imported starch from India, so I’m pleased this factory will reduce costs.\n\nHowever, I am disappointed by those undermining these investments, including individuals vandalising electricity poles and causing power outages. We will address these challenges.",
    "likes": 887,
    "retweets": 249,
    "replies": 122,
    "author": "Yoweri K Museveni"
  }
]