[
  {
    "username": "officialABAT",
    "tweet_id": "1935732528087785738",
    "url": "https://x.com/officialABAT/status/1935732528087785738",
    "created_at": "Thu Jun 19 16:12:53 +0000 2025",
    "text": "The projects by Governor Uba Sani which I have just commissioned are well thought out. They will hugely impact the lives of the people and generations yet unborn. The Institute of Vocational and Skills Development in Rigachukwu, Samarun Kataf, and Soba will provide our youths with skills relevant to modern society. \n\nThe 300-bed Specialist Hospital is a state-of-the-art facility that will transform the healthcare landscape in Kaduna State. \n\nThe 100 CNG Buses will mitigate the impact of rising transportation costs and enhance workers' productivity. \n\nThe 24-kilometre Kafanchan Township Dual Carriageway, the 21-kilometre Pambegua to Kauru Road, and Tudun Biri Road are significant projects that speak to the responsiveness of the Senator Uba Sani Administration. \n\nI am happy to have been invited to commission these life-changing projects.\n \nAs part of its urban public transport modernisation program, the Kaduna State Government recently launched the Kaduna Bus Rapid Transit (KBRT), the first of its kind in in Northern Nigeria and the second in Nigeria after Lagos. This bold move will undoubtedly make Kaduna the transportation hub of the North. The state will surely reap substantial economic benefits from this visionary step. \n\nThe Kaduna Light Rail Project, which the Federal Government supports, will complement the Kaduna Bus Rapid Transit (KBRT). I urge other states to emulate the Kaduna example.\n\n#PBATinKaduna",
    "likes": 2508,
    "retweets": 655,
    "replies": 376,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1935665977779269783",
    "url": "https://x.com/officialABAT/status/1935665977779269783",
    "created_at": "Thu Jun 19 11:48:26 +0000 2025",
    "text": "I am on my way to Kaduna State, one of our nation’s most promising frontiers of progress and purpose.\n\nToday, I will join Governor Uba Sani @ubasanius to commission a new Institute of Vocational Training and Skills Development in Rigachikun, open a 300-bed hospital in Millennium City, and unveil critical infrastructure projects, including Kaduna’s rollout of CNG buses, significantly boosting their transportation system.\n\nWhat Kaduna is doing is a clear sign of what is possible when subnational governments are empowered, trusted, and supported from the centre to do more. Our administration will continue to unlock the potential of every state to serve their people boldly and effectively.\n\nWe are taking a Bet on the future of Nigeria. This is Renewed Hope in motion.\n\n~ PBAT",
    "likes": 2976,
    "retweets": 665,
    "replies": 726,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1930010956274512214",
    "url": "https://x.com/officialABAT/status/1930010956274512214",
    "created_at": "Tue Jun 03 21:17:24 +0000 2025",
    "text": "Today, I conferred the Nigerian National Honour of Commander of the Federal Republic (CFR) on Mr Bill Gates @BillGates in recognition of his decades-long commitment to improving lives through interventions in global health & polio eradication, education, digital innovation, and agricultural development, especially in Nigeria and across Africa.\n\nBill Gates' contributions have saved millions through the Gates Foundation @gatesfoundation and many such initiatives, uplifted communities, and inspired global action. \n\nWe also had meaningful conversations on deepening our collaboration in health systems, innovation, and youth development, reaffirming our shared belief that real progress begins when we invest in people.\n\nNigeria remains open to ideas, partnerships, and actions that move humanity forward.\n\n~ Bola Ahmed Tinubu, GCFR",
    "likes": 5316,
    "retweets": 925,
    "replies": 1188,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1927312669586981334",
    "url": "https://x.com/officialABAT/status/1927312669586981334",
    "created_at": "Tue May 27 10:35:22 +0000 2025",
    "text": "Today, I celebrate the heartbeat of our nation, our children.\n\nYou are not just our future; you are our now—our leaders, our light, our reason to build a better Nigeria. Every child deserves to grow up safe, heard, and free from fear. Bullying, violence, and neglect have no place in our homes, schools, or digital spaces.\n\nUnder the Renewed Hope Agenda, we are taking bold action, from reforming laws to strengthening community protection systems and expanding nutrition, healthcare, and education. And today, I am launching the “See Something. Say Something. Do Something” campaign, a nationwide call for every Nigerian to become a child protection champion.\n\nTo every child reading this: you matter. Your dreams matter. Your voice matters. If you are hurt or bullied, speak up. You will be heard. You will be protected.\n\nLet today mark a renewed movement to build a Nigeria where no child suffers in silence, no child is left behind, and every child grows in dignity, peace, and love.\n\nCongratulations to all our children. May your laughter echo across this land as a symbol of Renewed Hope and a prosperous future.\n\nHappy Children’s Day, Nigeria.\nLong live our children.\nLong live the Federal Republic of Nigeria.\n\n— President Bola Ahmed Tinubu\n@NGRPresident @NigeriaGov",
    "likes": 3365,
    "retweets": 793,
    "replies": 510,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1927275899486921056",
    "url": "https://x.com/officialABAT/status/1927275899486921056",
    "created_at": "Tue May 27 08:09:16 +0000 2025",
    "text": "Through the Nutrition 774 programme and our School Feeding Scheme, we work assiduously to improve child health and cognitive development. The Nutrition 774 project aims to ensure no child in Nigeria goes hungry. Through this project, we are reaching every community, guaranteeing that children receive the necessary nutrition to thrive in their academic pursuits, creative endeavours, and overall health. A well-nourished child is well-equipped and ready to tackle the challenges of tomorrow.\n\nTo institutionalise our commitment, the Federal Ministry of Women's Affairs has recently established a dedicated Department of Nutrition to strengthen policy coherence, programme delivery, and coordination around child and maternal nutrition.\n\nWe are investing in social protection tools such as the Universal Child Grant and finalising a national Child Wellbeing Index to measure progress, track gaps, and hold ourselves accountable.\n\nOur children's safety cannot be solely anchored on government policies but on community vigilance. This is why I am launching a nationwide \"See Something, Say Something, Do Something\" campaign today, encouraging every Nigerian to become a child protection champion.\n\nTo our beloved children: you matter. Your dreams matter. Your voices matter. No one has the right to hurt, silence, or diminish you. If you are bullied or harmed, speak up—you will be heard and protected.\n\nI call on all partners, stakeholders, and duty-bearers to sustain and deepen our collective efforts. We must embed child rights in all our budgets, plans, and policies.\n\nI commend states taking bold steps for our children's welfare and urge those yet to act: now is the time. Our children are not just statistics—they are the heart of our nation.\n\nLet today mark a renewed movement to build a Nigeria where no child suffers in silence, no child is left behind, and every child grows in dignity, peace, and love.\n\nCongratulations to all our children. May your laughter echo across this land as a symbol of Renewed Hope and a prosperous future.\n\nLong live Nigerian children.\n\nLong live the Federal Republic of Nigeria.",
    "likes": 124,
    "retweets": 28,
    "replies": 22,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1927275895644885080",
    "url": "https://x.com/officialABAT/status/1927275895644885080",
    "created_at": "Tue May 27 08:09:15 +0000 2025",
    "text": "8. We are investing in other focused national systems for child protection, such as the Child Protection Information Management System (CPIMS), which is being scaled up to track and respond to cases in real-time. The Ministry of Women's Affairs is strengthening community-based child protection mechanisms, training frontline responders, and leading nationwide awareness campaigns to end harmful traditional practices.\n\nAdditionally, and in alignment with the Renewed Hope Agenda, we are committed to implementing proactive measures to strengthen existing efforts to support families and communities, including developing a robust institutional framework focused exclusively on Child Protection and Development. This will ensure greater accountability in safeguarding the rights and well-being of every Nigerian child.\n\nWe have introduced a National Policy on Safety, Security, and Violence-Free Schools and developed Guidelines for School Administrators, among several other measures. We embed social-emotional learning and child safeguarding into teacher training. Through the National Commission for Almajiri and Out-of-School Children, we create inclusive pathways for every child to learn, thrive, and succeed, regardless of background.\n\nIn the care economy, we are expanding access to primary healthcare and upscaling dedicated Mother and Child Hospitals and healthcare systems across all six geopolitical zones, offering integrated maternal and child services. We are working collaboratively with subnational governments to ensure the establishment of similar facilities across the States.\n\nWe believe every child has the right to grow up in a loving and protective environment. To ensure that children who are unable to remain in their biological homes are given the care and protection they deserve, the Federal Ministry of Women's Affairs has developed the National Guidelines for Alternative Care for Children. These guidelines would complement the recently launched National Plan of Action on Ending Violence Against Children (EVAC) and strengthen our child protection systems.",
    "likes": 121,
    "retweets": 26,
    "replies": 10,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1896320992395366910",
    "url": "https://x.com/officialABAT/status/1896320992395366910",
    "created_at": "Sun Mar 02 22:05:31 +0000 2025",
    "text": "Pastor Enoch Adejare Adeboye exemplifies deep faith, wisdom, and humility, demonstrating a remarkable dedication to the gospel and selfless service. His impactful work continues to inspire millions in Nigeria and beyond. His leadership reflects a purposeful life, rooted in conviction and a steadfast commitment to uplifting others, serving as a powerful model for humanitarian service and spiritual guidance.\n\nAs he marks his 83rd birthday, I pray for his continued strength, good health, and divine grace to keep guiding and inspiring generations to come.\n\nHappy Birthday, Daddy GO.",
    "likes": 12997,
    "retweets": 1281,
    "replies": 829,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1875922438158008736",
    "url": "https://x.com/officialABAT/status/1875922438158008736",
    "created_at": "Sun Jan 05 15:08:56 +0000 2025",
    "text": "It was a special delight to visit Enugu state yesterday and inaugurate the laudable projects executed by the administration of Governor Peter Mbah.\n\nThe visit was my first official call this year, and I thank the Enugu state government, the leaders, the people of Enugu, and the South East for the warm reception.\n\nI commend Governor Mbah for his remarkable leadership in the state. This leadership is evident in the burgeoning infrastructure, enhanced security measures, and improving access to education and healthcare by the citizens\n\nMy administration is committed to completing the Eastern rail line, connecting Port Harcourt to Maiduguri, and will support the development of the Anambra Basin, which is considered rich in oil and gas resources.\n\nWhen we work together, we can build a prosperous future for our nation. We are members of one family held by a single umbilical cord; hence, we must work together to develop the Nigeria we desire.\n\nThank you, Enugu!\n\n~BAT",
    "likes": 3855,
    "retweets": 745,
    "replies": 427,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1869353940661481542",
    "url": "https://x.com/officialABAT/status/1869353940661481542",
    "created_at": "Wed Dec 18 12:08:05 +0000 2024",
    "text": "Food Security is non-negotiable!",
    "likes": 11561,
    "retweets": 1768,
    "replies": 3455,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1819997287990407401",
    "url": "https://x.com/officialABAT/status/1819997287990407401",
    "created_at": "Sun Aug 04 07:22:22 +0000 2024",
    "text": "My fellow Nigerians,\n\nToday, I address you with a sense of responsibility, as we navigate through these times. The protests, which turned violent in some parts of our nation, have caused unimaginable pain and loss, particularly to the families of those who have tragically lost their lives. Our nation’s resources are stretched thin as we rebuild what has been destroyed.\n\nAs your President, I am committed to ensuring public order and protecting the lives and property of every Nigerian. We must come together, suspending further protests, and embrace dialogue for the sake of our nation’s unity and progress.\n\nDespite the challenges, our government is making significant strides. We have doubled government revenues by blocking leakages and introducing automation, reduced debt service, and launched major infrastructure projects. Initiatives like the Compressed Natural Gas Initiative, the MSME Hubs, and the Renewed Hope City and Estate projects aim to improve the quality of life for all Nigerians. To drive down the cost of food and medicines, I have ordered the suspension of duties on critical food items and medical supplies for the next six months, in the first instance, while I can also confirm to you that billions of Naira worth of tractors and planting equipment purchased from US, Brazil and Belarus, are already on the way to our country.\n\nWe have also shown our commitment to the youth with programs like the student loan scheme and the Digital and Creative Enterprises initiative, which will create millions of jobs.\n\nLet us choose hope over fear, unity over division, and progress over stagnation. Together, we can build a brighter future for ourselves and generations to come.\n\nForward Ever, Backward Never!\n\nThank you for your attention, and may God bless our great nation",
    "likes": 22737,
    "retweets": 5686,
    "replies": 10730,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1758627321546784939",
    "url": "https://x.com/officialABAT/status/1758627321546784939",
    "created_at": "Fri Feb 16 23:00:01 +0000 2024",
    "text": "On the sidelines of the AU Summit, I had a productive engagement with Prof Senait Fisseha, Senior Vice President of Susan Thompson Buffett Foundation, where we discussed their commitment to supporting our health reforms including the Health Renewal Investment Initiative that I announced in December 2023. \n\nWe are excited about the possibility of establishing a sustainable partnership with the Susan Thompson Buffett Foundation to adopt a sector-wide approach aimed at enhancing population health outcomes through the primary health care system, and improving reproductive, maternal, and child health services in Nigeria.\n\n#AUsummit",
    "likes": 2722,
    "retweets": 443,
    "replies": 1417,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1739668541341671663",
    "url": "https://x.com/officialABAT/status/1739668541341671663",
    "created_at": "Tue Dec 26 15:24:36 +0000 2023",
    "text": "I strongly condemn the heinous and brutal attacks in Bokkos and Barkin-Ladi Local Government Areas of Plateau State, which have tragically resulted in the loss of many lives.\n\nI have directed our security agencies to immediately move in, scour every part of the zone, and apprehend the culprits responsible for these atrocities.\n\nFurthermore, I have ordered the immediate mobilization of relief resources for the surviving victims of these primitive and cruel attacks, as well as ensuring medical treatment is provided for the wounded.\n\nWhile condoling with the government and the people of Plateau State, I assure all Nigerians that the envoys of death, pain, and sorrow responsible for these acts will not escape justice.\n\n#PBAT",
    "likes": 5379,
    "retweets": 1341,
    "replies": 3132,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1734621604053713300",
    "url": "https://x.com/officialABAT/status/1734621604053713300",
    "created_at": "Tue Dec 12 17:09:52 +0000 2023",
    "text": "At the unveiling of Nigeria’s Health Sector Renewal Investment Initiative and the signing of the Health Renewal Compact to mark the Universal Health Coverage Day this afternoon in Abuja, my administration took a critical step in actualizing my campaign promise to deliver improved quality health for Nigerians.\n\nDelivering improved quality health is an underpinning factor in my promise of Renewed Hope to Nigerians. \n\nThat hope is ignited here today with the support of all multilateral partners and agencies; health is back on the front burner.\n\n- PBAT\n\n#HealthCareForNigerians\n@Fmohnigeria",
    "likes": 2528,
    "retweets": 610,
    "replies": 479,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1679568219890171905",
    "url": "https://x.com/officialABAT/status/1679568219890171905",
    "created_at": "Thu Jul 13 19:07:23 +0000 2023",
    "text": "We acknowledge that affordability, not availability, is the key issue for Nigerians and recognize the impact of high food prices on demand and the overall agriculture and food value chain.\n\n1. Inclusion of food and water availability and affordability issues within the purview of the National Security Council.\n\n2. Deployment of initiatives to reverse inflationary trend and ensure future supplies of affordable foods.\n\n3. Short-term strategy to use savings from fuel subsidy removal to revamp the agricultural sector.\n\n4. Release of fertilizers and grains to farmers and households (free) as immediate intervention.\n\n5. Urgent synergy between the Ministry of Agriculture and Ministry of Water Resources to ensure adequate irrigation and all-year round farming.",
    "likes": 1117,
    "retweets": 293,
    "replies": 161,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1679568213892366336",
    "url": "https://x.com/officialABAT/status/1679568213892366336",
    "created_at": "Thu Jul 13 19:07:21 +0000 2023",
    "text": "Today, we declared a state of emergency and unveiled a comprehensive intervention plan on food security, affordability, and sustainability, taking decisive action to tackle food inflation. These are steps towards a more food secure Nigeria for all.\nOur new initiatives will tackle rising food costs, enhance agriculture, and boost job creation. No one will be left behind in our efforts to ensure affordable, plentiful food for every Nigerian\n\nDetails of our Plan to follow. \n\n#FoodSecurity #aRenewedNigeria",
    "likes": 12738,
    "retweets": 4208,
    "replies": 2710,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1633821578646687746",
    "url": "https://x.com/officialABAT/status/1633821578646687746",
    "created_at": "Thu Mar 09 13:26:33 +0000 2023",
    "text": "My thoughts are with them and with the Lagos State Government, even as I continue to follow the emergency response efforts closely and offer support, where necessary, to ensure that survivors and others involved receive the best care.",
    "likes": 1724,
    "retweets": 283,
    "replies": 152,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1623647293990658048",
    "url": "https://x.com/officialABAT/status/1623647293990658048",
    "created_at": "Thu Feb 09 11:37:35 +0000 2023",
    "text": "Today, I join family, friends and numerous associates of the former governor of Ekiti State, Dr. Kayode Fayemi @kfayemi in congratulating him on attaining 58.I wish him many more years in good health and wisdom so he can continue to render useful services to the country https://t.co/Sw4nJcEY9j",
    "likes": 1123,
    "retweets": 232,
    "replies": 80,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1607816302025916423",
    "url": "https://x.com/officialABAT/status/1607816302025916423",
    "created_at": "Tue Dec 27 19:10:52 +0000 2022",
    "text": "I congratulate Senator Akume on attaining 69. I thank God for his life of service to his people and devotion to God and I wish him good health, many more years and God's continued guidance and protection.",
    "likes": 263,
    "retweets": 41,
    "replies": 23,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1602733769336791042",
    "url": "https://x.com/officialABAT/status/1602733769336791042",
    "created_at": "Tue Dec 13 18:34:42 +0000 2022",
    "text": "Warm congratulations to Governor Wike @GovWike on turning 55.  My prayer for Mr. Project is that God Almighty grant him robust health, imbue him with the energy, strength, https://t.co/oJlAoyDpyF",
    "likes": 2529,
    "retweets": 461,
    "replies": 271,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1583593127444566016",
    "url": "https://x.com/officialABAT/status/1583593127444566016",
    "created_at": "Fri Oct 21 22:56:37 +0000 2022",
    "text": "16. We shall make affordable healthcare, education and housing accessible for all.",
    "likes": 266,
    "retweets": 71,
    "replies": 56,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1574809260206297090",
    "url": "https://x.com/officialABAT/status/1574809260206297090",
    "created_at": "Tue Sep 27 17:12:40 +0000 2022",
    "text": "In the field of education, this venerable man is also making a huge difference for God and for country. \n\n\"We are grateful to God for Bishop Oyedepo's life of service and his transformational leadership. As we rejoice with him for a gift of another year in good health,",
    "likes": 386,
    "retweets": 63,
    "replies": 38,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1568923705912299521",
    "url": "https://x.com/officialABAT/status/1568923705912299521",
    "created_at": "Sun Sep 11 11:25:35 +0000 2022",
    "text": "I am indeed happy that this well accomplished Nigerian   has reached the age of 88 in good health and uncommon vitality. I join his family, friends and associates to wish this illustrious Nigerian happy birthday and more grace for the years ahead.",
    "likes": 233,
    "retweets": 37,
    "replies": 26,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1568210368840753154",
    "url": "https://x.com/officialABAT/status/1568210368840753154",
    "created_at": "Fri Sep 09 12:11:02 +0000 2022",
    "text": "I rejoice with Bishop Wale Oke on his birthday. Bishop Oke at 66 is gradually moving up the ladder and will soon join the club of septuagenerian. I wish him good health and more grace in the service of God and humanity. https://t.co/ez7Fd5rFub",
    "likes": 1122,
    "retweets": 231,
    "replies": 212,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1566507509002665984",
    "url": "https://x.com/officialABAT/status/1566507509002665984",
    "created_at": "Sun Sep 04 19:24:29 +0000 2022",
    "text": "I wish our elder statesman more years in good health and abiding grace of God.",
    "likes": 181,
    "retweets": 42,
    "replies": 16,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1565682602111291392",
    "url": "https://x.com/officialABAT/status/1565682602111291392",
    "created_at": "Fri Sep 02 12:46:35 +0000 2022",
    "text": "I heartily congratulate my brother and worthy partner, Senator Kashim Shettima, on attaining 56 in good health.\nI am excited about his energy, dynamism and readiness to serve our country at the center as Vice\nPresident. https://t.co/bMvsy5Okjm",
    "likes": 3608,
    "retweets": 852,
    "replies": 889,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1557092126793637888",
    "url": "https://x.com/officialABAT/status/1557092126793637888",
    "created_at": "Tue Aug 09 19:51:07 +0000 2022",
    "text": "This is a major milestone. We thank Almighty Allah for granting\nBaba the special grace of good health and longevity. \nA true disciple of Allah, Baba has dedicated his life to the\npropagation of Islam. https://t.co/EFncjc1CR9",
    "likes": 1081,
    "retweets": 245,
    "replies": 237,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1555938510816804864",
    "url": "https://x.com/officialABAT/status/1555938510816804864",
    "created_at": "Sat Aug 06 15:27:03 +0000 2022",
    "text": "As she enjoys her milestone platinum jubilee, I pray that the Almighty grants her many more years in great health, happiness, and increased wisdom to continue in her spirited service to the nation.",
    "likes": 164,
    "retweets": 28,
    "replies": 37,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1555230511563407365",
    "url": "https://x.com/officialABAT/status/1555230511563407365",
    "created_at": "Thu Aug 04 16:33:43 +0000 2022",
    "text": "On this occasion of his 62nd birthday, I pray that Almighty Allah grant Alhaji Rabiu many more years, robust health, increased wisdom and continued success in business.",
    "likes": 170,
    "retweets": 28,
    "replies": 19,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1549120148480614403",
    "url": "https://x.com/officialABAT/status/1549120148480614403",
    "created_at": "Mon Jul 18 19:53:19 +0000 2022",
    "text": "I wish my good friend @ProfOsinbajo  a quick and uncomplicated recovery as he recuperates from his recent, successful surgery.\n\nMay God Almighty grant him complete healing. https://t.co/HWPc44zJKP",
    "likes": 6417,
    "retweets": 738,
    "replies": 879,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1511457240372367363",
    "url": "https://x.com/officialABAT/status/1511457240372367363",
    "created_at": "Tue Apr 05 21:34:22 +0000 2022",
    "text": "During my visit, I stopped at a local hospital where I spoke with the doctors, nurses and other hospital staff who have worked tirelessly to care for the victims and made a personal humanitarian pledge of assistance for the victims. https://t.co/CzPtfOtOnJ",
    "likes": 819,
    "retweets": 159,
    "replies": 156,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1500206885106065416",
    "url": "https://x.com/officialABAT/status/1500206885106065416",
    "created_at": "Sat Mar 05 20:29:28 +0000 2022",
    "text": "\"On this occasion of his 85th birthday, our prayers is that God Almighty keep Baba with us for many more years. May God grant him good health and ceaseless  energy to continue to be of service to this country he loves so dearly. Amin.\"\n4/4 https://t.co/199CFlTsB7",
    "likes": 81,
    "retweets": 31,
    "replies": 9,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1392427644654964738",
    "url": "https://x.com/officialABAT/status/1392427644654964738",
    "created_at": "Wed May 12 10:33:15 +0000 2021",
    "text": "13. May we see an end to this disease and its consequences in no distant time. Not only must we pray for good things, we must also act in a better way.",
    "likes": 61,
    "retweets": 19,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1392427642549325824",
    "url": "https://x.com/officialABAT/status/1392427642549325824",
    "created_at": "Wed May 12 10:33:14 +0000 2021",
    "text": "12. ... by either the violence of terrorism as well as to those who have been lost to or harmed by the global pandemic that is Covid-19.",
    "likes": 50,
    "retweets": 17,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1359944444506738690",
    "url": "https://x.com/officialABAT/status/1359944444506738690",
    "created_at": "Thu Feb 11 19:16:36 +0000 2021",
    "text": "5. Whatever we have been able to accomplish in Lagos State is because of the groundwork Pa Jakande set out before us. In so many ways, he is the inspirational father of modern Lagos State.\nIn housing, education, health care, and road construction, he left an indelible imprint.",
    "likes": 170,
    "retweets": 50,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1350120628150538242",
    "url": "https://x.com/officialABAT/status/1350120628150538242",
    "created_at": "Fri Jan 15 16:40:16 +0000 2021",
    "text": "Characteristic of this selfless man is his enlightened decision not so much to focus on himself this special day but to call each of us to pray for national healing so that Nigeria and Nigerians can overcome harmful consequences visited upon us by the COVID-19 pandemic.",
    "likes": 91,
    "retweets": 21,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1342298783267368960",
    "url": "https://x.com/officialABAT/status/1342298783267368960",
    "created_at": "Fri Dec 25 02:39:03 +0000 2020",
    "text": "COVID came to steal much from us. But if we act in the spirit of Jesus, we shall defeat this disease and the other ills it seeks to impose on us.",
    "likes": 98,
    "retweets": 21,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1342298776329998338",
    "url": "https://x.com/officialABAT/status/1342298776329998338",
    "created_at": "Fri Dec 25 02:39:01 +0000 2020",
    "text": "In its essence, Christmas is a celebration of life and this year we best celebrate life by doing what we must do to protect ourselves and our loved ones from this terrible virus.",
    "likes": 88,
    "retweets": 20,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1342298774807470081",
    "url": "https://x.com/officialABAT/status/1342298774807470081",
    "created_at": "Fri Dec 25 02:39:01 +0000 2020",
    "text": "In normal times, Christmas offers Nigerians of all faiths an opportunity to gather with family and friends to celebrate the birth of Jesus. Unfortunately, I must beseech you to forgo such large gatherings this year for the sake of our collective health.",
    "likes": 86,
    "retweets": 22,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1300103680688087040",
    "url": "https://x.com/officialABAT/status/1300103680688087040",
    "created_at": "Sun Aug 30 16:10:46 +0000 2020",
    "text": "The AfDB must be at the policy and intellectual vanguard as we seek ways to contain both the public health and economic challenges of COVID-19.",
    "likes": 79,
    "retweets": 25,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1299369112888639488",
    "url": "https://x.com/officialABAT/status/1299369112888639488",
    "created_at": "Fri Aug 28 15:31:52 +0000 2020",
    "text": "He wishes the survivor of the crash soonest recovery.\n\n@tunderahmanu @ekometa",
    "likes": 140,
    "retweets": 35,
    "replies": 14,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1288900271813394433",
    "url": "https://x.com/officialABAT/status/1288900271813394433",
    "created_at": "Thu Jul 30 18:12:26 +0000 2020",
    "text": "7. When Papa was recently admitted to the hospital for age-related sickness, I spoke to him and followed up with his close aide to monitor his situation.",
    "likes": 31,
    "retweets": 14,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1288780338500718597",
    "url": "https://x.com/officialABAT/status/1288780338500718597",
    "created_at": "Thu Jul 30 10:15:51 +0000 2020",
    "text": "8. Thus, as we celebrate, we must observe all public health measures recommended by the authorities such as wearing facemasks and avoiding large gatherings. We do this not for ourselves but for the benefit of others.",
    "likes": 79,
    "retweets": 24,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1288780330447577088",
    "url": "https://x.com/officialABAT/status/1288780330447577088",
    "created_at": "Thu Jul 30 10:15:49 +0000 2020",
    "text": "4. This sickness has touched Muslim, Christian as well as those who profess no religion at all. It has descended on both the high and the not-so-high. We have lost friends and loved ones.",
    "likes": 68,
    "retweets": 24,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1288780328602161154",
    "url": "https://x.com/officialABAT/status/1288780328602161154",
    "created_at": "Thu Jul 30 10:15:49 +0000 2020",
    "text": "3. We have lost friends and loved ones. Too many people have died and far too many good people are still suffering because of the economic consequences of this scourge.",
    "likes": 81,
    "retweets": 28,
    "replies": 3,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1288780326857330688",
    "url": "https://x.com/officialABAT/status/1288780326857330688",
    "created_at": "Thu Jul 30 10:15:48 +0000 2020",
    "text": "2. This sickness has touched Muslim, Christian as well as those who profess no religion at all. It has descended on both the high and the not-so-high.",
    "likes": 85,
    "retweets": 28,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1288780325221523457",
    "url": "https://x.com/officialABAT/status/1288780325221523457",
    "created_at": "Thu Jul 30 10:15:48 +0000 2020",
    "text": "I join with Nigerian Muslims and Muslims all over the world in observance of Eid-el-Kabir. This year’s observance comes at a unique moment in history where the normal activities of society have been upset and altered by the threat of deadly sickness.",
    "likes": 1721,
    "retweets": 306,
    "replies": 148,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1271109741528440837",
    "url": "https://x.com/officialABAT/status/1271109741528440837",
    "created_at": "Thu Jun 11 15:59:13 +0000 2020",
    "text": "18. The government has performed admirably in explaining its actions to the people on COVID-19 and informing us about the disease. Only a democratic government would have been so informative and open. Only a democratic government would have initiated palliatives.",
    "likes": 103,
    "retweets": 43,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1265044563292491777",
    "url": "https://x.com/officialABAT/status/1265044563292491777",
    "created_at": "Mon May 25 22:18:21 +0000 2020",
    "text": "6. I congratulate him as he turns 63.  May the grace of Almighty Allah continue to be with him. May He grant him many more years, good health and renewed energy to continue in the service of our people and humanity.",
    "likes": 284,
    "retweets": 60,
    "replies": 24,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1260605173690503171",
    "url": "https://x.com/officialABAT/status/1260605173690503171",
    "created_at": "Wed May 13 16:17:48 +0000 2020",
    "text": "8. ...Prof. Gambari's expertise and international reputation will help  Nigeria galvanise national, regional and international efforts and resources to contain this viral menace and to advance Nigeria’s interests on other important matters.",
    "likes": 200,
    "retweets": 59,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1254111222145912832",
    "url": "https://x.com/officialABAT/status/1254111222145912832",
    "created_at": "Sat Apr 25 18:13:10 +0000 2020",
    "text": "4. His unexpected death apparently was due to complications from diabetes and high blood pressure. His unexpected death apparently was due to complications from diabetes and high blood pressure.",
    "likes": 174,
    "retweets": 39,
    "replies": 6,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1251523676106866697",
    "url": "https://x.com/officialABAT/status/1251523676106866697",
    "created_at": "Sat Apr 18 14:51:11 +0000 2020",
    "text": "8. We must honor the departed by doing all we can to defeat the virus so that we safeguard the health of the nation that Mallam Kyari loved so deeply. To the family of Mallam Kyari, may Almighty Allah support and comfort them during this painful moment.",
    "likes": 236,
    "retweets": 87,
    "replies": 11,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1251523670884978690",
    "url": "https://x.com/officialABAT/status/1251523670884978690",
    "created_at": "Sat Apr 18 14:51:09 +0000 2020",
    "text": "5. Although we are today made sad, we must also use this moment to strengthen our resolve in fighting the pandemic. Let us rededicate ourselves to obeying the public health measures such as physical distancing so that we may defeat the contagion and not fall to it.",
    "likes": 170,
    "retweets": 68,
    "replies": 10,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1251523669068832768",
    "url": "https://x.com/officialABAT/status/1251523669068832768",
    "created_at": "Sat Apr 18 14:51:09 +0000 2020",
    "text": "4. This death came at a time the government is working assiduously to prevent the spread of the coronavirus pandemic. We must not allow the passing away of Mallam Kyari and the other Nigerians who have lost their lives to this terrible disease to be in vain.",
    "likes": 170,
    "retweets": 70,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460662314217473",
    "url": "https://x.com/officialABAT/status/1250460662314217473",
    "created_at": "Wed Apr 15 16:27:08 +0000 2020",
    "text": "12. SITUATION WITH BUSINESSES:\nThe CBN can lend large amounts of virtually non interest loans to these firms with the proviso that the companies maintain their existing payrolls.\n\nIf we must hold to the restrictive public health measures, the people will need economic relief.",
    "likes": 206,
    "retweets": 96,
    "replies": 8,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460658531028992",
    "url": "https://x.com/officialABAT/status/1250460658531028992",
    "created_at": "Wed Apr 15 16:27:08 +0000 2020",
    "text": "11. The money-less family still needs food, water, shelter and, to a lesser degree,utilities. In a compassionate society,they should not be made to do without.Most families need relief.If relief is not forthcoming, these families risk hunger and its attendant suffering &amp; woes.",
    "likes": 192,
    "retweets": 96,
    "replies": 8,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460649601318913",
    "url": "https://x.com/officialABAT/status/1250460649601318913",
    "created_at": "Wed Apr 15 16:27:05 +0000 2020",
    "text": "7...than in dealing with the medical complexities of a contagion no one fully understands. If we so utilize this moment, it will be recorded as a pivotal one in our national history. If we allow this moment to slip, history will not be obliged to treat us with great mercy.",
    "likes": 184,
    "retweets": 87,
    "replies": 5,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460647239880706",
    "url": "https://x.com/officialABAT/status/1250460647239880706",
    "created_at": "Wed Apr 15 16:27:05 +0000 2020",
    "text": "6. The Nigerian government acted wisely to suppress the virus. Our health system and medical facilities simply cannot cope with legions of cases. The capacity and aptitude of government are more suited to dealing with the economic fallout of the public health restrictions...",
    "likes": 178,
    "retweets": 89,
    "replies": 5,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460642739445764",
    "url": "https://x.com/officialABAT/status/1250460642739445764",
    "created_at": "Wed Apr 15 16:27:04 +0000 2020",
    "text": "4. While the public health measures may save lives, their economic consequences have been brutal enough to place large numbers of people in a different form of jeopardy. We face a trade-off between certain pandemic and possible widespread depravation.",
    "likes": 187,
    "retweets": 86,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460640537444352",
    "url": "https://x.com/officialABAT/status/1250460640537444352",
    "created_at": "Wed Apr 15 16:27:03 +0000 2020",
    "text": "3. Given the lethality of the disease, the public health measures have been prudential. If such action were not taken, the toll of this pandemic might rival the 1958 Asian Flu which took over 1m people or, worse, the 1918 Spanish Flu where an estimated 50m people passed away.",
    "likes": 206,
    "retweets": 92,
    "replies": 6,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1250460638054363139",
    "url": "https://x.com/officialABAT/status/1250460638054363139",
    "created_at": "Wed Apr 15 16:27:03 +0000 2020",
    "text": "2. POLICY BACKGROUND  \n\nThe coronavirus has changed the modern world with a velocity un-foretold. To protect their populations, nations have taken unprecedented steps in closing down cities, halting socio-economic activities and quarantining vast numbers of people.",
    "likes": 220,
    "retweets": 97,
    "replies": 9,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1244354502565801984",
    "url": "https://x.com/officialABAT/status/1244354502565801984",
    "created_at": "Sun Mar 29 20:03:27 +0000 2020",
    "text": "3. Thankfully, we have not seen the worst of the virus but we must be bold and we must be prepared should the time for action ever arise.",
    "likes": 90,
    "retweets": 39,
    "replies": 3,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1244354495770955778",
    "url": "https://x.com/officialABAT/status/1244354495770955778",
    "created_at": "Sun Mar 29 20:03:25 +0000 2020",
    "text": "1. Today, I released a statement to the public with the Title: A MESSAGE ON THE CORONAVIRUS – A TIE FOR UNITY, A TIME FOR THOUGHT A TIME FOR ACTION. In the statement, I provided, among other things, my thoughts on the economic impact of COVID-19 across the world and in Nigeria.",
    "likes": 935,
    "retweets": 294,
    "replies": 112,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1244296704267960323",
    "url": "https://x.com/officialABAT/status/1244296704267960323",
    "created_at": "Sun Mar 29 16:13:46 +0000 2020",
    "text": "4. Together, we will overcome this terrible disease.",
    "likes": 267,
    "retweets": 84,
    "replies": 56,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1244296684063969281",
    "url": "https://x.com/officialABAT/status/1244296684063969281",
    "created_at": "Sun Mar 29 16:13:42 +0000 2020",
    "text": "3. That is why I have chosen today to announce that I will be making a donation of N200m to fight this deadly virus. Pursuant to this pledge, N100m will be made available to the government of Lagos State and another N100m to the NCDC to support their efforts in fighting COVID-19.",
    "likes": 544,
    "retweets": 215,
    "replies": 164,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1244060502306758661",
    "url": "https://x.com/officialABAT/status/1244060502306758661",
    "created_at": "Sun Mar 29 00:35:11 +0000 2020",
    "text": "20. In conclusion, I proffer these measures not as some comprehensive solution. I hope these ideas spark needed dialogue about the ways we may need to employ to protect our nation from assault by the coronavirus. I do not know if such a confrontation shall come.",
    "likes": 260,
    "retweets": 88,
    "replies": 11,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1244060468156731394",
    "url": "https://x.com/officialABAT/status/1244060468156731394",
    "created_at": "Sun Mar 29 00:35:03 +0000 2020",
    "text": "11. I therefore tender these humble comments in hope they contribute to halting the spread and ill consequences of this dreadful sickness.",
    "likes": 189,
    "retweets": 70,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1243988055431790593",
    "url": "https://x.com/officialABAT/status/1243988055431790593",
    "created_at": "Sat Mar 28 19:47:19 +0000 2020",
    "text": "9. Consistent with the postponement of the colloquium, there will be no public celebration of my birthday at all.\n\nThis is the moment to show our concern for one another not by gathering in celebration but by staying at home in good health and in contribution to public safety.",
    "likes": 115,
    "retweets": 54,
    "replies": 3,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1243988052411908096",
    "url": "https://x.com/officialABAT/status/1243988052411908096",
    "created_at": "Sat Mar 28 19:47:18 +0000 2020",
    "text": "8. These are challenging times and we must all do all that we can to defeat COVID-19. \n\nTo safeguard public health, we have already cancelled the annual colloquium held on my birthday at which ideas and solutions are proffered to emerging national issues.",
    "likes": 118,
    "retweets": 52,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1243988049119399936",
    "url": "https://x.com/officialABAT/status/1243988049119399936",
    "created_at": "Sat Mar 28 19:47:17 +0000 2020",
    "text": "7. At this moment, there is no better way to help me mark my birthday than for you to take every precaution to protect the health of our beloved people. That you remain healthy and alive will be the best gift you can give to me at this time. For now, this means staying at home.",
    "likes": 142,
    "retweets": 54,
    "replies": 6,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1243988046078455810",
    "url": "https://x.com/officialABAT/status/1243988046078455810",
    "created_at": "Sat Mar 28 19:47:17 +0000 2020",
    "text": "6. We enjoin our friends, associates and indeed everyone hoping to come and celebrate the day with me to please support government’s efforts to contain the virus. You do this by staying at home, by observing personal hygiene, and by taking all necessary steps to stay safe.",
    "likes": 124,
    "retweets": 54,
    "replies": 3,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1243988032912535553",
    "url": "https://x.com/officialABAT/status/1243988032912535553",
    "created_at": "Sat Mar 28 19:47:13 +0000 2020",
    "text": "2. This is particularly true when it comes to acts of social distancing and other precautionary measures to prevent the spread of the Coronavirus.",
    "likes": 137,
    "retweets": 55,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1216431886169407489",
    "url": "https://x.com/officialABAT/status/1216431886169407489",
    "created_at": "Sun Jan 12 18:48:56 +0000 2020",
    "text": "11. My prayer for the Senate President at 61 is that Almighty Allah grant him many more years, robust health and continued mental and physical energy to continue in the service of our people and humanity.",
    "likes": 61,
    "retweets": 20,
    "replies": 6,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1193282967126315008",
    "url": "https://x.com/officialABAT/status/1193282967126315008",
    "created_at": "Sat Nov 09 21:43:24 +0000 2019",
    "text": "6. As you age gracefully, we pray that Allah continue to keep you in good health and continue to grant you His blessings.\n\nAt 80, my prayer for you is as follows:",
    "likes": 108,
    "retweets": 38,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1106545571425341440",
    "url": "https://x.com/officialABAT/status/1106545571425341440",
    "created_at": "Fri Mar 15 13:19:57 +0000 2019",
    "text": "7. “I appeal to Lagosians to voluntarily donate blood not only to victims who urgently require blood but also to improve our blood bank in the state.",
    "likes": 23,
    "retweets": 6,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1106545569986740225",
    "url": "https://x.com/officialABAT/status/1106545569986740225",
    "created_at": "Fri Mar 15 13:19:57 +0000 2019",
    "text": "6. “They do not deserve to die the way they did. May God comfort their families and grant repose of the souls of those young ones. Government must now ensure adequate medical treatment for the rescued victims.",
    "likes": 19,
    "retweets": 6,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1106545563753959424",
    "url": "https://x.com/officialABAT/status/1106545563753959424",
    "created_at": "Fri Mar 15 13:19:55 +0000 2019",
    "text": "2. The former Lagos governor said the government must now ensure adequate treatment for rescued victims. He also called on Lagosians to donate blood to the rescued victims.",
    "likes": 29,
    "retweets": 6,
    "replies": 1,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1106545560595693570",
    "url": "https://x.com/officialABAT/status/1106545560595693570",
    "created_at": "Fri Mar 15 13:19:54 +0000 2019",
    "text": "Lagos Building Collapse Tragic, Government Must Ensure Adequate Medical Treatment for Rescued Victims – Tinubu",
    "likes": 263,
    "retweets": 46,
    "replies": 20,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "1046429230102392833",
    "url": "https://x.com/officialABAT/status/1046429230102392833",
    "created_at": "Sun Sep 30 15:59:04 +0000 2018",
    "text": "12. During my tenure and Governor Fashola’s, Lagos state recorded improvements in all aspects of our collective existence, from public health to public sanitation, from education to social services, from the administration of justice to the cleaning of storm and sewage drains.",
    "likes": 475,
    "retweets": 357,
    "replies": 101,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "926462608714199041",
    "url": "https://x.com/officialABAT/status/926462608714199041",
    "created_at": "Fri Nov 03 14:54:33 +0000 2017",
    "text": "8. Yet, he was taken away by cardiac arrest when it seemed he had so much life to still live.",
    "likes": 96,
    "retweets": 106,
    "replies": 5,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "517250792836046848",
    "url": "https://x.com/officialABAT/status/517250792836046848",
    "created_at": "Wed Oct 01 09:52:53 +0000 2014",
    "text": "If we whitewash D reality of our existc by lying  all is well just b/c its Indp Day,then we ignore D troublg signals at our collective peril",
    "likes": 3,
    "retweets": 31,
    "replies": 2,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "510184185286230016",
    "url": "https://x.com/officialABAT/status/510184185286230016",
    "created_at": "Thu Sep 11 21:52:43 +0000 2014",
    "text": "REPORT: News Sites Get It Wrong On Tinubu’s Health – Citizen Confidential. http://t.co/asp9IMvaoU",
    "likes": 4,
    "retweets": 11,
    "replies": 4,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "505449285656133633",
    "url": "https://x.com/officialABAT/status/505449285656133633",
    "created_at": "Fri Aug 29 20:17:55 +0000 2014",
    "text": "Out of my busy political schedule  I have taken out time to vacation. In great health I am enjoying this time out with my wife and family.",
    "likes": 6,
    "retweets": 51,
    "replies": 49,
    "author": "Bola Ahmed Tinubu"
  },
  {
    "username": "officialABAT",
    "tweet_id": "169868815847526400",
    "url": "https://x.com/officialABAT/status/169868815847526400",
    "created_at": "Wed Feb 15 19:40:56 +0000 2012",
    "text": "I just arrived MMA Airport Lagos and in good health. I thank all Nigerians that cared, called and all",
    "likes": 5,
    "retweets": 9,
    "replies": 35,
    "author": "Bola Ahmed Tinubu"
  }
]