[
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983815444164124911",
    "url": "https://x.com/WilliamsRuto/status/1983815444164124911",
    "created_at": "Thu Oct 30 08:37:14 +0000 2025",
    "text": "Officially opened the 124-bed Butere County Hospital in Kakamega County, a milestone for the people of Butere, and the larger Western region. https://t.co/40k0F3m6fz",
    "likes": 70,
    "retweets": 17,
    "replies": 9,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983815254543901164",
    "url": "https://x.com/WilliamsRuto/status/1983815254543901164",
    "created_at": "Thu Oct 30 08:36:28 +0000 2025",
    "text": "We are undertaking a bold transformation of the Kenya Medical Supplies Authority (KEMSA) to make it more efficient, sustainable, and effective, raising its current drug availability rate from 48 per cent to 68 per cent.\n\nOur ultimate goal is to achieve a 100 per cent refill rate by the end of the year, ensuring consistent access to essential medicines and other commodities and thus improve health outcomes for all citizens.\n\nWe are further investing KSh150 million to equip and upgrade the hospital, guaranteeing modern facilities, quality care, and greater dignity in healthcare delivery.",
    "likes": 56,
    "retweets": 16,
    "replies": 4,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983801489933132030",
    "url": "https://x.com/WilliamsRuto/status/1983801489933132030",
    "created_at": "Thu Oct 30 07:41:47 +0000 2025",
    "text": "Official Opening of Butere County Hospital https://t.co/a2YcJZN1dQ",
    "likes": 42,
    "retweets": 7,
    "replies": 14,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983800417038561573",
    "url": "https://x.com/WilliamsRuto/status/1983800417038561573",
    "created_at": "Thu Oct 30 07:37:31 +0000 2025",
    "text": "Official Opening of Butere County Hospital https://t.co/q66ozc0C3K",
    "likes": 56,
    "retweets": 8,
    "replies": 13,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983788105930043432",
    "url": "https://x.com/WilliamsRuto/status/1983788105930043432",
    "created_at": "Thu Oct 30 06:48:36 +0000 2025",
    "text": "Official Opening of Butere County Hospital https://t.co/4TdNYXGKD2",
    "likes": 85,
    "retweets": 17,
    "replies": 19,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983440599870005362",
    "url": "https://x.com/WilliamsRuto/status/1983440599870005362",
    "created_at": "Wed Oct 29 07:47:44 +0000 2025",
    "text": "We are leveraging public-private partnerships to upgrade and modernise hospital equipment, ensuring quality healthcare for Kenyans. Under this model, private players are installing and maintaining critical medical equipment, with hospitals only paying for the services delivered.\n\nCommissioned a KSh130 million modern CT Scan Unit at Nakuru County Referral and Teaching Hospital. This state-of-the-art machine, acquired through this innovative partnership, will double the hospital’s capacity to 100 scans a day. It also includes a heart treatment kit and is powered by AI technology.\n\nWe will install over 70 such advanced machines in health facilities across the country under the same model, strengthening access to modern healthcare for all Kenyans.",
    "likes": 345,
    "retweets": 73,
    "replies": 47,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983416840237003238",
    "url": "https://x.com/WilliamsRuto/status/1983416840237003238",
    "created_at": "Wed Oct 29 06:13:19 +0000 2025",
    "text": "Commissioning of CT Scan Unit, Nakuru County Referral and Teaching Hospital https://t.co/PqE8iP0Z5d",
    "likes": 84,
    "retweets": 13,
    "replies": 18,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1983416170444402885",
    "url": "https://x.com/WilliamsRuto/status/1983416170444402885",
    "created_at": "Wed Oct 29 06:10:39 +0000 2025",
    "text": "Commissioning of CT Scan Unit, Nakuru County Referral and Teaching Hospital https://t.co/mAgTYOYHvM",
    "likes": 74,
    "retweets": 16,
    "replies": 14,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1981998064358318112",
    "url": "https://x.com/WilliamsRuto/status/1981998064358318112",
    "created_at": "Sat Oct 25 08:15:36 +0000 2025",
    "text": "Delivering the Plan: Reviving the Galana Kulalu Food Security Project. https://t.co/Ca2eXB6X0L",
    "likes": 491,
    "retweets": 120,
    "replies": 79,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1977000672026304536",
    "url": "https://x.com/WilliamsRuto/status/1977000672026304536",
    "created_at": "Sat Oct 11 13:17:45 +0000 2025",
    "text": "Our investment in the Galana Kulalu Food Security Project in Kilifi and Tana River Counties is now bearing fruit. Today we begin the first major maize harvest on 330 acres, with each acre expected to yield 28 to 30 bags.\n\nAlready, 1,500 acres have been planted. By the end of this year, a further 1,700 acres will be under cultivation, bringing the total to 5,400 acres.\n\nThis progress, together with our broader agricultural reforms, is driving Kenya towards food security and enabling us to produce surplus for export.",
    "likes": 1947,
    "retweets": 324,
    "replies": 221,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1972659776954741118",
    "url": "https://x.com/WilliamsRuto/status/1972659776954741118",
    "created_at": "Mon Sep 29 13:48:35 +0000 2025",
    "text": "Kenya and Italy have had excellent diplomatic  relations for six decades anchored in trade and investment, education, health, agriculture, culture and people-to-people relations. Kenya stands ready to working with Italy to implement the Mattei Plan for Africa, which  promotes partnerships in energy, infrastructure and health. \n\nBid farewell to Ambassador Roberto Natali of Italy, State House Nairobi, whose tour of duty in our country has come to an end. Congratulated him for strengthening the ties between our two nations and wished him well in his future endeavour.",
    "likes": 642,
    "retweets": 103,
    "replies": 53,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1971032283088818457",
    "url": "https://x.com/WilliamsRuto/status/1971032283088818457",
    "created_at": "Thu Sep 25 02:01:30 +0000 2025",
    "text": "Africa can and must finance its own health future. With ambition,  innovation, and unity, we can deliver a future where every African enjoys quality, affordable healthcare, financed by Africa, for Africa.\n\nAt the same time, we call for urgent reform of the global health architecture, which remains unbalanced and unfair. Africa cannot continue to be left last in line for vaccines, diagnostics, and treatment.\n\nWe emphasise the need for fair pricing, genuine technology transfer, inclusive research and development, and sustained investment in Africa’s manufacturing capacity.\n\nDuring the Uniting for Global Health Security Meeting on the sidelines of UNGA, New York.\nReaffirmed Kenya’s commitment to the African Leaders Malaria Alliance and to the “Zero Malaria Starts with Me” campaign.",
    "likes": 378,
    "retweets": 82,
    "replies": 56,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1970921341038755886",
    "url": "https://x.com/WilliamsRuto/status/1970921341038755886",
    "created_at": "Wed Sep 24 18:40:40 +0000 2025",
    "text": "Innovative Domestic Resource Mobilisation for the \"Big Push\" Toward Malaria Elimination, New York, USA https://t.co/Fbd7s7oxbz",
    "likes": 143,
    "retweets": 34,
    "replies": 15,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1970285483784650905",
    "url": "https://x.com/WilliamsRuto/status/1970285483784650905",
    "created_at": "Tue Sep 23 00:34:00 +0000 2025",
    "text": "Sustainable financing for health systems remains a challenge, worsened by the withdrawal of external funds. The lesson is clear: ownership matters, and when communities set priorities and monitor resources, resilience grows.\n\nKenya is advancing Universal Health Coverage to guarantee access for all: enacting four new laws on social health insurance, empowering over 100,000 community health promoters with medicines, tools, and stipends, strengthening participatory budgeting through digital platforms, and reinforcing primary health care networks. These reforms ensure no one is left behind.\n\nWe call on the global community to invest not only in medicines and infrastructure, but in the democratic right of citizens to shape their health and future.\n\nAddressed a side event on social participation in health equity and resilient societies, co-hosted by Slovenia and the WHO at the 80th UNGA in New York.",
    "likes": 166,
    "retweets": 32,
    "replies": 9,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1970172964139421945",
    "url": "https://x.com/WilliamsRuto/status/1970172964139421945",
    "created_at": "Mon Sep 22 17:06:53 +0000 2025",
    "text": "Social Participation and Health Equity as Drivers of Sustainable and Prosperous Societies, New York, USA https://t.co/scjLBChqww",
    "likes": 115,
    "retweets": 27,
    "replies": 19,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1968967903954587829",
    "url": "https://x.com/WilliamsRuto/status/1968967903954587829",
    "created_at": "Fri Sep 19 09:18:24 +0000 2025",
    "text": "We made an irrevocable commitment to deliver Universal Health Coverage for all Kenyans, regardless of their economic status.\n\nToday, we have taken another significant step in fulfilling that pledge.\n\nThrough the new SHA Sponsorship Programme, more than 2.2 million vulnerable Kenyans will now access medical care free of charge.\n\nWe will continue identifying and bringing more of our most vulnerable citizens into this fold, ensuring they benefit from a healthcare system that is robust, responsive, and truly equitable.\n\nAt State House, Nairobi, launched the SHA Sponsorship to the vulnerable that furthers our mission to making our healthcare universal.",
    "likes": 474,
    "retweets": 100,
    "replies": 107,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1963617289141424348",
    "url": "https://x.com/WilliamsRuto/status/1963617289141424348",
    "created_at": "Thu Sep 04 14:56:58 +0000 2025",
    "text": "Governor @A_S_Nassir of Mombasa County stands as a shining example of how visionary and inspiring leadership can drive real transformation in Kenya.\n\nThrough his focused guidance and steadfast commitment, Mombasa has achieved a remarkable milestone — ranking as the number one county in the country in SHA registration, ahead of all 47 counties. This is no small feat, but a testament to bold leadership and collective effort.\n\nWe remain steadfast in working with counties to ensure that healthcare in Kenya is not a privilege for the few, but a guaranteed right for every citizen.\n\nAt the Coast General Teaching & Referral Hospital, Mombasa County.",
    "likes": 451,
    "retweets": 91,
    "replies": 59,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1962906578207625484",
    "url": "https://x.com/WilliamsRuto/status/1962906578207625484",
    "created_at": "Tue Sep 02 15:52:51 +0000 2025",
    "text": "Kenya will change for the better in our lifetime as we continue to make bold decisions that are right and benefit all citizens. The Asian Tigers, including Singapore and South Korea that were at the same economic level with us 60 years ago, were transformed by focused and bold leadership.\n\nOur transformative interventions in agriculture, affordable housing, health, fresh produce markets, education and training, and infrastructure, among others, are the engines powering our country forward for shared prosperity.\n\nMet professionals from Kuria West and Kuria East constituencies, Migori County. Present were Social Protection Principal Secretary Joseph Motari, Deputy Governor Joseph Mahiri and MPs Mathias Robi (Kuria West) and Kitayama Maisori (Kuria East).",
    "likes": 582,
    "retweets": 97,
    "replies": 188,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1962802241288438239",
    "url": "https://x.com/WilliamsRuto/status/1962802241288438239",
    "created_at": "Tue Sep 02 08:58:16 +0000 2025",
    "text": "For far too long, Turkana County’s progress has been held back, leaving it to lag behind other regions of our nation.\n\nThat is why we are transforming Turkana’s infrastructure, starting with the overhaul of the Maili Tisa–Kitale–Kainuk–Lokichar Road, a lifeline that will connect the County to greater opportunities and markets.\n\nWe are also powering Turkana’s future through a Sh2.3 billion rural electrification project, constructing a Sh900 million modern stadium in Lodwar, and expanding the Turkwel Irrigation Scheme with a Sh2.5 billion investment that will put more than 100,000 acres of land under productive cultivation.\n\nAt the same time, we are building two modern fish markets worth Sh700 million, upgrading and equipping Lodwar County Referral Hospital, and constructing Sh2.3 billion worth of hostels to ensure university and college students in the region have safe, dignified housing.\n\nAt State House, Nairobi, engaged grassroots leaders from Turkana County and challenged them to accelerate SHA registration in the area to guarantee affordable and quality healthcare for every household.",
    "likes": 684,
    "retweets": 130,
    "replies": 141,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1962150113490440637",
    "url": "https://x.com/WilliamsRuto/status/1962150113490440637",
    "created_at": "Sun Aug 31 13:46:56 +0000 2025",
    "text": "We are delivering safe, clean, and affordable drinking water to households across the country; transforming livelihoods, improving sanitation, and enhancing the quality of life for every Kenyan.\n\nCommissioned the Ugunja–Sega–Ukwala Water Supply and Sanitation Project and addressed the people of Magoya, Siaya County. \n\nThis Sh1 billion investment is a game-changer, serving close to 20,000 households and supplying over 10 million litres of water daily to the people of Ugunja, Ukwala, Sega, and their surrounding communities.",
    "likes": 635,
    "retweets": 120,
    "replies": 78,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1960641204699193508",
    "url": "https://x.com/WilliamsRuto/status/1960641204699193508",
    "created_at": "Wed Aug 27 09:51:04 +0000 2025",
    "text": "We made a solemn commitment to the people of Kenya to transform our nation. We are proud to report that this promise is no longer a dream; it is unfolding before our eyes in healthcare, education, agriculture, infrastructure and employment, among others.\n\nFor example, healthcare is no longer a privilege for the few who can afford, but a right for every Kenyan. We are also digitising our health system to seal the loopholes that crippled the defunct NHIF, ensuring that the new Social Health Authority (SHA) delivers on its mandate.\n\nSHA must work, and it will work.\n\nMet grassroots leaders from Kiambu County, State House, Nairobi, and shared our three-year report card. \n\nThrough bold, deliberate, and resolute decisions, we are delivering the largest markets' development in Kenya’s history, including 30 modern markets in Kiambu County alone at a cost of KSh4.5 billion. In addition, we are building 15,000 housing units in the county at a total of KSh30 billion.\n\nWe are also breaking new ground in infrastructure. A new 10,000-seater stadium will be built in Thika town. We will also complete the 240km Mau Mau roads in the Kiambu section, and dual the Muthaiga-Ndumberi road at KSh22 billion and the Northern Bypass for which we have allocated KSh20 billion.\n\nThe choices we make may be tough, but we remain unbowed. Kenya must be transformed.",
    "likes": 757,
    "retweets": 116,
    "replies": 264,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1960275760045805658",
    "url": "https://x.com/WilliamsRuto/status/1960275760045805658",
    "created_at": "Tue Aug 26 09:38:56 +0000 2025",
    "text": "We deeply value our close ties with the Ismaili Imamat, which have fostered strong collaboration in critical areas such as healthcare, education, environmental conservation, and cultural preservation.\n\nThis partnership has delivered health facilities that serve over 900,000 patients annually, supported nearly 1,000 public schools, and facilitated the planting of 1.5 million trees in Kenya over the past three years.\n\nWe look forward to expanding our cooperation in the Affordable Housing Programme, which will provide safe homes and create thousands of jobs, as well as in the Nairobi River Regeneration through the Climate WorX initiative, which already engages 40,000 Kenyans in restoring ecosystems and renewing our capital city.\n\nAt State House, Nairobi, I hosted His Highness Prince Rahim Al-Hussaini Aga Khan V, whom I congratulated on assuming the leadership of the Shia Ismaili Imamat and on receiving our nation’s highest civilian honour, the Chief of the Order of the Golden Heart (C.G.H.).\n\nI also congratulated Princess Zahra Aga Khan on being awarded the Elder of the Order of the Golden Heart (E.G.H.) for her lifelong service to health, education, and social development.",
    "likes": 630,
    "retweets": 115,
    "replies": 84,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1958807037237690774",
    "url": "https://x.com/WilliamsRuto/status/1958807037237690774",
    "created_at": "Fri Aug 22 08:22:45 +0000 2025",
    "text": "Africa's economies are among the fastest-growing in the world, with Sub-Saharan GDP estimated to grow by 4 per cent compared to the global average of 3 per cent.\n\nHowever, this growth has not adequately translated into poverty reduction, more jobs or even better health and educational services.\n\nBetter still, for inclusive growth and shared prosperity to become a reality for our citizens and consequently leave no one behind, we must substantially invest in people, their health, education and essentially their well-being.\n\nGave the keynote address at the Tokyo International Conference on African Development plenary summit on the Society Pillar, Yokohama City, Japan.",
    "likes": 669,
    "retweets": 115,
    "replies": 80,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1958468078389297271",
    "url": "https://x.com/WilliamsRuto/status/1958468078389297271",
    "created_at": "Thu Aug 21 09:55:51 +0000 2025",
    "text": "Kenya has signed various development cooperation documents at the ongoing Tokyo International Conference on African Development, TICAD, in Yokohama City, Japan.\n\nThey include the Statement of Intent on the Samurai Bond, a financial instrument issued by foreign entities in the Japanese capital markets, signed between our National Treasury and Nippon Export and Investment Insurance.\n\nOur plan to access financing in the Japanese capital markets is a leap forward in our innovative policy of diversifying resource mobilisation for priority national development and transformation.\n\nWe also signed a Letter of Intent and Concept Note to Accelerate Access to Cefiderocol, a crucial antibiotic approved for effective treatment of bacterial pneumonia, in Kenya.\n\nThe agreement also provides for the supply of the medicine with support from the Global Antibiotic Research and Development Foundation.\n\nIt was signed between Kenya's Ministry of Health and Shionogi and Co. Ltd of Japan, which specialises in pharmaceutical research, development and manufacturing.\n\nAlso signed is a Memorandum of Cooperation on Human Resource Development between the Kenya Industrial Research and Development Institution and the Japanese Ministry of Economy, Trade and Industry.\n\nAttended the ceremony for signed cooperation documents at TICAD 9, Yokohama City.",
    "likes": 502,
    "retweets": 113,
    "replies": 66,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1955947736563335661",
    "url": "https://x.com/WilliamsRuto/status/1955947736563335661",
    "created_at": "Thu Aug 14 11:00:54 +0000 2025",
    "text": "Kenyans are demanding practical solutions to the challenges in our country and seeking an improvement in their lives. And that is what we have endeavoured to do in the past three years.\n\nWe have stabilised the economy, reformed the agricultural value chain, implemented universal healthcare under the Social Health Authority and pursued deliberate policies to create jobs for our youth.\n\nTo build on these gains, we are working with progressive leaders across the political divide to strengthen national unity and togetherness.\n\nMet grassroots leaders from Migori County at Sony Sugar Green Stadium in Awendo. Joined by Governor Ochillo Ayacko, MPs and MCAs.",
    "likes": 651,
    "retweets": 106,
    "replies": 94,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1953456917822447882",
    "url": "https://x.com/WilliamsRuto/status/1953456917822447882",
    "created_at": "Thu Aug 07 14:03:17 +0000 2025",
    "text": "We are upgrading and modernising equipment at our health facilities to ensure they are equipped with cutting-edge diagnostic and treatment technologies accessible to everyone.\n\nThrough this innovative and transformative programme, we are shifting from a fragmented and costly medical equipment supply to a smart and pay-for-service method of healthcare delivery. \n\nThis new, cost-effective and sustainable model furthers our agenda of health being a right rather than a privilege for all Kenyans.\n\nAt State House, launched the National Equipment Service Project that will revolutionise healthcare infrastructure and service delivery.",
    "likes": 555,
    "retweets": 99,
    "replies": 47,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1953418781755379978",
    "url": "https://x.com/WilliamsRuto/status/1953418781755379978",
    "created_at": "Thu Aug 07 11:31:44 +0000 2025",
    "text": "Flagging-off of Counties Health Equipment, State House https://t.co/ZBkYiRz8Ii",
    "likes": 147,
    "retweets": 29,
    "replies": 26,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1952354785295753569",
    "url": "https://x.com/WilliamsRuto/status/1952354785295753569",
    "created_at": "Mon Aug 04 13:03:48 +0000 2025",
    "text": "The transformation of our country will only become a reality with leaders who make the decisions that are not only necessary and bold, but also right. For far too long, Kenya has lagged behind its peers because we procrastinated in making bold decisions.\n\nI am pleased that our decisions on universal health coverage, quality and affordable education, affordable housing and revitalised agriculture are paying dividends to the citizens of our country.\n\nMet leaders from Tharaka-Nithi County, State House, Nairobi, and explained our transformation agenda, including the provision of water and the construction of Nithi Bridge.",
    "likes": 822,
    "retweets": 132,
    "replies": 133,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1950866048481112210",
    "url": "https://x.com/WilliamsRuto/status/1950866048481112210",
    "created_at": "Thu Jul 31 10:28:05 +0000 2025",
    "text": "The national transformation agenda is on track across the country. Universal healthcare has taken shape and is delivering services more comprehensively than ever before.\n\nOur housing, markets and institutional hostels' programmes are progressing well and Kenyans are benefiting as homeowners, while Mama Mboga is getting decent space to trade.\n\nMet MPs from Nyandarua County, State House Nairobi. We discussed the expansion of JM Kariuki Hospital, the proposed Nyandarua University and building of Ol Kalou Stadium, electrification and resumption of road construction.",
    "likes": 469,
    "retweets": 68,
    "replies": 59,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1950188871439757435",
    "url": "https://x.com/WilliamsRuto/status/1950188871439757435",
    "created_at": "Tue Jul 29 13:37:14 +0000 2025",
    "text": "Kenya appreciates the Arab Bank for Economic Development in Africa for its continued support in infrastructure, health and agriculture.\n\nWe commit to work closely with financial partners to transform our country. \n\nMet the President of the Arab Bank for Economic Development in Africa Abdullah Almusaibeeh, State House, Nairobi.",
    "likes": 602,
    "retweets": 99,
    "replies": 59,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1948656210271449325",
    "url": "https://x.com/WilliamsRuto/status/1948656210271449325",
    "created_at": "Fri Jul 25 08:06:59 +0000 2025",
    "text": "We are on course to making Kenya food secure.\n\nThe transformative Galana-Kulalu Food Security Project is one of our many initiatives that will scale up our production. @Irrigation_Auth https://t.co/orCp5xOeGy",
    "likes": 3001,
    "retweets": 510,
    "replies": 479,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1941084790125429122",
    "url": "https://x.com/WilliamsRuto/status/1941084790125429122",
    "created_at": "Fri Jul 04 10:40:52 +0000 2025",
    "text": "We will work with all leaders to transform Kenya. We are particularly keen on ensuring that our health system works so as to lessen financial burden on everyone.\n\nWith Embu County grassroots leaders at State House, Nairobi.\n\nWe agreed to build three more markets in the County, bringing the total number to 12. We will also invest Sh1 billion in the region to connect more than 12,000 households to electricity.",
    "likes": 1055,
    "retweets": 148,
    "replies": 411,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1940646447042506833",
    "url": "https://x.com/WilliamsRuto/status/1940646447042506833",
    "created_at": "Thu Jul 03 05:39:03 +0000 2025",
    "text": "Our Social Health Authority is working. In eight months, the transformative medical scheme has served more than 4.9 million people, way above what NHIF would have managed.  \n\nThe criminal elements that are staining SHA will not succeed. We have tracked and closed over 1,000 medical facilities engaging in fraud. More are on the way.\n\nOur health programme must remain efficient and incorruptible.\n\nEngaged Kenyans living and working in the United Kingdom, London.",
    "likes": 873,
    "retweets": 141,
    "replies": 191,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1940445162410230018",
    "url": "https://x.com/WilliamsRuto/status/1940445162410230018",
    "created_at": "Wed Jul 02 16:19:13 +0000 2025",
    "text": "Kenya and the United Kingdom are deepening their longstanding partnership in health through collaboration in research, innovation and capacity building.\n\nWitnessed the signing of MoUs with the University of Nottingham and King’s College London to join the Kenya-UK Health Alliance in establishing Centres of Health Education and Research Excellence in Kenya, one of the three in Africa.\n\nAlso signed was an MoU with the Liverpool School of Tropical Medicine to support local manufacturing through the BRITE initiative at the BioVax Institute.\n\nThese initiatives are building local expertise, advancing research, and ensuring equitable access to care, key pillars of Kenya’s journey towards Universal Health Coverage.",
    "likes": 513,
    "retweets": 89,
    "replies": 64,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1940378810610061762",
    "url": "https://x.com/WilliamsRuto/status/1940378810610061762",
    "created_at": "Wed Jul 02 11:55:33 +0000 2025",
    "text": "Kenya - UK Strategic Health Partnership, King's College London. https://t.co/46jSBHzk5N",
    "likes": 429,
    "retweets": 76,
    "replies": 40,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1940375547726729342",
    "url": "https://x.com/WilliamsRuto/status/1940375547726729342",
    "created_at": "Wed Jul 02 11:42:35 +0000 2025",
    "text": "Kenya - UK Strategic Health Partnership, King's College London. https://t.co/JronDCWDyY",
    "likes": 303,
    "retweets": 56,
    "replies": 16,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1937754917449367552",
    "url": "https://x.com/WilliamsRuto/status/1937754917449367552",
    "created_at": "Wed Jun 25 06:09:08 +0000 2025",
    "text": "I was pleased to welcome His Highness Prince Rahim Al Hussaini Aga Khan’s envoy, H.E. Sultan Ali Allana, State House, Nairobi.\n\nI have extended an invitation for His Highness the Aga Khan to visit Kenya for the signing of an agreement for the recognition of the Ismaili Imamat and for the conferment of Kenya’s highest civil honours, the Chief of the Order of the Golden Heart (C.G.H.).\n\nI appreciate the work undertaken by the AKDN in Kenya, especially in health and education.",
    "likes": 4452,
    "retweets": 392,
    "replies": 1071,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1932440404604924391",
    "url": "https://x.com/WilliamsRuto/status/1932440404604924391",
    "created_at": "Tue Jun 10 14:11:10 +0000 2025",
    "text": "Kenya’s ambitious universal healthcare programme has raised our status as a respected member in community of Nations. It has enhanced the services accessible to girls and women, bringing relief to our citizens who were previously not on any medical cover.\n\nKenya is ready to share the lessons learnt and also keen to learn from the experience of other countries. \n\nPleased to share the experience of our universal healthcare programme with United Nations Population Fund Executive Director Dr. Natalia Kanem, State House, Nairobi. @Atayeshe",
    "likes": 884,
    "retweets": 112,
    "replies": 343,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1932136991870902628",
    "url": "https://x.com/WilliamsRuto/status/1932136991870902628",
    "created_at": "Mon Jun 09 18:05:30 +0000 2025",
    "text": "Kenya will be transformed by leaders who are prepared to take bold and decisive steps to change the lives of the people.\n\nThrough bold decisions, we have made great strides in stabilising the economy, increasing agricultural productivity and enhancing social security for a better future.\n\nEqually, we have also made tough decisions in making affordable housing a reality, and ensuring the provision of universal healthcare.\n\nAt State House, Nairobi, pleased to meet artistes who appraised me of the issues affecting their sector. We agreed to work together for a better Kenya for all.",
    "likes": 1187,
    "retweets": 128,
    "replies": 788,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1930299452939501674",
    "url": "https://x.com/WilliamsRuto/status/1930299452939501674",
    "created_at": "Wed Jun 04 16:23:47 +0000 2025",
    "text": "Hosted Governors to consult and review progress on the implementation of key inter-governmental development projects.\n\nWe have embarked on an ambitious digitisation programme of our public health facilities to weed out fake hospitals that have for long unfairly benefitted from public funds.\n\nTo deepen our agricultural reforms, we will harmonise  and consolidate operations of agencies and departments under the Ministry of Agriculture. \n\nWe will also enhance animal traceability by registering livestock farmers and introducing the e-voucher system for animal vaccination as we successfully did with the distribution of subsidised fertiliser.\n\nFurther, we will leverage our robust cooperative ecosystem to unlock the full potential in the agriculture sector, increase productivity, improve prices, and put more money in farmers' pockets.\n\nWe will continue consulting frequently as two levels of government to foster a harmonious working relationship.",
    "likes": 533,
    "retweets": 103,
    "replies": 91,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1925877681003855875",
    "url": "https://x.com/WilliamsRuto/status/1925877681003855875",
    "created_at": "Fri May 23 11:33:14 +0000 2025",
    "text": "We are streamlining the provision of universal health coverage by engaging stakeholders on the key issues about the Social Health Authority, including more registration of members and payment to hospitals.\n\nMet Faith-Based Health Services Consortium, State House, Nairobi, led by the chairman, Maseno North Anglican Bishop Charles Asilutwa.",
    "likes": 808,
    "retweets": 84,
    "replies": 88,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1925629022530068736",
    "url": "https://x.com/WilliamsRuto/status/1925629022530068736",
    "created_at": "Thu May 22 19:05:10 +0000 2025",
    "text": "Maendeleo ya Wanawake Organisation has over the years played a key role in the empowerment of grassroots women across the country.\n\nThe government will continue working with the organisation and others to realise our transformation agenda, including the rolling out of the Universal Health Coverage, empowering communities through the provision of water and other initiatives.\n\nPleased to meet the Maendeleo ya Wanawake National Executive Council  led by Ms Rahab Mwikali Muiu, State House, Nairobi.",
    "likes": 434,
    "retweets": 76,
    "replies": 53,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1920768915652681997",
    "url": "https://x.com/WilliamsRuto/status/1920768915652681997",
    "created_at": "Fri May 09 09:12:50 +0000 2025",
    "text": "We are strengthening public health systems and grassroots disease surveillance, and enhancing emergency response through strategic investments and collaboration.\n\nThe deployment of digitised, integrated surveillance systems across all the 47 counties, alongside targeted training, has boosted national vigilance by streamlining detection at both health facility and community levels.\n\nAt State House Nairobi, handed over disease surveillance vehicles designated for each county government in the presence of governors.\n\nI once again appeal to all Kenyans to register with the Social Health Authority as we advance the implementation of Universal Health Coverage.",
    "likes": 560,
    "retweets": 95,
    "replies": 65,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1920741765423739271",
    "url": "https://x.com/WilliamsRuto/status/1920741765423739271",
    "created_at": "Fri May 09 07:24:57 +0000 2025",
    "text": "Handing over of Disease Surveillance Vehicles, State House, Nairobi. https://t.co/tQipHUieY6",
    "likes": 266,
    "retweets": 48,
    "replies": 34,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1920103006638346456",
    "url": "https://x.com/WilliamsRuto/status/1920103006638346456",
    "created_at": "Wed May 07 13:06:45 +0000 2025",
    "text": "Laid the foundation stone for the Amalo Sub-County Level IV Hospital in Sogoo, Narok West Constituency.\n\nThis elevates the Sogoo Health Centre, that has been serving 2,500 people a month, bringing more specialised services closer to the people.\n\nThe expanded hospital will ease the burden of the people who have been travelling the long distance to Ololung'a, Narok and Bomet. They will access services such as radiology, theatre, and specialised clinics.\n\nEarlier, inspected construction of the Deputy County Commissioner’s Office.",
    "likes": 277,
    "retweets": 45,
    "replies": 27,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1919706972821066208",
    "url": "https://x.com/WilliamsRuto/status/1919706972821066208",
    "created_at": "Tue May 06 10:53:03 +0000 2025",
    "text": "We are deploying adequate resources to develop and expand infrastructure and facilities that support the training of our medical practitioners.\n \nOur goal is to ensure we have sufficient, well-trained professionals to provide proper healthcare, which is not a privilege for the few who can afford it but a constitutional right for every Kenyan.\n\nOfficially opened the Kenya Medical Training College Narok Campus, Narok Town, Narok County. The facility can accommodate over 1,000 students and comes equipped with state of the art facilities.",
    "likes": 381,
    "retweets": 69,
    "replies": 53,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1919682264142868571",
    "url": "https://x.com/WilliamsRuto/status/1919682264142868571",
    "created_at": "Tue May 06 09:14:52 +0000 2025",
    "text": "Kenya Medical Training College, Narok Town. https://t.co/V9r17hsNb6",
    "likes": 108,
    "retweets": 23,
    "replies": 16,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1917294530589778381",
    "url": "https://x.com/WilliamsRuto/status/1917294530589778381",
    "created_at": "Tue Apr 29 19:06:52 +0000 2025",
    "text": "Constant consultation and unity of purpose among leaders are crucial in our endeavour to work together for inclusive national development and shared prosperity. Additionally, when leaders have a common vision, they are able to meet the needs of citizens.\n\nHeld a consultative meeting with leaders from Meru County at State House, Nairobi. They included Governor Mutuma M’Ethingia, Members of Parliament, and Members of the County Assembly.\n\nAmong the issues discussed were roads and better returns for coffee, dairy, tea, avocado and miraa farmers. Others were security, health infrastructure, student accommodation, affordable housing and fresh produce markets.",
    "likes": 847,
    "retweets": 105,
    "replies": 345,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1912428300691017738",
    "url": "https://x.com/WilliamsRuto/status/1912428300691017738",
    "created_at": "Wed Apr 16 08:50:12 +0000 2025",
    "text": "Our expansion and modernisation of medical infrastructure across the country guarantees every Kenyan access to quality and affordable care.\n\nOpened the Lanet Regional Hospital at the Kenya Military Academy in Lanet, Nakuru County.\n\nThe 150-bed capacity facility brings specialised health care — such as ICU, renal analysis and specialised surgery — closer to Service personnel, their dependants, veterans and the surrounding community.\n\nAlso launched the Ulinzi Prime Health Services Fund that allows civilians to access services at KDF Medical facilities.",
    "likes": 468,
    "retweets": 78,
    "replies": 82,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1911814000956121107",
    "url": "https://x.com/WilliamsRuto/status/1911814000956121107",
    "created_at": "Mon Apr 14 16:09:12 +0000 2025",
    "text": "The Social Health Authority has significantly changed the provision and delivery of healthcare across the country in the past six months. More Kenyans are registering for SHA, more services are increasingly being offered and efficiency in the payment of services has remarkably improved.\n\nMet religious leaders to continue our discussions on enhancing the efficiency of SHA at faith-based health facilities, State House Nairobi. They included Maseno North Anglican Bishop Charles Asilutwa, Machakos Catholic Bishop Norman King'oo Wambua, Africa Inland Church Presiding Bishop Abraham Mulwa and Supkem National Chairman Hassan ole Naado.",
    "likes": 863,
    "retweets": 100,
    "replies": 267,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1908083523006714224",
    "url": "https://x.com/WilliamsRuto/status/1908083523006714224",
    "created_at": "Fri Apr 04 09:05:37 +0000 2025",
    "text": "After a 50-year wait to benefit from government dams situated in their lands, the people of Mbeere South, Embu County, finally have a reason to smile.\n\nLaunched the construction of the intake, water treatment plant, and the laying of 26km of pipes at Kamburu Dam Water Supply project.\n\nOnce complete, the project being undertaken at a cost of KSh789 million will benefit 88,000 residents with clean drinking water and boost food production through irrigation.",
    "likes": 588,
    "retweets": 81,
    "replies": 114,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1907726969694748824",
    "url": "https://x.com/WilliamsRuto/status/1907726969694748824",
    "created_at": "Thu Apr 03 09:28:48 +0000 2025",
    "text": "We will support the County Government of Nyandarua with KSh800 million to complete the stalled J.M. Kariuki Memorial County Referral Hospital.\n\nThis will ensure that the people of Nyandarua have access to quality and affordable medical care.\n\nAssessed the ongoing construction of the 142-bed capacity J.M. Kariuki Memorial County Referral Hospital that will offer in-patient, outpatient, imaging, laboratory, emergency, and maternal and child healthcare services. \n\nAlso flagged off the Last Mile Electricity Connectivity Project at the Jua Kali Stage, Ol Kalou Town and inspected the Ol Kalou Affordable Housing.",
    "likes": 490,
    "retweets": 78,
    "replies": 100,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1907690557927035019",
    "url": "https://x.com/WilliamsRuto/status/1907690557927035019",
    "created_at": "Thu Apr 03 07:04:06 +0000 2025",
    "text": "Proposed J.M. Memorial Hospital Complex and Last Mile Connectivity, Ol Kalou Town, Nyandarua County. https://t.co/jKi8c3zHcG",
    "likes": 122,
    "retweets": 29,
    "replies": 12,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1904832079017210361",
    "url": "https://x.com/WilliamsRuto/status/1904832079017210361",
    "created_at": "Wed Mar 26 09:45:32 +0000 2025",
    "text": "We are engaging leaders from across the country to accelerate the implementation of our national development agenda, ensuring no region is left behind.\n\nToday at @StateHouseKenya Nairobi, held consultations with leaders from Western Kenya to assess progress on key priority projects. These include strengthening agricultural value chains, particularly increasing fertiliser uptake to boost food production and reviving the sugar and coffee sectors in the region.\n\nWe also discussed urgent infrastructure needs, including roads, power connections  and ongoing fresh produce markets. Other areas of focus were universal health coverage and projects that will improve access to clean water.\n\nPrime Cabinet Secretary @MusaliaMudavadi, National Assembly Speaker @HonWetangula, Cabinet Secretaries @DrOparanya (Cooperatives and MSMEs) and @DeboraBarasa (Health), as well as Governors @BarasaFernandes (Kakamega), @SpeakerKLusaka (Bungoma) and Paul Otuoma (Busia), and members of Parliament were present.",
    "likes": 754,
    "retweets": 120,
    "replies": 168,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1904600782168826137",
    "url": "https://x.com/WilliamsRuto/status/1904600782168826137",
    "created_at": "Tue Mar 25 18:26:26 +0000 2025",
    "text": "Faith-based organisations have a good working partnership with the government in the delivery of healthcare across the country. Their contribution in the provision of services has significantly strengthened Kenya's health system and  boosted citizens' well-being.\n\nAt @StateHouseKenya, Nairobi, met religious leaders and discussed the ongoing enhancement of health reforms in our country. They included Maseno North Anglican Church Bishop Charles Asilutwa, Africa Gospel Church Bishop Robert Lang'at and Machakos Catholic Bishop Norman King'oo Wambua.\n\nOthers were Africa Inland Church Presiding Bishop Abraham Mulwa, Methodist Church Presiding Bishop Isaiah Deye and PCEA Moderator Thegu Mutahi.",
    "likes": 541,
    "retweets": 74,
    "replies": 103,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1902385813276561887",
    "url": "https://x.com/WilliamsRuto/status/1902385813276561887",
    "created_at": "Wed Mar 19 15:44:57 +0000 2025",
    "text": "Held talks with King Letsie III of Lesotho, State House Nairobi. \n\nWe affirmed the strong and cordial relations between our two nations, and deliberated on ways of enhancing them.\n\nConsequently, we directed our Foreign ministers to convene the Joint Commission on Cooperation to explore more areas of collaboration.\n\nWe also discussed school feeding programmes in Kenya and Lesotho, and expressed satisfaction with the impact they have had in education, including boosting school attendance, improving learning outcomes, and enhancing health and nutrition.",
    "likes": 520,
    "retweets": 80,
    "replies": 63,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1901931117495586835",
    "url": "https://x.com/WilliamsRuto/status/1901931117495586835",
    "created_at": "Tue Mar 18 09:38:09 +0000 2025",
    "text": "We have made available additional resources to facilitate ongoing reforms in the education sector, with KSh18 billion allocated to the Teachers Service Commission for insurance shortfalls, teacher promotion and personal emolument shortfalls.\n\nA further KSh16 billion has been set aside for university education, KSh8 billion for TVETs and KSh600 million for the School Feeding Programme.\n\nThe financing gap in health sector reforms is being bridged, with KSh1.5 billion set aside for recapitalisation of KEMSA, KSh3 billion for Primary Healthcare Fund, KSh3 billion for the Emergency, Chronic and Critical Illness Fund and KSh1.5 billion for healthcare interns.\n\nAt State House Nairobi, assented to the Supplementary Appropriation Bill (National Assembly Bill No. 8 2025).\n\nOther areas that have been funded include subsidised fertiliser (KSh6.6 billion), County Aggregation and Industrial Parks (KSh1.2 billion), Equalisation Fund (KSh3.7 billion), settlement of the landless (KSh370 million), Thwake Dam (KSh1 billion) and KSh700 million allocated to New KCC for mopping up milk, among others.",
    "likes": 818,
    "retweets": 153,
    "replies": 222,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1900496408127640037",
    "url": "https://x.com/WilliamsRuto/status/1900496408127640037",
    "created_at": "Fri Mar 14 10:37:07 +0000 2025",
    "text": "We are improving sanitation by providing proper waste management to enhance quality of life and human dignity, especially in urban areas.\n\nIn Embakasi West during the groundbreaking of the Umoja Sewerage System that will connect more than 50,000 households in Kariobangi, Maili Saba, Umoja, Saika, Tassia and Tena to sewer lines.",
    "likes": 671,
    "retweets": 99,
    "replies": 111,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1900185246156398631",
    "url": "https://x.com/WilliamsRuto/status/1900185246156398631",
    "created_at": "Thu Mar 13 14:00:41 +0000 2025",
    "text": "We are making our school meals more nutritious to ensure that our children remain healthy and perform better in class.\n\nServed lunch — chapati, rice and special ndengu — to students of Toi Primary School under the transformative Dishi Na County programme, Kibra Constituency. https://t.co/lp64q40Nad",
    "likes": 694,
    "retweets": 82,
    "replies": 173,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1899726673773543468",
    "url": "https://x.com/WilliamsRuto/status/1899726673773543468",
    "created_at": "Wed Mar 12 07:38:28 +0000 2025",
    "text": "Dagoretti Sub-County Hospital, Mutuini, Nairobi. https://t.co/vWe06HV1Fe",
    "likes": 96,
    "retweets": 17,
    "replies": 16,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1899090827873263745",
    "url": "https://x.com/WilliamsRuto/status/1899090827873263745",
    "created_at": "Mon Mar 10 13:31:51 +0000 2025",
    "text": "The Nairobi Rivers Regeneration Project integrates affordable housing, modern markets, and enhanced infrastructure, transforming Nairobi into a livable and economically vibrant city. \n\nExtending to Kiambu, Machakos, Kajiado, and Murang’a, it entails river rehabilitation, flood mitigation, waste management and 54-kilometre of new sewer lines, improving public health and urban resilience. \n\nWith 10,264 social housing units and over 50,000 jobs, this life-changing initiative ensures dignified living, sustainable transport and economic empowerment for thousands of residents.\n\nDuring the groundbreaking for Social Housing and Associated Infrastructure along Nairobi River, Kamukunji.",
    "likes": 626,
    "retweets": 98,
    "replies": 135,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1894352980125560909",
    "url": "https://x.com/WilliamsRuto/status/1894352980125560909",
    "created_at": "Tue Feb 25 11:45:20 +0000 2025",
    "text": "The Social Health Authority is committed to ensuring equitable and affordable access to medical care. \n\nSupplemented by the efforts of our Community Health Promoters, the new care will drive our country towards achieving Universal Health Coverage. \n\nWe ask Kenyans to register and benefit from this transformative healthcare scheme.\n\nLaid the foundation stone for the X-Ray Block and officially opened the Theatre Block at the Mkogani Sub-County Hospital, Kwale County.\n\nThe facility’s upgrade from Level III to Level IV will significantly enhance access healthcare in the area.",
    "likes": 550,
    "retweets": 72,
    "replies": 385,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1894317762371338261",
    "url": "https://x.com/WilliamsRuto/status/1894317762371338261",
    "created_at": "Tue Feb 25 09:25:23 +0000 2025",
    "text": "Laying of the foundation stone for X-Ray Block and opening of Theatre Block, Mkogani Sub-County Hospital, Kwale County. https://t.co/foCWRKbHsb",
    "likes": 153,
    "retweets": 30,
    "replies": 28,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1894316646019596630",
    "url": "https://x.com/WilliamsRuto/status/1894316646019596630",
    "created_at": "Tue Feb 25 09:20:57 +0000 2025",
    "text": "Laying of the foundation stone for X-Ray Block and opening of Theatre Block, Mkogani Sub-County Hospital, Kwale County. https://t.co/f8AWPqh96p",
    "likes": 126,
    "retweets": 25,
    "replies": 29,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1894315713726410774",
    "url": "https://x.com/WilliamsRuto/status/1894315713726410774",
    "created_at": "Tue Feb 25 09:17:15 +0000 2025",
    "text": "Laying of the foundation stone for X-Ray Block and opening of Theatre Block, Mkogani Sub-County Hospital, Kwale County. https://t.co/QiIGfZavXY",
    "likes": 248,
    "retweets": 35,
    "replies": 96,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1890508676261150851",
    "url": "https://x.com/WilliamsRuto/status/1890508676261150851",
    "created_at": "Fri Feb 14 21:09:27 +0000 2025",
    "text": "We must work together to end reliance on external support for our healthcare needs and build a stronger and more self-sufficient Africa.\n\nOur over-dependency has led to supply chain disruptions and medicine shortages during health crises like the COVID-19 pandemic, putting millions of lives at risk.\n\nTo secure sustainable provision of healthcare, we must enhance transparency, adopt innovative financing models, and strengthen public-private partnerships.\n\nJoined Presidents @PaulKagame of Rwanda (the convener), @TayeAtske (Ethiopia), @edmnangagwa (Zimbabwe), @PR_Diomaye (Senegal) and Barbados Prime Minister @miaamormottley during the High-Level Meeting of the African Union’s Domestic Health Financing on the sidelines of the 38th Ordinary Assembly of the African Union.",
    "likes": 680,
    "retweets": 121,
    "replies": 88,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1889620279912956066",
    "url": "https://x.com/WilliamsRuto/status/1889620279912956066",
    "created_at": "Wed Feb 12 10:19:16 +0000 2025",
    "text": "I had a telephone engagement with His Highness Prince Rahim Aga Khan V.\n\nI conveyed the condolences of the Government and the people of Kenya following the passing on of his father, His Highness Prince Karim Aga Khan IV.\n\nI congratulated him for his accession as the 50th Imam of the Shia Ismaili Community and pledged to continue working together in the areas of education, health, environment, among others.",
    "likes": 1241,
    "retweets": 132,
    "replies": 418,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887466164600909927",
    "url": "https://x.com/WilliamsRuto/status/1887466164600909927",
    "created_at": "Thu Feb 06 11:39:35 +0000 2025",
    "text": "We remain focused on delivering quality and affordable healthcare to Kenyans of all walks of life.\n\nIt is on this account that the government will fully equip the modern Garissa Level V Hospital the County is currently putting up.\n\nInspected the Mother and Child Unit of the Garissa Level V Teaching and Referral Hospital.",
    "likes": 332,
    "retweets": 54,
    "replies": 59,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887425701265236177",
    "url": "https://x.com/WilliamsRuto/status/1887425701265236177",
    "created_at": "Thu Feb 06 08:58:48 +0000 2025",
    "text": "Inspection of the Mother and Child Unit of the Garissa Level V Teaching and Referral Hospital. https://t.co/CEyH67IcgN",
    "likes": 148,
    "retweets": 28,
    "replies": 15,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887423805049741487",
    "url": "https://x.com/WilliamsRuto/status/1887423805049741487",
    "created_at": "Thu Feb 06 08:51:16 +0000 2025",
    "text": "Inspection of the Mother and Child Unit of the Garissa Level V Teaching and Referral Hospital. https://t.co/5QuhnSS2Yr",
    "likes": 117,
    "retweets": 25,
    "replies": 23,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887373786908873080",
    "url": "https://x.com/WilliamsRuto/status/1887373786908873080",
    "created_at": "Thu Feb 06 05:32:31 +0000 2025",
    "text": "Leaders have a duty to unite Kenyans and steer them away from retrogressive politics that slow our transformation agenda. \n\nHeld talks with grassroots leaders from Wajir County; discussed infrastructure projects and Universal Health Coverage in the region. \n\nTogether, we are committed to accelerating development and improving livelihoods.",
    "likes": 1124,
    "retweets": 144,
    "replies": 245,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887137687900987501",
    "url": "https://x.com/WilliamsRuto/status/1887137687900987501",
    "created_at": "Wed Feb 05 13:54:20 +0000 2025",
    "text": "We will document and preserve our rich heritage and culture as a people and a nation for our current and future generations.  \n\nLaunched the refurbished Wajir Museum, commissioned Wajir Satelite Blood Transfusion Centre, and inspected the ongoing construction of the ultra-modern wing of the Wajir Hospital.",
    "likes": 396,
    "retweets": 63,
    "replies": 61,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887084924815180178",
    "url": "https://x.com/WilliamsRuto/status/1887084924815180178",
    "created_at": "Wed Feb 05 10:24:41 +0000 2025",
    "text": "Launch of Livestock Vaccination Drive, Wajir County. https://t.co/EFGrT7Kdix",
    "likes": 309,
    "retweets": 48,
    "replies": 67,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887056065520628186",
    "url": "https://x.com/WilliamsRuto/status/1887056065520628186",
    "created_at": "Wed Feb 05 08:30:00 +0000 2025",
    "text": "Opening of Wajir County Blood Transfusion Centre. https://t.co/Qy18i0y4vm",
    "likes": 208,
    "retweets": 41,
    "replies": 49,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1887001638281372078",
    "url": "https://x.com/WilliamsRuto/status/1887001638281372078",
    "created_at": "Wed Feb 05 04:53:44 +0000 2025",
    "text": "Our priority is Kenya’s transformation that ensures no part of the country is left behind.\n\nWe are working with leaders from across the political divide to ensure we build a united, indivisible, and prosperous nation that every citizen can take pride in.\n\nEngaged Mandera County leaders last evening; we discussed priority programmes for the county, including security and infrastructure development, which will support their education, healthcare, transport, water, and sanitation needs.",
    "likes": 759,
    "retweets": 108,
    "replies": 148,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1886790451392356589",
    "url": "https://x.com/WilliamsRuto/status/1886790451392356589",
    "created_at": "Tue Feb 04 14:54:33 +0000 2025",
    "text": "We are committed to uniting the country and delivering services to every part of our nation without discrimination. In the North Eastern region, we are for the first time since independence building the 750km Isiolo- Modogashe- Elwak- Mandera road to open up the area and spur socio-economic transformation.\n\nCommissioned Mandera Technical Training Institute Jitume ICT hub which will expand jobs and other online opportunities for youth in the region.\n\nAlso opened the Kenya Medical Training College Mandera Campus which will enhance the rollout of Universal Health Coverage in the region by equipping healthcare practitioners with essential skills.",
    "likes": 1169,
    "retweets": 144,
    "replies": 323,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1886768435008282640",
    "url": "https://x.com/WilliamsRuto/status/1886768435008282640",
    "created_at": "Tue Feb 04 13:27:04 +0000 2025",
    "text": "We are fast-tracking the construction of Mandera Water and Sewerage Project to boost access to clean water and modern sanitation. This will address long-standing health and sanitation challenges in the region and improve residents' quality of life.\n\nIn Mandera Town, assessed the progress of the Mandera Water Supply and Sewerage Infrastructure Project that will benefit more than 12,000 households upon completion.",
    "likes": 474,
    "retweets": 77,
    "replies": 96,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1884228135568433610",
    "url": "https://x.com/WilliamsRuto/status/1884228135568433610",
    "created_at": "Tue Jan 28 13:12:49 +0000 2025",
    "text": "Our school feeding programmes have been instrumental in promoting improved health and learning outcomes, increased school attendance, and strengthened local food systems.\n\nOur aim is to double the close to three million learners who benefit from the various programmes run by the National Government, counties, and other partners.\n\nMet the Rockefeller Foundation President @rajshah in Dar es Salaam, Tanzania, on the sidelines of the African Heads of State Energy Summit. We discussed ways in which Kenya and the Rockefeller Foundation can work together to expand school feeding programmes and benefit more vulnerable learners.",
    "likes": 785,
    "retweets": 110,
    "replies": 260,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1882426698290930011",
    "url": "https://x.com/WilliamsRuto/status/1882426698290930011",
    "created_at": "Thu Jan 23 13:54:33 +0000 2025",
    "text": "The reconstruction of the Alupe Dam will enhance access to clean water for up to 100,000 people, improve public health and support economic growth through better water infrastructure and last-mile connectivity. \n\nIn Teso South, Busia County, presided over the groundbreaking of the Alupe Dam Water Supply Project.",
    "likes": 548,
    "retweets": 78,
    "replies": 174,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1882072470875947386",
    "url": "https://x.com/WilliamsRuto/status/1882072470875947386",
    "created_at": "Wed Jan 22 14:26:58 +0000 2025",
    "text": "We are expanding and equipping health care facilities throughout Kenya to deliver accessible, quality and affordable medical services to everyone.\n\nIn Kakamega County, laid the foundation stone for the construction of the Khwisero Mother-Child Level IV Hospital. https://t.co/hAN57Tgydq",
    "likes": 567,
    "retweets": 75,
    "replies": 171,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1882039305612448195",
    "url": "https://x.com/WilliamsRuto/status/1882039305612448195",
    "created_at": "Wed Jan 22 12:15:11 +0000 2025",
    "text": "Laying foundation stone for Khwisero Mother Child Level IV Hospital, Kakamega County. https://t.co/MKSBABn9eP",
    "likes": 670,
    "retweets": 88,
    "replies": 95,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1878053664541073828",
    "url": "https://x.com/WilliamsRuto/status/1878053664541073828",
    "created_at": "Sat Jan 11 12:17:40 +0000 2025",
    "text": "African countries must collaborate to build resilient food systems by investing in infrastructure, fostering innovation and adopting technology.\n\nThe objective is to end hunger in the continent, ensure access to nutritious food, promote sustainable practices that safeguard the planet's future and position agriculture as a driver of jobs and prosperity.\n\nDuring the African Union Extraordinary Summit on Comprehensive Africa Agriculture Development Programme in Kampala, Uganda.\n\nI committed at the summit that Kenya will domesticate the Kampala Declaration, adopted during the Summit, to succeed the Malabo Declaration, whose implementation period has ended.",
    "likes": 599,
    "retweets": 114,
    "replies": 164,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1877403892381577576",
    "url": "https://x.com/WilliamsRuto/status/1877403892381577576",
    "created_at": "Thu Jan 09 17:15:43 +0000 2025",
    "text": "We are committed to fulfilling our pledges by delivering priority projects that directly enhance the lives of our people. \n\nSo far, we have made significant progress in education, agricultural productivity and healthcare, and we are now expanding our focus to infrastructure development.\n\nIn Moi's Bridge, Uasin Gishu County, broke ground for the construction of KSh1.9 billion Moi's Bridge and Matunda Water and Sanitation Project that will benefit more than 100,000 people in Uasin Gishu, Trans Nzoia and Kakamega Counties.",
    "likes": 409,
    "retweets": 58,
    "replies": 135,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1877304662912806984",
    "url": "https://x.com/WilliamsRuto/status/1877304662912806984",
    "created_at": "Thu Jan 09 10:41:24 +0000 2025",
    "text": "Commissioning of Kenya Medical Training College Kerio Valley Campus, Elgeyo Marakwet County. https://t.co/8pD01Bv7ap",
    "likes": 550,
    "retweets": 73,
    "replies": 54,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1874391435950039442",
    "url": "https://x.com/WilliamsRuto/status/1874391435950039442",
    "created_at": "Wed Jan 01 09:45:17 +0000 2025",
    "text": "We have laid a strong foundation to accelerate the fulfilment of our promise to the people. Contractors delaying the implementation of key programmes will not be tolerated.\n\nIn Kisii, inspected the construction of the Kisii Cancer Centre, a vital component of our healthcare plan. \n\nI was dissatisfied with the progress and instructed the contractor to meet the deadlines or face contract termination.",
    "likes": 1095,
    "retweets": 156,
    "replies": 548,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1869022685893718523",
    "url": "https://x.com/WilliamsRuto/status/1869022685893718523",
    "created_at": "Tue Dec 17 14:11:47 +0000 2024",
    "text": "We are supporting farmers in sustaining the progress achieved in agricultural productivity, which has increased their earnings and enhanced our food security.\n\nTo ensure farmers fully benefit from international opportunities, we will implement a broad vaccination programme, using locally-produced vaccines, to reduce disease prevalence in line with global standards.\n\nDuring the Baringo Cultural Festival and Kimalel Goat Auction.",
    "likes": 977,
    "retweets": 113,
    "replies": 459,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1867161255557083151",
    "url": "https://x.com/WilliamsRuto/status/1867161255557083151",
    "created_at": "Thu Dec 12 10:55:08 +0000 2024",
    "text": "Strategies addressing unemployment, healthcare and food security are delivering tangible results. These successes won't be wished away by mere falsehoods intended to misinform the public. https://t.co/YCsFInFXJC",
    "likes": 72,
    "retweets": 11,
    "replies": 20,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1866777772607095253",
    "url": "https://x.com/WilliamsRuto/status/1866777772607095253",
    "created_at": "Wed Dec 11 09:31:18 +0000 2024",
    "text": "Religious faiths and the State serve the same people and have always worked together in ensuring national cohesion and providing social services, including education, health and helping the vulnerable. We commit to maintain this partnership.\n\nHosted Evangelical and Pentecostal church leaders, State House Nairobi, who were led by Redeemed Gospel Church Presiding Bishop Kepha Omae.",
    "likes": 873,
    "retweets": 127,
    "replies": 615,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1862043507847811468",
    "url": "https://x.com/WilliamsRuto/status/1862043507847811468",
    "created_at": "Thu Nov 28 07:59:02 +0000 2024",
    "text": "The animal vaccination programme we will roll out in January 2025 is meant to effectively control livestock diseases and ensure healthier breeds. Previously, this exercise has not been effective and efficient because it was done in selected parts of the country. \n\nUnder the new program, vaccination will cover 22 million cattle and 50 million sheep and goats in all parts of our country. It will be the beginning of more government investment in the livestock sub-sector to make it achieve its immense potential and make its full contribution to the economy.\n\nMet the leadership of the United Democratic Movement (UDM) party, State House Nairobi. They were led by party leader and Mandera Senator Ali Roba and deputy party leaders Mohamud Mohamud (Marsabit Governor) and Hon Abdullahi Bashir Sheikh (Mandera North).",
    "likes": 1381,
    "retweets": 184,
    "replies": 1390,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1861036580636373018",
    "url": "https://x.com/WilliamsRuto/status/1861036580636373018",
    "created_at": "Mon Nov 25 13:17:51 +0000 2024",
    "text": "Kenya and Wellcome Trust, an international charitable organisation dedicated to improving health through research, have had a 60-year partnership that has been mutually beneficial.\n\nThe organisation works with Kenya Medical Research Institute (KEMRI) in a programme that focuses on fighting malaria, pneumonia, meningitis, HIV and malnutrition.\n\nMet Dr @JuliaGillard, the chair of Wellcome Trust and former Prime Minister of Australia, State House, Nairobi. She is in Kenya for the celebration of 60 years of Kenya-Wellcome Trust partnership.",
    "likes": 530,
    "retweets": 112,
    "replies": 88,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1858775908380717393",
    "url": "https://x.com/WilliamsRuto/status/1858775908380717393",
    "created_at": "Tue Nov 19 07:34:45 +0000 2024",
    "text": "Delivering Universal Health Coverage, Laikipia County https://t.co/ncJq2aS9Zq",
    "likes": 402,
    "retweets": 106,
    "replies": 237,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1858436516260786600",
    "url": "https://x.com/WilliamsRuto/status/1858436516260786600",
    "created_at": "Mon Nov 18 09:06:08 +0000 2024",
    "text": "Delivering Universal Health Coverage, Isiolo County https://t.co/xI1qnRlx7T",
    "likes": 403,
    "retweets": 92,
    "replies": 303,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1857785568215679336",
    "url": "https://x.com/WilliamsRuto/status/1857785568215679336",
    "created_at": "Sat Nov 16 13:59:30 +0000 2024",
    "text": "Later, toured the Embu Level V Hospital to assess the roll-out of our Universal Health Coverage. https://t.co/0GdPyYwANO",
    "likes": 202,
    "retweets": 32,
    "replies": 48,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1851195986544062818",
    "url": "https://x.com/WilliamsRuto/status/1851195986544062818",
    "created_at": "Tue Oct 29 09:34:51 +0000 2024",
    "text": "The synergy we are building with the private sector promises to sustainably deliver impact at scale on our school meals programmes.\n\nBy 2030, every child — especially the vulnerable ones — will receive a healthy and nutritious meal in school. This will dignify them, increase enrolment, enhance attendance and boost performance.\n\nAt the Second Ministerial Meeting of the Task Force on the School Meals Coalition, Nairobi County.",
    "likes": 767,
    "retweets": 127,
    "replies": 398,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1851162831577891126",
    "url": "https://x.com/WilliamsRuto/status/1851162831577891126",
    "created_at": "Tue Oct 29 07:23:06 +0000 2024",
    "text": "Ministerial Meeting on the Global School Meals Coalition, Nairobi. https://t.co/uSN1yaA6SG",
    "likes": 706,
    "retweets": 115,
    "replies": 166,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849412427068125294",
    "url": "https://x.com/WilliamsRuto/status/1849412427068125294",
    "created_at": "Thu Oct 24 11:27:37 +0000 2024",
    "text": "We thank faith-based organisations for partnering with us to deliver affordable, accessible healthcare to Kenyans over the years. \n\nCommissioned the state-of-the-art Cardiothoracic Centre at the AGC Tenwek Mission Hospital, Bomet County. \n\nThe project was made possible with funding from the Samaritan's Purse and the World Gospel Mission. \n\nWe will review and scale down visa and work permit requirements for missionaries to ease their operations in the country.",
    "likes": 853,
    "retweets": 168,
    "replies": 285,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849392481206768079",
    "url": "https://x.com/WilliamsRuto/status/1849392481206768079",
    "created_at": "Thu Oct 24 10:08:22 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/Ot7y2kTMVB",
    "likes": 343,
    "retweets": 50,
    "replies": 84,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849392379545145360",
    "url": "https://x.com/WilliamsRuto/status/1849392379545145360",
    "created_at": "Thu Oct 24 10:07:57 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/sr2nZj4JM7",
    "likes": 184,
    "retweets": 24,
    "replies": 21,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849388952958214651",
    "url": "https://x.com/WilliamsRuto/status/1849388952958214651",
    "created_at": "Thu Oct 24 09:54:21 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/aHo5AnVJbl",
    "likes": 400,
    "retweets": 49,
    "replies": 73,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849387332899868842",
    "url": "https://x.com/WilliamsRuto/status/1849387332899868842",
    "created_at": "Thu Oct 24 09:47:54 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/Hm2BgtV5OX",
    "likes": 461,
    "retweets": 67,
    "replies": 115,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849382162853986697",
    "url": "https://x.com/WilliamsRuto/status/1849382162853986697",
    "created_at": "Thu Oct 24 09:27:22 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/LNi0furtZb",
    "likes": 443,
    "retweets": 65,
    "replies": 79,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849375646130258114",
    "url": "https://x.com/WilliamsRuto/status/1849375646130258114",
    "created_at": "Thu Oct 24 09:01:28 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/xbU8Y7rXPy",
    "likes": 397,
    "retweets": 54,
    "replies": 98,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849374935367782705",
    "url": "https://x.com/WilliamsRuto/status/1849374935367782705",
    "created_at": "Thu Oct 24 08:58:38 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/zoAoChB5z2",
    "likes": 396,
    "retweets": 52,
    "replies": 74,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1849373097000050758",
    "url": "https://x.com/WilliamsRuto/status/1849373097000050758",
    "created_at": "Thu Oct 24 08:51:20 +0000 2024",
    "text": "Commissioning of Cardiothoracic Centre, AGC Tenwek Hospital, Bomet County. https://t.co/ANNlVHoy3G",
    "likes": 409,
    "retweets": 65,
    "replies": 111,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1843319937508548789",
    "url": "https://x.com/WilliamsRuto/status/1843319937508548789",
    "created_at": "Mon Oct 07 15:58:14 +0000 2024",
    "text": "Kenya and Qatar are strengthening their bilateral cooperation in areas of mutual interest. We are working to eliminate barriers to labour mobility to create job opportunities for skilled Kenyans in Qatar. \n\nUnder a new Memorandum of Understanding (MoU) set to take effect in December 2024, Kenyan workers will gain increased access to professional roles in sectors such as health, ICT, education, and hospitality, with equal pay and benefits comparable to those of their international counterparts.\n\nDuring a meeting at @StateHouseKenya Nairobi, I held discussions with a delegation from Qatar led by the Minister of Labour, Dr. Ali bin Samikh Al-Marri, accompanied by Qatar’s Ambassador to Kenya, Mohammed Mutair Al-Enazi.\n\nAdditionally, we explored potential Qatari investments in Kenya, including support for the Affordable Housing Programme.",
    "likes": 1627,
    "retweets": 213,
    "replies": 583,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1841354797422657827",
    "url": "https://x.com/WilliamsRuto/status/1841354797422657827",
    "created_at": "Wed Oct 02 05:49:29 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: West Pokot County. https://t.co/Cv9PAu0syk",
    "likes": 537,
    "retweets": 93,
    "replies": 383,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1841002633147916584",
    "url": "https://x.com/WilliamsRuto/status/1841002633147916584",
    "created_at": "Tue Oct 01 06:30:06 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Turkana County. https://t.co/3iydvKt5GP",
    "likes": 1078,
    "retweets": 218,
    "replies": 1012,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1839369515580231871",
    "url": "https://x.com/WilliamsRuto/status/1839369515580231871",
    "created_at": "Thu Sep 26 18:20:41 +0000 2024",
    "text": "We applaud the International Atomic Energy Agency for spearheading the Atoms for Food Initiative — a joint effort with the Food and Agriculture Organisation.\n\nWe will advocate for the implementation of this initiative, which aims to harness the benefits of nuclear technology to enhance agricultural productivity, furthering food security in Africa and beyond.\n\nIn New York, met the Director General of the International Atomic Energy Agency, Rafael Mariano Grossi.\n\nWe also discussed the Organisation's provision of additional equipment for early detection and treatment of cancer in Kenya, as well as their role in promoting a peaceful and nuclear-free world.",
    "likes": 661,
    "retweets": 121,
    "replies": 150,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1838796775009767923",
    "url": "https://x.com/WilliamsRuto/status/1838796775009767923",
    "created_at": "Wed Sep 25 04:24:49 +0000 2024",
    "text": "Africa needs a multi-sectoral approach — including quality healthcare, education, and community support — to reduce mortality.\n\nIn Kenya, we have deployed Community Health Promoters to deliver crucial medical care directly to the grassroots, ensuring the well-being of women, children and other vulnerable groups for a sustainable future.\n\nDuring a High-Level event on securing the health and well-being of every woman, child and adolescent on the sidelines of the United Nations General Assembly, New York, hosted by South Africa President @CyrilRamaphosa.\n\nPresident of Liberia Joseph Boakai and Prime Minister of Tanzania Kassim Majaliwa were in attendance.",
    "likes": 645,
    "retweets": 117,
    "replies": 288,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1838692400727822734",
    "url": "https://x.com/WilliamsRuto/status/1838692400727822734",
    "created_at": "Tue Sep 24 21:30:04 +0000 2024",
    "text": "As we celebrate the gains made in combating HIV and Aids, we must also acknowledge the power of multilateralism in fostering transformative global partnerships.\n\nEffective multilateralism allowed us to engage with the Joint United Nations Programme on HIV and Aids, greatly enhancing our efforts in resource mobilisation, advocating the rights of people living with the infection and providing inclusive support.\n\nDuring a high-level meeting on “Multilateralism Works: Leadership and Sustaining the HIV Response to 2030 and Beyond”, New York. Kenya is the chair of the UNAIDS Board.",
    "likes": 240,
    "retweets": 62,
    "replies": 51,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1838665338902458368",
    "url": "https://x.com/WilliamsRuto/status/1838665338902458368",
    "created_at": "Tue Sep 24 19:42:32 +0000 2024",
    "text": "High-Level event on Securing the health and wellbeing of every woman, child and adolescent, New York. https://t.co/Tu2s3kbEoz",
    "likes": 246,
    "retweets": 51,
    "replies": 70,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1838664248588902481",
    "url": "https://x.com/WilliamsRuto/status/1838664248588902481",
    "created_at": "Tue Sep 24 19:38:12 +0000 2024",
    "text": "High-Level event on Securing the health and wellbeing of every woman, child and adolescent, New York. https://t.co/cOCM1f4AL3",
    "likes": 217,
    "retweets": 52,
    "replies": 69,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1838213039046484044",
    "url": "https://x.com/WilliamsRuto/status/1838213039046484044",
    "created_at": "Mon Sep 23 13:45:15 +0000 2024",
    "text": "Launch of the Program for Investment and Financing in Africa’s Health (PIFAH), New York. https://t.co/a7ad63cUox",
    "likes": 185,
    "retweets": 43,
    "replies": 42,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1838212238894834009",
    "url": "https://x.com/WilliamsRuto/status/1838212238894834009",
    "created_at": "Mon Sep 23 13:42:04 +0000 2024",
    "text": "Launch of the Program for Investment and Financing in Africa’s Health (PIFAH), New York. https://t.co/5esTfFDwl3",
    "likes": 248,
    "retweets": 70,
    "replies": 64,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1836704564281483583",
    "url": "https://x.com/WilliamsRuto/status/1836704564281483583",
    "created_at": "Thu Sep 19 09:51:07 +0000 2024",
    "text": "The roll-out of the Universal Health Coverage will require an all-of-government approach, including the counties, to mobilise Kenyans to understand the benefits of this transformative and inclusive programme. We call on everyone to register via *147# or https://t.co/ugZbW5ya8d ahead of the roll-out on October 1, 2024.\n\nMet Ministry of Health officials, governors and other stakeholders as we prepare for the launch of the Universal Health Coverage next month, State House, Nairobi County.",
    "likes": 663,
    "retweets": 138,
    "replies": 399,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1836369036830965942",
    "url": "https://x.com/WilliamsRuto/status/1836369036830965942",
    "created_at": "Wed Sep 18 11:37:51 +0000 2024",
    "text": "Othaya's Mwai Kibaki Hospital, an annexe of Kenyatta National Hospital, will be gazetted as a parastatal with a board and an independent budget. This elevation will ensure the health facility is fully equipped to enable it play its rightful role in the provision of Universal Health Coverage that begins next month.\n\nMet Nyeri MPs, State House Nairobi, and discussed the government's road, stadia, fresh produce markets and water programmes in the county.",
    "likes": 844,
    "retweets": 132,
    "replies": 256,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1829857454487748989",
    "url": "https://x.com/WilliamsRuto/status/1829857454487748989",
    "created_at": "Sat Aug 31 12:23:08 +0000 2024",
    "text": "The commissioning of the ultra-modern Nyabondo Trauma Centre in Kisumu County epitomises the Government’s commitment to the roll-out of the Universal Health Coverage. \n\nThe 150-bed capacity specialised facility — fitted with theatres, Intensive Care Unit and High Dependency Unit — enhances access to quality and affordable care to more than 5 million people in Nyanza Region.\n \nWith Deputy President @rigathi, Governors led by Prof @AnyangNyongo, MPs and MCAs, Nyakach Constituency.",
    "likes": 547,
    "retweets": 92,
    "replies": 115,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1829815531022832026",
    "url": "https://x.com/WilliamsRuto/status/1829815531022832026",
    "created_at": "Sat Aug 31 09:36:33 +0000 2024",
    "text": "Nyabondo Trauma Centre, Kisumu County. https://t.co/hsYhdGtNYq",
    "likes": 84,
    "retweets": 20,
    "replies": 28,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1829815494960140589",
    "url": "https://x.com/WilliamsRuto/status/1829815494960140589",
    "created_at": "Sat Aug 31 09:36:24 +0000 2024",
    "text": "Nyabondo Trauma Centre, Kisumu County. https://t.co/jHwpyTbd9t",
    "likes": 80,
    "retweets": 20,
    "replies": 10,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1829814644858634730",
    "url": "https://x.com/WilliamsRuto/status/1829814644858634730",
    "created_at": "Sat Aug 31 09:33:02 +0000 2024",
    "text": "Nyabondo Trauma Centre, Kisumu County. https://t.co/qoxeQ9reuu",
    "likes": 128,
    "retweets": 25,
    "replies": 24,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1829812059930050828",
    "url": "https://x.com/WilliamsRuto/status/1829812059930050828",
    "created_at": "Sat Aug 31 09:22:46 +0000 2024",
    "text": "Nyabondo Trauma Centre, Kisumu County. https://t.co/LGBtixq6KR",
    "likes": 120,
    "retweets": 24,
    "replies": 25,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1829134613886783992",
    "url": "https://x.com/WilliamsRuto/status/1829134613886783992",
    "created_at": "Thu Aug 29 12:30:50 +0000 2024",
    "text": "Better roads will open up many parts of rural Kenya for more investments, broaden economic opportunities and facilitate the provision of essential services such as medical care.\n\nDuring the commissioning of the Rusinga Ring Road, Homa Bay County. https://t.co/QJjSHYu99t",
    "likes": 713,
    "retweets": 115,
    "replies": 279,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1827009802955800923",
    "url": "https://x.com/WilliamsRuto/status/1827009802955800923",
    "created_at": "Fri Aug 23 15:47:35 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Embu County. https://t.co/xa58iEpkDB",
    "likes": 312,
    "retweets": 59,
    "replies": 218,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1826542923095154898",
    "url": "https://x.com/WilliamsRuto/status/1826542923095154898",
    "created_at": "Thu Aug 22 08:52:23 +0000 2024",
    "text": "I am encouraged by the resolve of leaders from North Eastern Kenya to work together irrespective of their political affiliation to develop the region. We are implementing programmes that will address socio-economic and developmental challenges in the region to ensure we unlock its economic potential.\n\nAt @StateHouseKenya Nairobi, held talks with leaders from Garissa, Wajir, Mandera Counties; we agreed to fast-track the implementation of programmes and infrastructure including roads and water, education, health, agriculture, and enhancing security in the region.",
    "likes": 821,
    "retweets": 132,
    "replies": 376,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1826471687891603894",
    "url": "https://x.com/WilliamsRuto/status/1826471687891603894",
    "created_at": "Thu Aug 22 04:09:19 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Kirinyaga County. https://t.co/JXiYdKwxPH",
    "likes": 443,
    "retweets": 96,
    "replies": 304,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1826315471609598415",
    "url": "https://x.com/WilliamsRuto/status/1826315471609598415",
    "created_at": "Wed Aug 21 17:48:34 +0000 2024",
    "text": "Kenya appreciates the support that it continues to receive from the Children Investment Fund Foundation in improving the lives of our children. We look forward to scaling up our ties in community health service programmes and climate change.\n\nMet the Children Investment Fund Foundation leadership led by its CEO @katehamptongray, @StateHouseKenya, Nairobi.",
    "likes": 638,
    "retweets": 98,
    "replies": 267,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1826188339944341753",
    "url": "https://x.com/WilliamsRuto/status/1826188339944341753",
    "created_at": "Wed Aug 21 09:23:23 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Kajiado County. https://t.co/4Tp1jtMWOt",
    "likes": 575,
    "retweets": 108,
    "replies": 360,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1825835739973624272",
    "url": "https://x.com/WilliamsRuto/status/1825835739973624272",
    "created_at": "Tue Aug 20 10:02:17 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Makueni County. https://t.co/DBBZM5LyNc",
    "likes": 389,
    "retweets": 77,
    "replies": 329,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1823297576243704129",
    "url": "https://x.com/WilliamsRuto/status/1823297576243704129",
    "created_at": "Tue Aug 13 09:56:32 +0000 2024",
    "text": "Every Kenyan — employed or unemployed — will access quality and affordable care under our new medical plan. \n\nCommissioned the Outpatient, Surgical and Mother and Child Units at the Keroka Level IV Hospital. \n\nWe have equiped the facility to the tune of Sh90 Million to ensure that the people of Nyamira County get the finest health service.",
    "likes": 530,
    "retweets": 127,
    "replies": 170,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1823273469955694814",
    "url": "https://x.com/WilliamsRuto/status/1823273469955694814",
    "created_at": "Tue Aug 13 08:20:44 +0000 2024",
    "text": "Commissioning of Outpatient, Surgical and Mother and Child Units,  Keroka Level IV Hospital⁠, Nyamira County. https://t.co/Yjb5dB3e9T",
    "likes": 189,
    "retweets": 51,
    "replies": 69,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1823268051883892909",
    "url": "https://x.com/WilliamsRuto/status/1823268051883892909",
    "created_at": "Tue Aug 13 07:59:12 +0000 2024",
    "text": "Commissioning of Outpatient, Surgical and Mother and Child Units,  Keroka Level IV Hospital⁠, Nyamira County. https://t.co/W1OtB0UbMb",
    "likes": 176,
    "retweets": 47,
    "replies": 67,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1823263951343251614",
    "url": "https://x.com/WilliamsRuto/status/1823263951343251614",
    "created_at": "Tue Aug 13 07:42:55 +0000 2024",
    "text": "After a full roll-out of our Universal Health Coverage, we will defeat cancer in our country. \n\nIn Nyaribari Chache Constituency, broke ground for the construction of Kisii County Cancer Treatment Centre.\n\nThe 76-bed facility will help in cancer awareness, prevention, screening, early detection and diagnosis, and provide the latest treatment options, including chemotherapy, radiotherapy and surgery.\n\nAccompanied by Deputy President @rigathi, Governor Simba Arati, MPs and MCAs, also addressed the residents and traders of Keumbu and committed to rehabilitate and expand the local fresh produce market.",
    "likes": 756,
    "retweets": 125,
    "replies": 286,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1823245381209391386",
    "url": "https://x.com/WilliamsRuto/status/1823245381209391386",
    "created_at": "Tue Aug 13 06:29:07 +0000 2024",
    "text": "Groundbreaking ceremony for the construction of Kisii Cancer Centre. https://t.co/mQbl3KzIxu",
    "likes": 304,
    "retweets": 66,
    "replies": 211,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1821150850481349071",
    "url": "https://x.com/WilliamsRuto/status/1821150850481349071",
    "created_at": "Wed Aug 07 11:46:12 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Machakos County. https://t.co/7EFQU5lNbo",
    "likes": 385,
    "retweets": 70,
    "replies": 134,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1820758781677957586",
    "url": "https://x.com/WilliamsRuto/status/1820758781677957586",
    "created_at": "Tue Aug 06 09:48:16 +0000 2024",
    "text": "Delivering the PLAN through Community Health Promoters: Kiambu County. https://t.co/URn8SG3xUE",
    "likes": 560,
    "retweets": 120,
    "replies": 295,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1820379687111008439",
    "url": "https://x.com/WilliamsRuto/status/1820379687111008439",
    "created_at": "Mon Aug 05 08:41:53 +0000 2024",
    "text": "The Supplementary Appropriation Bill makes available more resources for agriculture, education and healthcare.\n\nIt further anchors our Universal Health Coverage (UHC) through the funding of medical internship, UHC workers on contract and Community Health Promoters.\n\nThe Bill also supports the hiring of Junior School interns on permanent terms and the higher education new financing model.\n\nSigned the Supplementary Appropriation (No.2) Bill (National Assembly Bill No. 39 of 2024) into law, State House, Nairobi.",
    "likes": 1483,
    "retweets": 239,
    "replies": 524,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1817840159217356871",
    "url": "https://x.com/WilliamsRuto/status/1817840159217356871",
    "created_at": "Mon Jul 29 08:30:42 +0000 2024",
    "text": "In Nyali, Mombasa County, officially opened the Pwani School for the Mentally Challenged tuition block and laid the foundation stone for the Nyali Technical and Vocational Education and Training (TVET) centre. https://t.co/IKWqASB3P6",
    "likes": 1012,
    "retweets": 139,
    "replies": 292,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1816455561623601397",
    "url": "https://x.com/WilliamsRuto/status/1816455561623601397",
    "created_at": "Thu Jul 25 12:48:48 +0000 2024",
    "text": "Natasha Makena Memorial Outpatient Block, Kibugua Health Center, Tharaka Nithi County. https://t.co/GVwyGU16JN",
    "likes": 331,
    "retweets": 46,
    "replies": 117,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1816436063105093971",
    "url": "https://x.com/WilliamsRuto/status/1816436063105093971",
    "created_at": "Thu Jul 25 11:31:19 +0000 2024",
    "text": "Launched the Marimanti Kenya Medical Training College, Tharaka Nithi County, accompanied by Deputy President @rigathi, Governor Muthomi Njuki, MPs and MCAs. https://t.co/hrllHim9JL",
    "likes": 93,
    "retweets": 14,
    "replies": 22,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1816436036420907411",
    "url": "https://x.com/WilliamsRuto/status/1816436036420907411",
    "created_at": "Thu Jul 25 11:31:13 +0000 2024",
    "text": "The construction and equipping of Kenya Medical Training Colleges across the country will enhance the capacity of our health workers, guaranteeing Kenyans access to quality and affordable medical care. https://t.co/Js2XthKRv2",
    "likes": 573,
    "retweets": 69,
    "replies": 127,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1816396073583403081",
    "url": "https://x.com/WilliamsRuto/status/1816396073583403081",
    "created_at": "Thu Jul 25 08:52:25 +0000 2024",
    "text": "Launch of the Marimanti Kenya Medical Training College, Tharaka Nithi County. https://t.co/U9QOxyxPNU",
    "likes": 311,
    "retweets": 48,
    "replies": 137,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1816394996549050606",
    "url": "https://x.com/WilliamsRuto/status/1816394996549050606",
    "created_at": "Thu Jul 25 08:48:08 +0000 2024",
    "text": "Launch of the Marimanti Kenya Medical Training College, Tharaka Nithi County. https://t.co/VKQAa4Yt7w",
    "likes": 292,
    "retweets": 51,
    "replies": 105,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1806308578464038917",
    "url": "https://x.com/WilliamsRuto/status/1806308578464038917",
    "created_at": "Thu Jun 27 12:48:19 +0000 2024",
    "text": "Universal Health Coverage is a key promise in our manifesto. The programme aims at ensuring that all Kenyans access free quality health services, including for critical illnesses such as cancer.\n\nThe government has set up three funds to meet the cost of Universal Health Coverage. These are the Primary Health Care Fund, Social Health Insurance Fund and  Emergency Chronic and Critical Illness Fund.\n\nReceived a brief on the roll out of UHC from the Ministry of Health officials led by Cabinet Secretary Susan  @Nakhumicha_S and Principal Secretary @muthonikenya.",
    "likes": 6019,
    "retweets": 564,
    "replies": 3724,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1805292222809510395",
    "url": "https://x.com/WilliamsRuto/status/1805292222809510395",
    "created_at": "Mon Jun 24 17:29:41 +0000 2024",
    "text": "We will work with all leaders to liberate the Coast region - and other parts of our country - from drugs and substances use. This will make our societies healthier and productive.\n\nAt @StateHouseKenya, Nairobi, met Governors, MPs and county assembly leaders from all the coastal counties and agreed to form a committee of professionals to look at the issues touching on Miraa and Muguka. \n\nThe meeting followed another session that we had with the leaders from Embu on the ban of Muguka. We agreed to meet as leaders from the two sides to fashion a law that will protect the interests of both parties.",
    "likes": 2084,
    "retweets": 221,
    "replies": 1331,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1800579995242205515",
    "url": "https://x.com/WilliamsRuto/status/1800579995242205515",
    "created_at": "Tue Jun 11 17:24:58 +0000 2024",
    "text": "Our partnership with the Susan Thompson Buffett Foundation will enhance healthcare delivery by strengthening primary health care, community health strategies, commodity security, and workforce training. Additionally, it will enhance the transition of the Linda Mama Programme, expanding access to reproductive health services.\n\nMet the foundation's Vice President of Global Programmes Prof @DrSenait at @StateHouseKenya, Nairobi.",
    "likes": 831,
    "retweets": 119,
    "replies": 115,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1798367759379619975",
    "url": "https://x.com/WilliamsRuto/status/1798367759379619975",
    "created_at": "Wed Jun 05 14:54:20 +0000 2024",
    "text": "Kenya has formally joined the International Vaccine Institute (IVI) as a Member State, strengthening our country's resolve to achieve self-reliance in vaccine production. \n\nIncreased vaccine availability will enhance the delivery of our primary healthcare and disease prevention.\n\nDuring the accession ceremony of Kenya at IVI headquarters in Seoul, South Korea, in the company of IVI Director-General Jerome Kim.\n\nIVI committed to establish a Country and Project Office in Nairobi, which will be dedicated to the operations of its Advancing Vaccines End-to-End Capabilities (AVEC).",
    "likes": 954,
    "retweets": 158,
    "replies": 114,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1797892274019348902",
    "url": "https://x.com/WilliamsRuto/status/1797892274019348902",
    "created_at": "Tue Jun 04 07:24:56 +0000 2024",
    "text": "The Government of Korea and Korean investors have a critical role to play in turning Africa's enormous potential into opportunity and eventually investment.\n\nThe continent's assets include a dynamic youthful and skilled population, abundant arable land, huge renewable energy reserves and vast mineral resources. \n\nThrough a robust partnership with Korea, we also aim at enhancing the opportunities that provide jobs and economic growth in sectors such as food security, science and technology, and health security.\n\nAddressed the inaugural Korea-Africa Summit hosted by @President_KR at the Korea International Exhibition Center in Goyang, South Korea.",
    "likes": 1438,
    "retweets": 213,
    "replies": 203,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1792743639950516259",
    "url": "https://x.com/WilliamsRuto/status/1792743639950516259",
    "created_at": "Tue May 21 02:26:05 +0000 2024",
    "text": "Also witnessed the signing of MoUs between CDC and Kenya Medical Research Institute, the Ministry of Health and the U.S. President's Emergency Plan for AIDS Relief in developing a Sustainability Roadmap for Kenya’s HIV Programme and the joint proclamation for the operationalisation of the Kenya National Public Health Institute.",
    "likes": 1285,
    "retweets": 217,
    "replies": 74,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1792743261737525714",
    "url": "https://x.com/WilliamsRuto/status/1792743261737525714",
    "created_at": "Tue May 21 02:24:35 +0000 2024",
    "text": "The United States of America has been Kenya’s true ally in healthcare — from infrastructure, pioneering research to the tackling of infectious diseases. We intend to escalate this journey of partnership, including the local manufacturing of vaccines, for the prosperity of all.\n \nShared our thoughts on transforming the U.S.-Kenya health cooperation at the Centre for Disease Control Headquarters in Atlanta, Georgia, United States of America.",
    "likes": 1458,
    "retweets": 240,
    "replies": 179,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1792663366856757379",
    "url": "https://x.com/WilliamsRuto/status/1792663366856757379",
    "created_at": "Mon May 20 21:07:07 +0000 2024",
    "text": "Transforming the Kenya-US Health Partnership, Centers for Disease Control, Atlanta. https://t.co/6cRBf1RYQR",
    "likes": 370,
    "retweets": 108,
    "replies": 52,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1789228273441931486",
    "url": "https://x.com/WilliamsRuto/status/1789228273441931486",
    "created_at": "Sat May 11 09:37:17 +0000 2024",
    "text": "The Government is keen on addressing the persistent human resource inadequacies that slow the realisation of Universal Health Coverage. By continually engaging with stakeholders, including labour unions, we aim to promote industrial harmony and sustainable solutions to our challenges.\n\nHeld talks with the leadership of the Kenya Medical Practitioners Pharmacists and Dentists Union led by Secretary General Davji Atellah, State House, Nairobi.",
    "likes": 1377,
    "retweets": 176,
    "replies": 137,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1784197110931267794",
    "url": "https://x.com/WilliamsRuto/status/1784197110931267794",
    "created_at": "Sat Apr 27 12:25:14 +0000 2024",
    "text": "We are leveraging on our deep historical social, political and economic ties with Zimbabwe to unlock our untapped opportunities and utilise the abundant natural resources for the benefit of our citizens.\n \nHeld bilateral talks with President @edmnangagwa at State House Bulawayo, Zimbabwe.\n\nWe also witnessed the signing of nine MoUs between our two countries in the fields of transport, infrastructure, health, education, defense, trade and investments, among other areas.",
    "likes": 1043,
    "retweets": 171,
    "replies": 91,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1780497402757009649",
    "url": "https://x.com/WilliamsRuto/status/1780497402757009649",
    "created_at": "Wed Apr 17 07:23:55 +0000 2024",
    "text": "Kenya is committed to enhancing its bilateral ties with South Korea to boost trade and economic opportunities. We value their partnership in the development of our Technical and Vocational Education and Training (TVET), public health, water and sanitation and ICT sectors. We are looking forward to escalating our collaboration in the forthcoming Korea Africa Summit.\n\nMet South Korea's Special Presidential Envoy and 1st Vice Minister for Foreign Affairs, Hong Kyun Kim, State House, Nairobi. \n\nWe agreed to align our positions to promote adherence to international laws to foster global peace and stability.",
    "likes": 609,
    "retweets": 81,
    "replies": 38,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1772944051475566774",
    "url": "https://x.com/WilliamsRuto/status/1772944051475566774",
    "created_at": "Wed Mar 27 11:09:36 +0000 2024",
    "text": "Religious organisations continue to make significant contributions to national development. They work closely with the government in the provision of education and training, and health among others.\n\nMet the leadership of Akorino Church at State House Nairobi. The religious group has embarked on an investment drive, especially the establishment of savings and credit cooperatives, for its members in the counties.\n\nThe government will work with the church in training and building capacity in the management of saccos.\n\nThe team was led by Runyenjes MP Muchangi Karemba and Bishop Petro Kamuyu, the national chair of the Akorino Israel Organisation.",
    "likes": 795,
    "retweets": 95,
    "replies": 81,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1767934559146926155",
    "url": "https://x.com/WilliamsRuto/status/1767934559146926155",
    "created_at": "Wed Mar 13 15:23:40 +0000 2024",
    "text": "Alcohol and substance abuse is a major threat to our existence. The Cabinet’s endorsement of the measures to curb illegal brews and narcotic drugs will ensure that we save a generation and bring up our children in a healthy and safe environment.\n\nAt @StateHouseKenya, Nairobi County, chaired the Cabinet Meeting that agreed on a raft of measures to eliminate the alcohol and drugs menace.",
    "likes": 1742,
    "retweets": 235,
    "replies": 274,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1765384529571627050",
    "url": "https://x.com/WilliamsRuto/status/1765384529571627050",
    "created_at": "Wed Mar 06 14:30:45 +0000 2024",
    "text": "It is part of our Bottom Up Economic Transformation Agenda to boost our country's capacity in the research, development and manufacture of vaccines, both for humans and animals.\n\nThis agenda has been boosted by the International Vaccine Institute's decision to set up its Africa regional institute in Kenya. \n\nWitnessed the signing of a memorandum of understanding between @BioVaxInstitute and Hayat Biotech of the United Arab Emirates at @StateHouseKenya, Nairobi.",
    "likes": 944,
    "retweets": 133,
    "replies": 55,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1764363541098725869",
    "url": "https://x.com/WilliamsRuto/status/1764363541098725869",
    "created_at": "Sun Mar 03 18:53:43 +0000 2024",
    "text": "Religious institutions play an important role in our development. Their contribution, especially in health and education, has been immense. We will continue working with faith-based entities in serving the people of Kenya.\n\nMet the Salvation Army Kenya East Territorial Commander, Colonel Daniel Kiama, at State House, Nairobi.",
    "likes": 1072,
    "retweets": 113,
    "replies": 100,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1763263266044649629",
    "url": "https://x.com/WilliamsRuto/status/1763263266044649629",
    "created_at": "Thu Feb 29 18:01:37 +0000 2024",
    "text": "We are indebted to the World Health Organisation for its undertaking to support our Universal Health Coverage. We are confident that the legislative foundation we have laid for the programme will give us the desired results: access to affordable and quality health services to all.\n\nHosted the Director-General of the World Health Organisation @DrTedros at @StateHouseKenya, Nairobi.",
    "likes": 932,
    "retweets": 133,
    "replies": 56,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1759161475854180487",
    "url": "https://x.com/WilliamsRuto/status/1759161475854180487",
    "created_at": "Sun Feb 18 10:22:34 +0000 2024",
    "text": "Co-hosted a meeting on vaccine manufacturing in Africa with the International Vaccine Institute (IVI) in Addis Ababa, Ethiopia.   \n\nPresident Mohamed al-Menfi (Libya) was present. Others were Ahmed Hachani (Prime Minister, Tunisia), IVI Director-General Jerome Kim, Africa CDC Director-General Jean Kaseya, among others.",
    "likes": 427,
    "retweets": 92,
    "replies": 23,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1759120353735893032",
    "url": "https://x.com/WilliamsRuto/status/1759120353735893032",
    "created_at": "Sun Feb 18 07:39:09 +0000 2024",
    "text": "But this situation will change for the better. AU has resolved that by 2040, 60 per cent of vaccines used in Africa will be produced locally. This is underpinned by our solid research capacity in vaccines. Kenya, for instance, participated in the Covid-19 vaccine trials. https://t.co/7VttaLLK4K",
    "likes": 649,
    "retweets": 97,
    "replies": 40,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1759119954551431442",
    "url": "https://x.com/WilliamsRuto/status/1759119954551431442",
    "created_at": "Sun Feb 18 07:37:34 +0000 2024",
    "text": "The Covid-19 pandemic exposed the dire state of Africa's pharmaceutical manufacturing, including that of vaccines. We were the last continent to access Covid-19 vaccines, and suffered greatly from 'vaccine nationalism'. https://t.co/2FQbPlqahK",
    "likes": 430,
    "retweets": 76,
    "replies": 30,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1758493562818171356",
    "url": "https://x.com/WilliamsRuto/status/1758493562818171356",
    "created_at": "Fri Feb 16 14:08:31 +0000 2024",
    "text": "On behalf of the people and government of the Republic of Kenya, I convey my deep appreciation to @POTUS and @FLOTUS of the United States of America, for undertaking to host me at the White House, during a State Visit to the United States of America on May 23rd 2024.\n\nThis visit will provide an opportunity for our governments and nations to celebrate 60 years of diplomatic relations, which began at the dawn of Kenya's independence from colonial rule, and the birth of a free, open, democratic sovereign nation.\n\nI look forward to engaging with President Biden on a broad range of matters of mutual interest to our nations, not just in terms of sectors of economic, political and diplomatic spheres of endeavour, but also with respect to our shared commitment to the fundamental values which define the strong policy convergence and robust strategic alignment of our enterprises, peoples and governments. \n\nKenya views the state visit as a high profile opportunity to articulate a new era of dynamic partnership aimed at transforming trade and investment, green energy and climate action, digital technology and innovation, health and human development, peace and security as well as multilateralism and collective action to deliver shared prosperity for Kenya, Africa, the Global South and the entire world.",
    "likes": 3155,
    "retweets": 560,
    "replies": 892,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1758490322932289889",
    "url": "https://x.com/WilliamsRuto/status/1758490322932289889",
    "created_at": "Fri Feb 16 13:55:38 +0000 2024",
    "text": "Kenya appreciates the significant contribution of the Aga Khan Development Network in the fields of health, education, financial services and energy. https://t.co/yeVlIGgndy",
    "likes": 733,
    "retweets": 102,
    "replies": 22,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1758072393023500567",
    "url": "https://x.com/WilliamsRuto/status/1758072393023500567",
    "created_at": "Thu Feb 15 10:14:56 +0000 2024",
    "text": "We are taking clean drinking water to every household so that people can live longer and healthier. Sustained access to sufficient water supply will also keep our children in school and accelerate our country’s economic growth. https://t.co/gfBtrZM37p",
    "likes": 938,
    "retweets": 131,
    "replies": 99,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1757801818715722095",
    "url": "https://x.com/WilliamsRuto/status/1757801818715722095",
    "created_at": "Wed Feb 14 16:19:46 +0000 2024",
    "text": "Commissioned the Kangema Kenya Medical Training College, Murang’a County. https://t.co/9f0rovRR1D",
    "likes": 926,
    "retweets": 83,
    "replies": 82,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1757801333023817805",
    "url": "https://x.com/WilliamsRuto/status/1757801333023817805",
    "created_at": "Wed Feb 14 16:17:50 +0000 2024",
    "text": "We committed to ensure that all Kenyans have access to quality healthcare. This remains the Government’s priority as we roll out the Universal Health Coverage across the country. https://t.co/OvgPIfOsdo",
    "likes": 693,
    "retweets": 81,
    "replies": 32,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1757768162597274103",
    "url": "https://x.com/WilliamsRuto/status/1757768162597274103",
    "created_at": "Wed Feb 14 14:06:02 +0000 2024",
    "text": "Inauguration of Kenya Medical Training College-Kangema Campus, Murang'a County. https://t.co/EUAHc9t8L7",
    "likes": 264,
    "retweets": 43,
    "replies": 28,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1755503756660060378",
    "url": "https://x.com/WilliamsRuto/status/1755503756660060378",
    "created_at": "Thu Feb 08 08:08:05 +0000 2024",
    "text": "Japan International Cooperation Agency (JICA) has been the cornerstone of our ties with Japan in health, education, water and infrastructure. The agency epitomises the very positive aspects of development in our country, especially in rural areas. https://t.co/VBARGaMA9o",
    "likes": 308,
    "retweets": 56,
    "replies": 19,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1753808534150516836",
    "url": "https://x.com/WilliamsRuto/status/1753808534150516836",
    "created_at": "Sat Feb 03 15:51:53 +0000 2024",
    "text": "Accompanied by Speaker @HonWetangula, Governor Wilber Ottichilo, MPs and MCAs, officially opened the Hamisi Sub-County Hospital Twin Theatre Unit, Vihiga County. https://t.co/CjrqFLJ8QA",
    "likes": 620,
    "retweets": 67,
    "replies": 62,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1753808011930304563",
    "url": "https://x.com/WilliamsRuto/status/1753808011930304563",
    "created_at": "Sat Feb 03 15:49:48 +0000 2024",
    "text": "The injection of more resources into our healthcare system guarantees every Kenyan access to quality services and reduces their financial burden. https://t.co/zuQypdqSrN",
    "likes": 526,
    "retweets": 61,
    "replies": 61,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1753758231552524410",
    "url": "https://x.com/WilliamsRuto/status/1753758231552524410",
    "created_at": "Sat Feb 03 12:32:00 +0000 2024",
    "text": "Official opening of Hamisi Sub-County Hospital Twin Theatre Unit, Vihiga County. https://t.co/h3UGkRCZYG",
    "likes": 202,
    "retweets": 33,
    "replies": 29,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1753732101076062548",
    "url": "https://x.com/WilliamsRuto/status/1753732101076062548",
    "created_at": "Sat Feb 03 10:48:10 +0000 2024",
    "text": "The launch of the Kenya Medical Training College - Ikolomani Campus, will provide Iguhu County Referral with quality medical care professionals and improve service delivery. https://t.co/Um2mXgWGKQ",
    "likes": 648,
    "retweets": 67,
    "replies": 34,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1753731714734538829",
    "url": "https://x.com/WilliamsRuto/status/1753731714734538829",
    "created_at": "Sat Feb 03 10:46:38 +0000 2024",
    "text": "Iguhu County Referral Hospital is central to the well-being of the people of Ikolomani. The facility not only offers basic but also emergency care and specialised treatment to more than 30,000 people of Kakamega and the neighbouring Vihiga County. https://t.co/OQUnNtzNgE",
    "likes": 310,
    "retweets": 40,
    "replies": 17,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1753731644555743356",
    "url": "https://x.com/WilliamsRuto/status/1753731644555743356",
    "created_at": "Sat Feb 03 10:46:21 +0000 2024",
    "text": "Iguhu County Referral Hospital is central to the well-being of the people of Ikolomani. The facility not only offers basic but also emergency care and specialised treatment to more than 30,000 people of Kakamega and the neighbouring Vihiga County. https://t.co/O6u1QnKVi1",
    "likes": 276,
    "retweets": 30,
    "replies": 12,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1752327879776522661",
    "url": "https://x.com/WilliamsRuto/status/1752327879776522661",
    "created_at": "Tue Jan 30 13:48:17 +0000 2024",
    "text": "We are excited by the decision taken by Italy to settle on Nairobi as its medical services hub to serve our region. This will enhance our Universal Health Coverage plan. Kenya looks forward to broadening its ties in other strategic areas such as security, water and transport. https://t.co/rGkA0mTQ9s",
    "likes": 1429,
    "retweets": 205,
    "replies": 171,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1752007001918541914",
    "url": "https://x.com/WilliamsRuto/status/1752007001918541914",
    "created_at": "Mon Jan 29 16:33:14 +0000 2024",
    "text": "With the Executive Director of the World Food Programme @WFPChief in Rome, Italy, discussed the harmonisation of our tacts to increase food production in Kenya. https://t.co/vCaSMbRyQW",
    "likes": 790,
    "retweets": 103,
    "replies": 123,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1752006833911570673",
    "url": "https://x.com/WilliamsRuto/status/1752006833911570673",
    "created_at": "Mon Jan 29 16:32:34 +0000 2024",
    "text": "Kenya is keen on working with the World Food Programme to tackle famine and end hunger. Our expanded partnership on irrigation-fed agriculture will ensure that we produce more to feed more people, hence reduce our food import bill. https://t.co/lwf8t93NBd",
    "likes": 449,
    "retweets": 70,
    "replies": 82,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1750929602292166909",
    "url": "https://x.com/WilliamsRuto/status/1750929602292166909",
    "created_at": "Fri Jan 26 17:12:02 +0000 2024",
    "text": "The training and hiring of more health workers by the Government will ensure that our hospitals have enough nurses, doctors, paramedics, dentists, pharmacists, community health promoters, among other medical care professionals, to deliver on our Universal Health Coverage plan. https://t.co/4KVRvYkfYO",
    "likes": 426,
    "retweets": 80,
    "replies": 58,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1750883550273143255",
    "url": "https://x.com/WilliamsRuto/status/1750883550273143255",
    "created_at": "Fri Jan 26 14:09:02 +0000 2024",
    "text": "Official Commissioning of KMTC Maua Campus Medical and Skills Laboratories, Meru County. https://t.co/HuBeWk0zCW",
    "likes": 308,
    "retweets": 40,
    "replies": 41,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1746568719122256063",
    "url": "https://x.com/WilliamsRuto/status/1746568719122256063",
    "created_at": "Sun Jan 14 16:23:26 +0000 2024",
    "text": "We are committed to providing every Kenyan with access to quality and affordable healthcare. This is the vision of our Universal Healthcare Programme. Equipping our facilities, implementing the new healthcare laws and supporting our Community Health Promoters will fast-track the realisation of this precious agenda.",
    "likes": 724,
    "retweets": 107,
    "replies": 80,
    "author": "William Samoei Ruto, PhD"
  },
  {
    "username": "WilliamsRuto",
    "tweet_id": "1746566377626870093",
    "url": "https://x.com/WilliamsRuto/status/1746566377626870093",
    "created_at": "Sun Jan 14 16:14:08 +0000 2024",
    "text": "Officially inaugurated the Mother and Child Hospital at Iten County Referral Hospital in Elgeyo Marakwet. https://t.co/DlhTHnwMFW",
    "likes": 603,
    "retweets": 79,
    "replies": 49,
    "author": "William Samoei Ruto, PhD"
  }
]